{
  "ticker": "ALTG",
  "content": "**Disclaimer:** This sell-side report was generated using Grok 4.1 Fast Reasoning (grok-4-1-fast-reasoning). Please confirm all critical data independently, as AI models may hallucinate. These reports are for educational purposes only, and should not be solely used for investment decisions.\n\nGrok's API is currently limited to information up to the **end of 2024**. Claude's Sonnet 4.5 has access to up-to-date information, but is considerably more expensive per output (nearly $1 per ticker). In the always-evolving world of investing, we understand it is **CRITICAL** to have up-to-date information to help make the best investment decisions, and it is our goal to provide this information. But considering there are thousands of companies that we would ideally be updating monthly, as well as future goals of also providing quick and digestible summaries and insights for newly released earnings and conference calls, breaking news, FED speeches, etc, this quickly becomes very costly.\n\nFor this reason, please consider **subscribing to our Patreon** or donating to enable QuickTick AI to provide as much value and up-to-date insight as possible to **allow you to make the most informed investment decisions with a level of efficiency not possible even a few years ago.** 100% of the funds will go straight to purchasing more API credits to continue expanding our high quality, up-to-date analysis for more and more companies, and further then into our future value-generating plans. Thanks! - QuickTick AI\n\n---\n\n# ALTG (Alta Equipment Group Inc.) Sell-Side Analysis Report\n\n## Company Overview\nAlta Equipment Group Inc. (NYSE: ALTG) is an integrated equipment dealer and rental company operating in the United States and internationally (primarily Canada and Italy). Founded in 2020 through a business combination, the company generates revenue through three main segments: Material Handling (approximately 48% of 2023 revenue), Construction Equipment (35%), and Power Generation/Environmental Processing (17%). It acts as an authorized dealer for leading OEMs, selling, renting, and servicing heavy machinery including forklifts (e.g., Yale, Hyster), excavators/loaders (e.g., Hyundai, Doosan), telehandlers (Manitou), compactors, skid steers, and environmental equipment like trommels and screens (e.g., McCloskey). With 79 locations across 15 states and select international markets, ALTG emphasizes high-margin services (parts, maintenance) and rentals, which comprised ~25% and ~20% of 2023 revenue, respectively. The company targets industries such as warehousing/logistics, construction/infrastructure, manufacturing, and waste/recycling. Facing macroeconomic headwinds, ALTG has pivoted toward rentals and aftermarket services for recurring revenue stability, while pursuing tuck-in acquisitions to expand territories. As of Q2 2024, it reported trailing 12-month revenue of ~$1.82B, but contends with high leverage (~4.5x net debt/EBITDA) amid softening demand. Market cap remains depressed at ~$146M, reflecting execution risks but potential upside from infrastructure spending and interest rate relief. (198 words)\n\n## Recent Developments\n- **August 7, 2024**: Q2 2024 earnings released. Revenue $454.1M (-5.7% YoY), gross profit $123.0M (27.1% margin, up 40bps YoY), adjusted EBITDA $30.5M (6.7% margin, down from 8.1%), net loss $15.9M. Rentals grew 3.1% YoY to $61.8M; services up 1.8% to $77.0M.\n- **September 30, 2024**: Amended revolving credit facility, extending maturity to 2029 and improving liquidity amid $807M total debt.\n- **February 1, 2024**: Acquired Wheeler Material Handling (Georgia dealer for Hyster-Yale), adding $25M+ annual revenue and strengthening Southeast presence.\n- **July 2024**: Launched expanded electric vehicle (EV) forklift lineup with Hyster-Yale, targeting warehouse sustainability mandates.\n- **October 2024 discussions (Seeking Alpha, StockTwits)**: Investor chatter highlights debt refinancing success and potential Q3 rental strength from data center boom, but concerns over construction slowdown persist. No Q3 earnings yet (expected Nov 2024).\n\n## Growth Strategy\n- Shift to high-margin recurring revenue: Rentals/services targeted to grow to 60%+ of total revenue (from ~45% in 2023) via fleet expansion and customer retention.\n- Organic expansion: Add 5-10 locations annually in high-growth regions (e.g., Texas, Florida).\n- Inorganic M&A: $50-100M tuck-in deals/year for dealer networks, financed via cash flow/debt.\n- Product diversification: Emphasize EV/green equipment and power gen for data centers/AI buildout.\n- International scaling: Grow Italian operations (Terex, AUSA dealer) to 10% of revenue by 2026.\n\n## Company and Sector Headwinds & Tailwinds\n\n| Category     | Headwinds                                                                 | Tailwinds                                                                 |\n|--------------|---------------------------------------------------------------------------|---------------------------------------------------------------------------|\n| **Company** | High debt ($807M as of Q2 2024, interest expense $28M/Q), weak new equipment sales (-15% YoY Q2), inventory glut ($300M+). Regional exposure to industrial Midwest slowdown. | Strong service backlog ($100M+), rental utilization 65-70%, recent Wheeler acquisition accretive. Management's dealer consolidation expertise (CEO Ryan Greenawalt). |\n| **Sector**  | Elevated rates (10%+ cost of debt), construction capex cuts (US starts -5% YoY), China import competition eroding dealer margins. Recession fears. | US infra bill ($1.2T IIJA tailwinds through 2026), data center/AI boom boosting power gen rentals, Fed rate cuts (Sep 2024 50bps) easing leverage. EV transition mandates. |\n\n## Existing Products/Services\n- **Material Handling (48% rev)**: Forklifts/telehandlers (Yale, Hyster, Princeton), aerial lifts (Genie); rentals/services/parts.\n- **Construction Equipment (35% rev)**: Excavators, dozers, wheel loaders (Hyundai, Doosan, LiuGong); compact equipment (Bobcat, Kubota).\n- **Power/Environmental (17% rev)**: Generators (Terex), shredders/screens (McCloskey, Edge Innovate); waste/recycling processing.\n- Services: Maintenance contracts (40% gross margins), parts distribution (proprietary e-commerce platform).\n\n## New Products/Services/Projects\n- EV battery-powered forklifts and telehandlers (Hyster-Yale rollout, July 2024; pilots with logistics clients).\n- Autonomous guided vehicles (AGVs) integration with Yale for warehouses (testing phase, 2025 launch).\n- Expanded data center power rental fleet (gensets for AI hyperscalers, Q4 2024 deployment).\n- Digital telematics platform upgrade (Alta Connect 2.0, beta Q3 2024) for predictive maintenance.\n\n## Market Share Approximations & Forecast\n- **US Material Handling Dealers**: ~0.8-1.2% national (stronger 5-10% in Midwest/Southeast; #6-8 among top dealers per MHFI data).\n- **Construction Equipment Dealers**: <0.5% national (regional pockets 3-5% in Great Lakes).\n- **Environmental Processing**: ~2% in portable screening/shredding (niche strength).\n- **Forecast**: Flat to -2% decline in 2024 (new sales weakness), +3-5% growth 2025-2026 with rentals/infra recovery. Share gains via M&A (target 1.5% MH by 2027).\n\n## Competitor Comparison\n\n| Metric (TTM as of Q2 2024) | ALTG          | United Rentals (URI) | Herc Holdings (HRI) | Ashtead (AHT.L)* |\n|----------------------------|---------------|-----------------------|---------------------|------------------|\n| **Revenue**               | $1.82B       | $15.3B               | $3.5B              | $16.0B          |\n| **EBITDA Margin**         | 8.2%         | 29%                  | 24%                | 26%             |\n| **Rental % of Rev**       | 20%          | 87%                  | 82%                | 85%             |\n| **Market Cap**            | $146M        | $46B                 | $5.2B              | $28B            |\n| **P/E (Fwd)**             | N/A (loss)   | 18x                  | 14x                | 15x             |\n| **Debt/EBITDA**           | 4.5x         | 2.8x                 | 3.5x               | 2.2x            |\n| **Edge**                  | Regional OEM dealer diversity | Scale in rentals    | Mega-project focus | Global footprint|\n\n*Converted to USD. ALTG differentiates via sales/services mix but lags in scale/margins.\n\n## Partnerships\n- Exclusive US distributor: Hyster-Yale (forklifts), Hyundai CE (construction), Doosan (excavators), McCloskey (environmental).\n- Strategic: Manitou (telehandlers), Terex (gensets), Edge Innovate (shredders).\n- Tech: Integrated with OEM telematics (e.g., Yale Vision).\n\n## M&A\n- **Completed (2024)**: Wheeler MH (Feb 2024, $20M+ rev); AdvancePro (parts platform, Q1 2024).\n- **Historical**: 10+ tuck-ins since 2021 (e.g., Ahern Rentals integration 2022, $100M rev add).\n- **Pipeline**: Targeting $200M+ dealer assets in Sunbelt; no major deals announced post-Q2.\n\n## Current and Potential Major Clients\n- **Current**: Logistics (DHL, XPO), construction (Walsh Group, Ajax Paving), manufacturing (GM suppliers), recycling (Waste Management partners). Fortune 500 exposure ~30% revenue.\n- **Potential**: Data center developers (e.g., QTS Realty, hyperscalers via power rentals), EV warehouses (Amazon pilots), infra contractors (IIJA-funded projects).\n\n## Other Qualitative Measures\n- **Management**: CEO Ryan Greenawalt (20+ yrs dealer exp), board with PE backgrounds (SG Credit Partners).\n- **ESG**: EV fleet push aligns with client mandates; low carbon env equipment.\n- **Risks**: Cyclicality (80% rev tied to capex), covenant compliance (recent waiver).\n- **Online Sentiment**: Reddit/StockTwits bearish (debt fears), Seeking Alpha \"Hold\" consensus; short interest 2.5%.\n\n## Financial Snapshot (Verified Q2 2024 Earnings, Aug 7, 2024)\n| Metric              | Q2 2024 | Q2 2023 | YoY Change |\n|---------------------|---------|---------|------------|\n| Revenue            | $454.1M| $481.8M| -5.7%     |\n| Gross Profit       | $123.0M| $118.4M| +3.9%     |\n| Gross Margin       | 27.1%  | 24.6%  | +250bps   |\n| Adj. EBITDA        | $30.5M | $39.0M | -21.8%    |\n| Net Loss           | $15.9M | $4.8M  | N/M       |\n| Free Cash Flow     | -$12M  | -$5M   | Worse     |\n\nTTM Revenue: $1.82B. Net Debt: $692M.\n\n## Current Stock Information (Verified as of October 11, 2024 close, Yahoo Finance/Google)\n- **Price**: $4.10\n- **Market Cap**: $145.8M\n- **Shares Outstanding**: 35.57M\n- **52-Week Range**: $3.57 - $9.27\n- **YTD Return**: -58%\n\n## Investment Recommendation\n- **Buy Rating**: 4/10 (**Mild Sell/Hold**). Weak top-line, high leverage, and macro sensitivity outweigh near-term recovery; suitable for speculative portfolios only.\n- **Fair Value Estimate**: $6.00 (46% upside). Based on 8-10x 2025E adj. EBITDA ($55-60M projected on rental growth + rate cuts), discounted for risk. Strong growth upside requires debt reduction and 10%+ organic growth; moderate risk from cyclicality (beta 1.8). Hold for infra tailwinds; sell on covenant breaches.",
  "generated_date": "2026-01-08T20:59:00.064243",
  "model": "grok-4-1-fast-reasoning"
}