{
  "ticker": "CF",
  "content": "**Report Generated:** January 23, 2026  \n**Next Refresh:** April 24, 2026\n\n**Disclaimer:** This sell-side report was generated using Claude Sonnet 4 (claude-sonnet-4-20250514). Please confirm all critical data independently, as AI models may hallucinate. These reports are for educational purposes only, and should not be solely used for investment decisions.\n\n---\n\n# CF Industries Holdings, Inc. (CF) - Comprehensive Analysis Report\n\n## 1. Company Overview\n\nCF Industries Holdings, Inc., together with its subsidiaries, engages in the manufacture and sale of hydrogen and nitrogen products for energy, fertilizer, emissions abatement, and other industrial activities in North America, Europe, and internationally. The company operates through Ammonia, Granular Urea, UAN, AN, and Other segments. Its principal products include anhydrous ammonia, granular urea, urea ammonium nitrate, and ammonium nitrate products. The company also offers diesel exhaust fluid, urea liquor, nitric acid, and aqua ammonia products. It primarily serves cooperatives, retailers, independent fertilizer distributors, traders, wholesalers, and industrial users. CF Industries Holdings, Inc. was founded in 1946 and is headquartered in Northbrook, Illinois.\n\nCF Industries Holdings, Inc. is a global manufacturer of hydrogen and nitrogen products. The Company is focused on decarbonizing its ammonia production network to enable low-carbon hydrogen and nitrogen products for energy, fertilizer, emissions abatement and other industrial activities. CF Industries is the largest nitrogen producer in North America, with operations in the United States and Canada. CF's plants, which benefit from low-cost North American natural gas, are connected to its main customers in the US Corn Belt by an extensive distribution network of pipelines, rail, and barge, giving the company a transportation cost advantage over foreign competition.\n\n## 2. Current Market Data\n\n**Stock Price & Market Cap:**\n- Current stock price: $89.23 (as of January 22, 2026), giving the company a market capitalization of $13.91B\n- Alternative market cap data: As of January 2026 CF Industries has a market cap of $14.45 Billion USD\n- CF Industries currently has 155,974,644 outstanding shares. With CF Industries stock trading at $85.05 per share, the total value of CF Industries stock (market capitalization) is $13.27B\n- P/E multiple of 11.07 and pays a dividend yield of 2.2%\n- The CF Industries Holdings 52-week high stock price is 104.45, which is 20.4% above the current share price. The CF Industries Holdings 52-week low stock price is 67.34, which is 22.4% below the current share price.\n\n**Analyst Coverage:**\n- According to 15 analysts, the average rating for CF stock is \"Hold.\" The 12-month stock price target is $91.86, which is an increase of 13.70% from the latest price.\n- The average 12 month target price among analysts that have issued ratings on the stock in the last year is $93.0625\n- UBS analyst, Joshua Spector, has lowered the price target for CF Industries, bringing it down to $86 from $91, while maintaining a Neutral stance on the company's shares.\n\n## 3. Existing Products/Services\n\nCF Industries' principal products include anhydrous ammonia, granular urea, urea ammonium nitrate, and ammonium nitrate products. The company also offers diesel exhaust fluid, urea liquor, nitric acid, and aqua ammonia products.\n\n**Business Segments:**\n- Ammonia segment produces anhydrous ammonia. The Granular Urea segment offers granular urea. The UAN segment focuses on urea ammonium nitrate solution. The AN segment refers to the production of ammonium nitrate. The Other segment includes diesel exhaust fluid, nitric acid, urea liquor, and aqua ammonia.\n\n**Core Product:**\n- Its core product is anhydrous ammonia (ammonia), which contains 82% nitrogen and 18% hydrogen.\n- Its nitrogen products that are upgraded from ammonia are granular urea, UAN and AN. Its other nitrogen products include diesel exhaust fluid (DEF), urea liquor, nitric acid and aqua ammonia, which are sold primarily to its industrial customers, and compound fertilizer products (NPKs), which are solid granular fertilizer products for which the nutrient content is a combination of nitrogen, phosphorus and potassium.\n\n## 4. Planned Products/Services/Projects\n\n**Blue Point Mega Project:**\nPre-construction activities and engineering evaluations will begin in 2025 at CF Industries' Blue Point Complex in Ascension Parish, Louisiana. Construction of the ammonia production facility is expected to begin in 2026, with low-carbon ammonia production expected in 2029.\n\nCF Industries has secured a significant contract for the Blue Point Number One ATR Project, an ambitious low-carbon ammonia production facility planned for Donaldsonville, Louisiana. The project is being led by a joint venture comprising CF Industries, JERA Co., Inc., and Mitsui & Co., Ltd., and is positioned to be the largest ammonia plant in the world by nameplate capacity, targeting approximately 1.4 million metric tons per year of production.\n\n**Donaldsonville CCS Project:**\nAs a result of its Donaldsonville CCS project, CF Industries expects to produce approximately 1.9 million tons of low-carbon ammonia on an annual basis. CF Industries also expects to qualify for tax credits under Section 45Q of the Internal Revenue Code, which provides a credit per metric ton of CO2 stored.\n\n**Yazoo City CCS Project:**\nCF Industries announced that it is moving forward with a carbon capture and sequestration (CCS) project at its Yazoo City, Mississippi, Complex that is expected to reduce carbon dioxide (CO2) emitted to the atmosphere from the facility by up to 500,000 metric tons annually. Sequestration is expected to start in 2028. CF Industries will invest approximately $100 million into its Yazoo City Complex to build a CO2 dehydration and compression unit to enable up to 500,000 metric tons of CO2 generated as a byproduct of the ammonia production process and subsequently captured to be transported and stored.\n\n## 5. Growth Strategy\n\n**Decarbonization Focus:**\nCF Industries is on a path to decarbonize our ammonia production network – the world's largest – to enable low-carbon hydrogen and nitrogen products for energy, fertilizer, emissions abatement and other industrial activities.\n\n\"The CF Industries team continues to deliver outstanding results, working safely and operating our network well against the backdrop of continued constructive global nitrogen industry dynamics, driving strong free cash generation in the quarter and over the last 12 months. We also reached a milestone in our clean energy strategy by both capturing a premium price for our first cargoes of certified low-carbon ammonia and earning 45Q tax credits as expected. The financial benefits from our investments in low-carbon ammonia and decarbonization projects are earning a very high rate of return for our shareholders.\"\n\n**Production Capacity Expansion:**\nSince 2010, the company has increased production capacity by 36% while decreasing its share count by 56%, resulting in a tripling of annual nitrogen equivalent tons per 1,000 shares outstanding from 17 in 2010 to 52 in Q3 2025.\n\n## 6. Current and Potential Major Clients\n\n**Customer Base:**\nIt primarily serves cooperatives, retailers, independent fertilizer distributors, traders, wholesalers, and industrial users.\n\n**Key Partnerships:**\nTrafigura, a market leader in the global commodities industry, purchased the ammonia for shipment to Envalior, a global leader in Engineering Materials, which intends to use the low-carbon ammonia for the production of low-carbon caprolactam.\n\nJERA plans to offtake 490,000 tons and is considering supplying it primarily to its Hekinan thermal power station in central Japan, though specifics are yet to be finalised. JERA, jointly owned by Tokyo Electric Power and Chubu Electric Power, aims to start commercial co-firing of 20% ammonia with coal at two Hekinan units by 2030, requiring about 1 million tons of ammonia annually.\n\n## 7. Financial Data & Performance\n\n**2025 Performance:**\nCF Industries reported Q3 2025 net earnings of $353 million ($2.19 per diluted share), up from $276 million ($1.55 per diluted share) in Q3 2024. For the first nine months of 2025, the company achieved net earnings of $1.1 billion ($6.39 per diluted share) and adjusted EBITDA of $2.1 billion, representing a 20% increase compared to the first nine months of 2024.\n\nThe company maintained exceptional operational efficiency with a 97% capacity utilization rate.\n\n**2024 Full Year Results:**\nFor the full year 2024, net earnings attributable to common stockholders were $1.22 billion, or $6.74 per diluted share, EBITDA was $2.33 billion, and adjusted EBITDA was $2.28 billion. Capital expenditures in the fourth quarter and full year 2024 were $197 million and $518 million, respectively.\n\nIn 2024, CF Industries Holdings's revenue was $5.94 billion, a decrease of -10.48% compared to the previous year's $6.63 billion. Earnings were $1.22 billion, a decrease of -20.13%.\n\n**Cash Flow & Returns:**\nCF Industries continues to generate substantial free cash flow, reporting $1.7 billion in the last twelve months ending Q3 2025. The company has maintained a strong free cash flow to adjusted EBITDA conversion rate of 65%, demonstrating its efficient cash generation capabilities.\n\nDuring the first nine months of 2025, CF Industries returned approximately $1.3 billion to shareholders through share repurchases and dividends. In October 2025, the company completed a $3 billion share repurchase authorization and commenced a new $2 billion repurchase program expiring in December 2029.\n\n**Financial Metrics:**\nCF Industries Holdings, Inc. EBITDA is 3.29 B USD, and current EBITDA margin is 44.91%.\n\n## 8. Headwinds & Tailwinds\n\n**Tailwinds:**\n- Global nitrogen pricing was supported in the fourth quarter of 2024 by positive global demand, constrained supply availability due in part to natural gas shortages in Iran and Egypt, and China's continued restrictions on urea exports. In the near-term, management expects the global supply-demand balance to remain constructive, as inventories globally are believed to be below average and production economics for the industry's marginal producers in Europe remain challenging.\n- The Company currently forecasts average U.S. corn returns above soybeans, due in part to improving corn prices from strong corn exports and lower 2024 yield estimates, which is expected to be positive for corn plantings and nitrogen demand in the region. Management expects corn plantings in the United States in 2025 will be approximately 93 million acres.\n\n**Headwinds:**\n- Soybeans, which do not require nitrogen fertilizer, have seen a growing share of planted acres in North America, hurting nitrogen fertilizer demand.\n- Henry Hub prices oscillated between USD 2.10 and USD 6.80 per MMBtu in 2024, driving a 224% range that translates almost directly into nitrogen production costs because feedstock accounts for up to 80% of ammonia expenditure. CF Industries notes that every USD 1.00 swing moves annual margins by as much as USD 55 million.\n\n## 9. Market Shares\n\n**Global Position:**\nHeadquartered in Norway, Yara International is the largest global producer of nitrogen fertilizers, accounting for about 15% of the world's total ammonia production. CF Industries is a leading North American producer and distributor of nitrogen fertilizers. The company has several manufacturing complexes in the United States and Canada, allowing it to serve the agricultural needs of the region effectively.\n\nThe Canadian company also ranks as the third-largest manufacturer of nitrogen fertilizer after companies CF Industries and Yara. The Canadian company also ranks as the third-largest manufacturer of nitrogen fertilizer after companies CF Industries and Yara.\n\n**North American Market:**\nCF Industries Holdings, Inc. holds a prominent share through its vertically integrated ammonia assets and dedicated pipeline links, which provide it with a freight advantage in the Gulf and Midwest.\n\nThe United States fertilizers market remains moderately concentrated. Nutrien leads through an integrated model that spans production, distribution, and a 1,700-store retail network. CF Industries follows with low-cost nitrogen production anchored by Gulf Coast gas access. Mosaic controls the market through phosphate mining in Florida and Louisiana.\n\n## 10. Comparison to Competitors\n\n**Key Competitors:**\nNutrien, CF Industries, Mosaic, The Andersons Inc., and Yara are the major players, underscoring moderate concentration in the United States fertilizer market.\n\nNutrien Ltd., formed by the merger of PotashCorp and Agrium, is a leading producer of nitrogen fertilizers, potash, and phosphate products. The company has a strong presence in North and South America and serves customers worldwide. Nutrien operates several nitrogen production facilities, including ammonia and urea plants.\n\nKoch Fertilizer, a subsidiary of Koch Industries, is one of the largest nitrogen fertilizer producers in the United States. The company has production facilities in several states, offering a diverse range of nitrogen-based products to farmers and agricultural businesses.\n\n**Competitive Advantages:**\nCF's plants, which benefit from low-cost North American natural gas, are connected to its main customers in the US Corn Belt by an extensive distribution network of pipelines, rail, and barge, giving the company a transportation cost advantage over foreign competition. High shipping and storage costs for importers of nitrogen fertilizer limit the competition CF faces in North American markets from outside regions with low natural gas costs.\n\n## 11. Partnerships, Mergers and Acquisitions\n\n**Major Joint Venture - Blue Point:**\nUpon formation, CF Industries will hold 40% ownership, JERA 35% ownership, and Mitsui 25% ownership in the joint venture.\n\nCF Industries Holdings, Inc. (NYSE: CF), the world's largest producer of ammonia, announced today that it has formed a joint venture with JERA Co., Inc. (JERA), Japan's largest energy company, and Mitsui & Co., Inc. (Mitsui), a leading global investment and trading company, for the construction, production and offtake of low-carbon ammonia.\n\nThe joint venture will construct at CF Industries' Blue Point Complex in Louisiana the world's largest low-carbon ammonia plant, with an estimated cost of approximately $4 billion. CF Industries will also build and operate scalable infrastructure at the Blue Point site to supply the ammonia production facility with services, including product storage and loading. CF Industries will invest approximately $550 million for these facilities and receive ongoing services revenue from the joint venture ammonia production facility.\n\n**Strategic Partnerships:**\n- The CO2 will be handled by ExxonMobil, CF Industries' strategic partner for this carbon capture and sequestration (CCS) initiative. The two companies are also working together on capturing and storing up to 500,000 metric tons of carbon dioxide from CF's facilities in Yazoo City, Mississipi.\n- In April the company also signed a 25-year agreement to store about 2.3 million metric tons of CO2 each year with direct air capture developer 1PointFive. The CO2 will come from CF Industries' $4 billion Bluepoint ammonia plant in Ascension Parish, Louisiana, which is being developed in partnership with JERA Co. and Mitsui & Co.\n\n## 12. Recent Developments\n\n**Leadership Transition (January 2026):**\nCF Industries Holdings, Inc. (NYSE: CF), a leading manufacturer of hydrogen and nitrogen products, today announced that W. Anthony Will has informed the Company's Board of Directors of his intention to retire as president and chief executive officer, effective January 4, 2026. Christopher D. Bohn, currently executive vice president and chief operating officer of CF Industries, has been elected to succeed Mr. Will as president and chief executive officer.\n\nMr. Will joined CF Industries in 2007 and has served as president and chief executive officer as well as a member of the Board of Directors since 2014. During his 12-year tenure as president and chief executive officer, the Company has delivered industry-leading total shareholder return underpinned by world-class safety and operational excellence, disciplined growth, and a commitment to reward long-term shareholders.\n\n**Donaldsonville CCS Startup (July 2025):**\nCF Industries Holdings, Inc. (NYSE: CF) today announced the start-up of the carbon dioxide (CO2) dehydration and compression facility at its Donaldsonville Complex in Louisiana. The facility will enable the transportation and permanent geological sequestration of up to 2 million metric tons of CO2 annually that would otherwise have been emitted into the atmosphere.\n\n**Low-Carbon Ammonia Shipments:**\n23,500 tons of ammonia certified under the Fertilizer Institute's Verified Ammonia Carbon Intensity (VACI) Program were loaded onto the Trafigura-operated Oceanic Star in Louisiana last month. The cargo is en route to Antwerp, where chemicals and materials manufacturer Envalior will use the low-carbon ammonia as a feedstock to produce the monomer caprolactam and downstream resins.\n\n## 13. AI Investment Rating & Fair Value Assessment\n\n**Investment Strengths:**\n- Market leadership position as the world's largest producer of ammonia\n- Strong free cash flow generation of $1.7 billion in the last twelve months with 65% conversion rate\n- Strategic positioning in decarbonization with multiple CCS projects operational or under development\n- Expected production of approximately 1.9 million tons of low-carbon ammonia annually from Donaldsonville CCS project\n- Major partnerships with Japanese energy giants for $4 billion Blue Point project\n- Transportation cost advantage through extensive distribution network of pipelines, rail, and barge\n\n**Investment Risks:**\n- High sensitivity to natural gas price volatility, with every $1.00 swing moving annual margins by $55 million\n- Headwinds from increasing soybean acres which don't require nitrogen fertilizer\n- Recent revenue decline of -10.48% in 2024 compared to previous year\n- Leadership transition risks during CEO change\n\n**Growth Catalysts:**\n- Blue Point project expected to be operational by 2029, adding significant low-carbon ammonia capacity\n- Qualification for tax credits under Section 45Q of the Internal Revenue Code\n- Growing global demand for low-carbon ammonia for energy transition\n- Expected increase in corn plantings to approximately 93 million acres supporting nitrogen demand\n\n**Valuation Analysis:**\n- Current P/E ratio of 11.07 appears reasonable for the sector\n- Analyst target price of $91.86 represents 13.70% upside from recent price\n- Strong cash generation and shareholder returns support valuation\n- $1.3 billion returned to shareholders in first nine months of 2025\n\n**Buy Rating: 7.2/10**\n\n**Estimated Fair Value: $95-105**\n\n**Rationale:** CF Industries represents a compelling investment opportunity for growth-oriented investors with moderate risk appetite. The company's leadership position in ammonia production, combined with strategic investments in low-carbon technology and strong partnerships, positions it well for the energy transition. The Blue Point project and existing CCS initiatives provide significant growth catalysts, while the company's strong cash generation and shareholder returns demonstrate financial discipline. However, natural gas price volatility and agricultural market dynamics present ongoing risks. The recent leadership transition adds some uncertainty, though the new CEO has extensive company experience. At current valuations, the stock offers attractive upside potential to a fair value range of $95-105, supported by the company's strategic positioning in decarbonization and strong operational performance.",
  "generated_date": "2026-01-23T07:34:16.027877",
  "next_refresh_date": "2026-04-24T07:34:16.027877",
  "model": "claude-sonnet-4-20250514",
  "cost": 0.41925989999999996,
  "tokens": {
    "input": 194,
    "output": 6399,
    "cache_creation": 67406,
    "cache_read": 233068
  },
  "tldr_summary": "CF Industries Holdings is a leading North American manufacturer of hydrogen and nitrogen products for energy, fertilizer, and industrial applications, with a strategic focus on decarbonizing ammonia production.\n\nThe company is positioning itself as a key player in the energy transition through significant low-carbon ammonia projects, including the $4 billion Blue Point facility in Louisiana, which will be the world's largest low-carbon ammonia plant when operational in 2029. CF Industries holds a dominant market position in North America, leveraging low-cost natural gas and an extensive distribution network. Critical strategic moves include multiple carbon capture and sequestration (CCS) projects, partnerships with Japanese energy companies like JERA, and a commitment to producing approximately 1.9 million tons of low-carbon ammonia annually. Recent leadership transition and strong free cash flow generation ($1.7B in the last twelve months) further underscore the company's stability and growth potential.\n\nThe AI analysis provides a buy rating of 7.2/10 with a fair value range of $95-105, reflecting strong growth prospects in the decarbonization and nitrogen production markets."
}