{
  "ticker": "CFFN",
  "content": "**Disclaimer:** This sell-side report was generated using Grok 4.1 Fast Reasoning (grok-4-1-fast-reasoning). Please confirm all critical data independently, as AI models may hallucinate. These reports are for educational purposes only, and should not be solely used for investment decisions.\n\nGrok's API is currently limited to information up to the **end of 2024**. Claude's Sonnet 4.5 has access to up-to-date information, but is considerably more expensive per output (nearly $1 per ticker). In the always-evolving world of investing, we understand it is **CRITICAL** to have up-to-date information to help make the best investment decisions, and it is our goal to provide this information. But considering there are thousands of companies that we would ideally be updating monthly, as well as future goals of also providing quick and digestible summaries and insights for newly released earnings and conference calls, breaking news, FED speeches, etc, this quickly becomes very costly.\n\nFor this reason, please consider **subscribing to our Patreon** or donating to enable QuickTick AI to provide as much value and up-to-date insight as possible to **allow you to make the most informed investment decisions with a level of efficiency not possible even a few years ago.** 100% of the funds will go straight to purchasing more API credits to continue expanding our high quality, up-to-date analysis for more and more companies, and further then into our future value-generating plans. Thanks! - QuickTick AI\n\n---\n\n# CF Finance Acquisition Corp. III (CFFN) Sell-Side Analysis Report\n\n**Current Status (Verified as of October 10, 2024)**:\n- **Stock Price**: Delisted from NASDAQ on October 7, 2022. No active trading on major exchanges or OTC markets. Last traded price prior to delisting: approximately $10.00 per share (redemption value).\n- **Market Capitalization**: N/A (company liquidated; all public shares redeemed at $10.00 per share).\n- **Sources**: NASDAQ, Yahoo Finance, SEC filings (8-K dated September 30, 2022), OTC Markets (no active symbol).\n\n## Company Overview (148 words)\nCF Finance Acquisition Corp. III (CFFN) was a blank check company (SPAC) incorporated in Delaware in October 2020, sponsored by Cantor Fitzgerald affiliates. Its sole purpose was to effect a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or similar business combination with one or more businesses, primarily targeting financial services firms. It raised $230 million in its IPO on February 4, 2021, at $10 per unit (20.3 million units). The SPAC had until February 9, 2022 (extended multiple times), to complete a deal but failed to identify or close a target. On September 30, 2022, CFFN announced it would not pursue any business combination, redeeming all 25.3 million public shares (including over-allotments) at $10.02 per share (pro rata trust value), distributing ~$253.6 million. The company fully liquidated on October 7, 2022, with no ongoing operations, employees, or assets. No products, services, or revenue ever generated.\n\n## Recent Developments\n- **September 30, 2022**: Board unanimously approved liquidation; redemption notice issued (SEC 8-K).\n- **October 7, 2022**: Final redemption and dissolution; ~99.9% redemption rate (25.25 million shares redeemed).\n- **Post-2022**: No activity. No recent articles, discussions, earnings calls, or announcements (searches on Google News, Seeking Alpha, Yahoo Finance, Reddit, Twitter/X yield zero results since 2022).\n- **Online Talking Points (Historical)**: Pre-liquidation discussions focused on SPAC market downturn, high redemption rates in peers (e.g., 90%+), and sponsor frustrations; no current buzz.\n\n## Growth Strategy\n- N/A (defunct). Original strategy: Acquire financial services/tech firms with $1B+ enterprise value, leveraging Cantor Fitzgerald's network. Extensions sought (e.g., February 2022 shareholder approval for 3-month extension), but no targets announced.\n\n## Company and Sector Headwinds/Tailwinds\n| Category | Headwinds | Tailwinds |\n|----------|-----------|-----------|\n| **Company-Specific** | Failed to find target amid 2021-2022 SPAC glut; 99.9% redemptions eroded trust cash; sponsor (Cantor) pursued other SPACs instead. | Initial strong IPO ($230M raised); extensions bought time (up to Aug 2022). |\n| **Sector (SPACs)** | 2022 bear market crushed SPACs (90%+ liquidated/redeemed); regulatory scrutiny (SEC rules on projections, 2024); high interest rates killed PIPE financing. | None recent; 2020-2021 boom irrelevant now. |\n\n## Existing Products/Services\n- None. Pure SPAC shell; no operations, revenue, or assets post-IPO beyond trust account.\n\n## New Products/Services/Projects\n- None planned/developed. Liquidated.\n\n## Market Share Approximations\n- N/A (no products/services). In SPAC sector: One of ~500 SPACs in 2021 wave; <0.1% of total SPAC IPO volume (~$150B in 2021).\n\n## Forecast of Growth/Decline in Market Share\n- N/A (extinct). SPAC market share declined ~95% from 2021 peak (SPAC Insiders data); CFFN fully written off.\n\n## Comparison to Competitors\n| Metric | CFFN | Peers (e.g., CCIV → Churchill Capital IV, liquidated 2022; IPOA → Ipsos merger failed, liquidated 2023) | Notes |\n|--------|------|-------------------------------------------------------------|-------|\n| **Outcome** | Liquidated Oct 2022 (99.9% redemption) | Similar: 85-100% redemptions; most 2021 SPACs dead/diluted post-merger | CFFN average performer in failure cohort. |\n| **Sponsor** | Cantor Fitzgerald (active in other SPACs like CFFI) | Varies (e.g., Bill Ackman for PSH); stronger sponsors survived better | Cantor shifted to private deals. |\n| **IPO Size** | $230M (2021) | $200-500M avg.; survivors like CCX (merged) larger | Smaller SPACs liquidated faster. |\n| **Time to Liquidate** | ~20 months | 18-24 months avg. for failures | Standard. |\n\n## Partnerships, M&A\n- **Partnerships**: None material. Underwriting by Cantor Fitzgerald & Co.\n- **M&A**: No targets pursued publicly. Sponsor explored but abandoned.\n\n## Current and Potential Major Clients\n- N/A (no business model).\n\n## Other Qualitative Measures\n- **Management**: Experienced (CEO Michael Forman, ex-Cantor); no controversies.\n- **ESG**: Neutral (no operations).\n- **Risks**: Total loss for non-redeemers; sponsor promote (~5.7M shares) worthless.\n- **Sentiment**: Negative historical (e.g., Reddit r/SPACs threads called it \"dead money\" pre-liquidation); zero current discussion.\n\n## Investment Recommendation\n- **Buy Rating**: 1/10 (**STRONG SELL**). No stock exists; fully redeemed/liquidated. Non-redeemers lost principal. Avoid any OTC remnants or sponsor vehicles.\n- **Estimated Fair Value**: $0.00 (defunct entity). No growth upside; infinite downside risk if fraudulently traded OTC.\n- **Rationale for Growth/Moderate Risk Portfolio**: SPAC failed spectacularly in bear market. Sector moribund (SPAC IPOs: 13 in 2024 YTD vs. 613 in 2021, per SPAC Research). Fundamentals non-existent; prioritize live growth stocks. Holdings would have returned ~0% (redemption) vs. S&P 500 +30% since 2022.\n\n**Sources**: SEC EDGAR (latest 8-K/LK Sep 30, 2022; 10-Q/Q2 2022 trust-only), Yahoo Finance/Google Finance (delisted confirmation), SPACInsider/SPAC Research (sector stats), no earnings (trust account \"earnings\" ~$1.5M interest Q2 2022, irrelevant). All quantitative data <6mo? None qualify (last report 2022).",
  "generated_date": "2026-01-08T12:09:34.421081",
  "model": "grok-4-1-fast-reasoning"
}