{
  "ticker": "CTBI",
  "content": "**Disclaimer:** This sell-side report was generated using Grok 4.1 Fast Reasoning (grok-4-1-fast-reasoning). Please confirm all critical data independently, as AI models may hallucinate. These reports are for educational purposes only, and should not be solely used for investment decisions.\n\nGrok's API is currently limited to information up to the **end of 2024**. Claude's Sonnet 4.5 has access to up-to-date information, but is considerably more expensive per output (nearly $1 per ticker). In the always-evolving world of investing, we understand it is **CRITICAL** to have up-to-date information to help make the best investment decisions, and it is our goal to provide this information. But considering there are thousands of companies that we would ideally be updating monthly, as well as future goals of also providing quick and digestible summaries and insights for newly released earnings and conference calls, breaking news, FED speeches, etc, this quickly becomes very costly.\n\nFor this reason, please consider **subscribing to our Patreon** or donating to enable QuickTick AI to provide as much value and up-to-date insight as possible to **allow you to make the most informed investment decisions with a level of efficiency not possible even a few years ago.** 100% of the funds will go straight to purchasing more API credits to continue expanding our high quality, up-to-date analysis for more and more companies, and further then into our future value-generating plans. Thanks! - QuickTick AI\n\n---\n\n# CTBI (Community Trust Bancorp, Inc.) Sell-Side Analysis Report\n\n## Company Overview\nCommunity Trust Bancorp, Inc. (NASDAQ: CTBI) is a regional bank holding company headquartered in Lexington, Kentucky, founded in 1980. It operates primarily through its flagship subsidiary, Community Trust Bank, Inc. (CTB), which provides a full range of commercial and retail banking products and services across Kentucky, West Virginia, Virginia, and Ohio. As of September 30, 2024, CTB managed $5.8 billion in assets, $4.7 billion in deposits, and $4.2 billion in loans through 68 full-service banking branches and additional facilities. The company emphasizes community-focused banking, offering deposit products (checking, savings, CDs, IRAs), loan portfolios (commercial real estate 52%, commercial 20%, residential real estate 18%, consumer 10%), and fee-based services including wealth management, brokerage, trust, and insurance via subsidiaries like Community Trust Bank of Logan, Inc., and Tri-State Financial Services, Inc. CTBI generates revenue primarily from net interest income (78% of Q3 2024 total revenue) and non-interest income (22%), with a conservative balance sheet featuring a CET1 capital ratio of 12.5% and Texas Ratio of 3.2% as of Q3 2024. Known for its consistent dividend growth (52-year streak, current yield ~3.8%), CTBI targets stable, relationship-driven growth in underserved rural and small-town markets, differentiating from larger nationals via personalized service and low-cost funding. (198 words)\n\n**Current Stock Metrics (as of October 25, 2024, close via Yahoo Finance/Nasdaq):**\n| Metric          | Value          |\n|-----------------|----------------|\n| Stock Price     | $57.42        |\n| Market Cap      | $859.3M       |\n| 52-Week Range   | $41.26 - $63.92 |\n| P/E Ratio (TTM) | 11.2          |\n| Dividend Yield  | 3.8%          |\n\n## Recent Developments\n- **Q3 2024 Earnings (Reported Oct 22, 2024)**: Net income $20.1M (EPS $1.38, up 4% YoY); net interest income $58.2M (up 2% YoY); provision for credit losses $2.5M; efficiency ratio 49.2%. Loans grew 1.5% QoQ to $4.21B; deposits stable at $4.7B. Non-performing assets ratio improved to 0.35%.\n- **Dividend Increase (Oct 22, 2024)**: Quarterly dividend raised to $0.47/share (annualized $1.88, +2.2% hike), payable Jan 2025.\n- **Q2 2024 Earnings (Jul 23, 2024)**: Net income $19.8M (EPS $1.36); NII $57.1M.\n- **Branch Expansion**: Opened new branch in Morehead, KY (Aug 2024).\n- **Online Buzz (Seeking Alpha, StockTwits, Oct 2024)**: Positive sentiment on dividend aristocrat status and deposit stability amid banking stress; concerns over net interest margin compression (3.62% in Q3).\n\n## Growth Strategy\n- Organic expansion via de novo branches and deepening cross-sell (e.g., trust assets under management up 5% YoY to ~$2.5B).\n- Loan pipeline focus on C&I and CRE in core markets; NIM stabilization targeted via deposit repricing.\n- Fee income growth through wealth/trust services (non-interest income +6% YoY Q3).\n- Selective M&A for footprint adjacency (e.g., past deals like Peoples Community Bank acquisition in 2021).\n\n## Headwinds and Tailwinds\n| Category     | Tailwinds (Company/Sector)                          | Headwinds (Company/Sector)                          |\n|--------------|-----------------------------------------------------|-----------------------------------------------------|\n| **Company** | Strong deposit beta lag (cost of deposits 2.1%); low NPA (0.35%); 12.5% CET1 buffer. | Loan growth slowdown (1.5% QoQ); CRE exposure (52% loans). |\n| **Sector**  | Rate cuts (Fed Sep 18, 2024: 50bps) aiding NIM recovery; regional bank M&A wave. | Deposit competition; regulatory scrutiny (e.g., Basel III); recession fears. |\n\n## Existing Products/Services\n- **Core Banking**: Demand deposits, time deposits, HELOCs.\n- **Lending**: Commercial real estate ($2.18B), C&I ($0.84B), residential mortgages ($0.76B), consumer ($0.43B).\n- **Fee-Based**: Trust/estate (AUM $2.5B), brokerage, investment advisory, insurance agency.\n\n## New Products/Services/Projects\n- Digital banking enhancements: Mobile app upgrades (rolled out Q3 2024) for Zelle, remote deposit.\n- No major announced projects; focus on cybersecurity investments post-2024 sector incidents.\n\n## Market Share Approximations\n- **Regional Footprint**: ~1-2% deposit market share in KY (top 10 player); <1% in WV/VA/OH per FDIC data (Q2 2024).\n- National: Negligible (<0.01% U.S. bank assets).\n\n## Market Share Forecast\n- Modest growth: +1-2% annually in core states through 2025 via organic branching/loans; stable nationally. Risks: Competition from fintechs/nationals eroding 0.5-1%.\n\n## Competitor Comparison\n| Metric (Q3 2024 or Latest) | CTBI       | FBMS (Home BancShares) | UMBF (UMB Financial) | WSFS (WSFS Financial) |\n|----------------------------|------------|------------------------|----------------------|-----------------------|\n| Assets ($B)               | 5.8       | 9.0 (Q2)              | 44.6 (Q3)           | 24.5 (Q3)            |\n| ROE (%)                   | 16.2      | 13.5                  | 11.8                | 10.2                 |\n| NIM (%)                   | 3.62      | 3.45                  | 2.98                | 3.41                 |\n| Dividend Yield            | 3.8%      | 2.4%                  | 1.6%                | 2.1%                 |\n| P/TB Ratio                | 1.35      | 1.45                  | 1.62                | 1.28                 |\n\n*CTBI outperforms on ROE/dividends, trades at discount to peers on P/TB.*\n\n## Partnerships, M&A\n- **Partnerships**: Fiserv for core processing; no major new (2024).\n- **M&A**: Acquired Appalachian Bankshares (Dec 2023, $28M); no 2024 deals announced. CEO Jean Holley noted M&A interest in Oct 22 earnings call for \"tuck-in\" opportunities.\n\n## Current and Potential Major Clients\n- **Current**: Local governments, healthcare (e.g., Appalachian Regional Healthcare), manufacturing/ag in KY/WV; top 10 loans <5% concentration.\n- **Potential**: Adjacent MSAs (e.g., Huntington, WV) via expansion; energy transition clients in OH coal regions.\n\n## Other Qualitative Measures\n- **ESG**: Strong community reinvestment (CRA rating \"Outstanding\"); low carbon footprint via rural ops.\n- **Management**: CEO Jean Holley (since 2015) praised for capital discipline (Seeking Alpha Oct 2024).\n- **Risk Profile**: Conservative (loan-to-deposit 89%); Moody's Baa2 rating stable.\n- **Analyst Views**: 2 Buy ratings (Zacks #2, Oct 2024); avg PT $58 (Raymond James Oct 23, 2024).\n\n## Investment Recommendation\n- **Buy Rating**: 7/10 (**Hold with Upside Bias**). Solid fundamentals, dividend safety, and NIM tailwinds from Fed cuts support stability; limited growth catalysts cap aggressive buy. Moderate risk via CRE/regional exposure.\n- **Fair Value Estimate**: $65 (13% upside from $57.42). Based on 12x 2025E EPS $5.20 (consensus), 1.5x TBV $42.80; implies strong growth for dividend-focused portfolios amid sector recovery.",
  "generated_date": "2026-01-08T11:18:05.814570",
  "model": "grok-4-1-fast-reasoning"
}