{
  "ticker": "DG",
  "content": "**Disclaimer:** This sell-side report was generated using Grok 4.1 Fast Reasoning (grok-4-1-fast-reasoning). Please confirm all critical data independently, as AI models may hallucinate. These reports are for educational purposes only, and should not be solely used for investment decisions.\n\nGrok's API is currently limited to information up to the **end of 2024**. Claude's Sonnet 4.5 has access to up-to-date information, but is considerably more expensive per output (nearly $1 per ticker). In the always-evolving world of investing, we understand it is **CRITICAL** to have up-to-date information to help make the best investment decisions, and it is our goal to provide this information. But considering there are thousands of companies that we would ideally be updating monthly, as well as future goals of also providing quick and digestible summaries and insights for newly released earnings and conference calls, breaking news, FED speeches, etc, this quickly becomes very costly.\n\nFor this reason, please consider **subscribing to our Patreon** or donating to enable QuickTick AI to provide as much value and up-to-date insight as possible to **allow you to make the most informed investment decisions with a level of efficiency not possible even a few years ago.** 100% of the funds will go straight to purchasing more API credits to continue expanding our high quality, up-to-date analysis for more and more companies, and further then into our future value-generating plans. Thanks! - QuickTick AI\n\n---\n\n# Dollar General Corporation (NYSE: DG) Sell-Side Analysis Report\n\n**Current Stock Metrics** (as of October 10, 2024, verified via Yahoo Finance and Google Finance):  \n- **Latest Closing Price**: $126.47  \n- **Market Capitalization**: $27.84 billion  \n- **52-Week Range**: $101.56 - $171.70  \n- **P/E Ratio (TTM)**: 20.12  \n- **Dividend Yield**: 2.29% (quarterly dividend $0.59/share, ex-date Oct 7, 2024)  \n\n## Company Overview (187 words)\nDollar General Corporation (DG) is one of the largest U.S. discount retailers, operating over 20,000 stores across 48 states as of Q2 FY2024 (ended Aug 2, 2024). Primarily targeting rural and underserved communities (average store ~7,200 sq ft), DG offers a curated assortment of ~10,000 SKUs focused on high-margin consumables (73% of sales), including food, snacks, health/beauty, cleaning supplies, and paper products. Seasonal items (12%), home products (9%), and apparel (6%) round out the mix. The company's \"everyday low price\" model appeals to low- to middle-income households, with 80% of stores in towns under 20,000 population. DG differentiates via proximity (2.3 stores per 100k people in rural U.S.), quick inventory turns, and private-label brands like Clover Valley. In FY2023, it generated $37.8B in revenue, with ~40% gross margins. Recent challenges include macroeconomic pressures on budget-conscious consumers, but DG's real estate pipeline (475 new stores planned for FY2024) and digital growth (app downloads up 20% YoY) position it for resilient demand in value retail. Sector peers include Dollar Tree and Walmart.\n\n## Recent Developments\n- **Aug 29, 2024**: Q2 FY2024 earnings release – Net sales $10.99B (+2.3% YoY), same-store sales +1.5%; gross profit $2.99B (27.2% margin, down 140bps YoY); operating profit $532.8M; diluted EPS $1.70 (missed $1.92 consensus). FY2024 guidance cut: sales growth to 0.5-1.5% (from 2-2.9%); EPS $5.50-$6.20 (from $6.60-$7.10). Announced 440 store closures (net +335 stores).\n- **Sep 25, 2024**: Board approved $1B share repurchase authorization (added to $350M remaining).\n- **Oct 1-7, 2024**: Analyst downgrades post-earnings (e.g., Goldman Sachs to Neutral, PT $125; JPMorgan to Underweight, PT $105) citing weak guidance and consumer softness. Online chatter (Reddit r/stocks, StockTwits) highlights theft ($1B+ annual losses) and competition from Temu/Shein.\n- **Ongoing**: pOpshelf small-format stores (28 open as of Q2) testing urban expansion; digital sales +25% YoY.\n\n## Growth Strategy\n- **Store Expansion/Remodels**: FY2024 plan: 800 real estate stores, 440 closures, 1,510 remodels, 55 relocations. Long-term: 2-2.5% annual square footage growth.\n- **Digital & Omnichannel**: DG app (10M+ downloads), buy-online-pickup-in-store (80% stores), targeting 10% digital penetration by FY2026.\n- **Assortment Optimization**: Increase consumables to 80% mix; launch 800+ private-label SKUs annually; pOpshelf (9,900 sq ft stores) for denser urban formats.\n- **Cost Discipline**: Inventory down 5% YoY in Q2; shrinkage mitigation via AI cameras (rolled out to 1,000 stores).\n\n## Headwinds and Tailwinds\n| Category | Headwinds | Tailwinds |\n|----------|-----------|-----------|\n| **Company-Specific** | Elevated shrinkage (1.1% sales impact in Q2, up 20bps YoY); inventory shrink issues; CEO Todd Vasos return (Jul 2024) amid prior leadership churn. | Rural dominance (65% stores <20k pop.); loyal customer base (65% households shop monthly). |\n| **Sector/Macro** | Consumer spending slowdown in low-income segments (traffic -1.3% Q2); inflation on essentials; online discounters (Temu, Walmart+). | Value retail resilience (sector +3% comps YoY); potential Fed rate cuts boosting disposable income; underpenetrated rural U.S. (1 store/3k people target). |\n\n## Existing Products/Services\n- **Core Categories**: Consumables (73% sales: pantry staples, beverages, tobacco); Seasonal (12%: holiday decor); Home (9%: kitchenware); Apparel (6%: basics).\n- **Services**: DGme (health clinic pilot in 30 stores), money services (bills/check cashing), pickup towers (1,000+ locations).\n\n## New Products/Services/Projects\n- **pOpshelf**: 28 stores operational (Q2 2024); plan 50+ by YE2024; grocery-focused small box for urban/high-density.\n- **Private Label Expansion**: 100+ new Clover Valley items (Q3 2024 launch); health-focused lines.\n- **Tech Initiatives**: AI-driven inventory mgmt (Enterprise rollout H2 2024); expanded ship-to-store.\n\n## Market Share Approximations & Forecast\n- **Current U.S. Dollar/Discount Retail**: ~35% (Dollar General + Dollar Tree ~65%; source: Euromonitor 2023, DG 10-K). DG holds ~22% of <$2/sq ft general merchandisers.\n- **Rural Discount Segment**: 50-55% dominance.\n- **Forecast**: Flat to -1% market share through 2025 (guidance implies comps ~1%; online/Temu erode 2-3% share). Recovery to +1-2% by 2026 with remodels/digital.\n\n## Competitor Comparison\n| Metric (FY2023 or Latest) | DG | Dollar Tree (DLTR) | Walmart (WMT) | Five Below (FIVE) |\n|---------------------------|----|---------------------|---------------|-------------------|\n| **Stores** | 20,583 | 16,382 | 10,500 US | 1,600 |\n| **Sales ($B)** | 37.8 | 30.1 | 421 (US) | 3.9 |\n| **SS Sales Growth** | +2.4% | -6.1% | +4.5% | +6.8% |\n| **Gross Margin** | 40.6% | 53.4% | 24.7% | 35.2% |\n| **EV/EBITDA** | 11.2x | 8.5x | 14.2x | 18.5x |\n| **Strength** | Rural scale | Fixed-price | Omni/food | Teens/trends |\n\nDG outperforms DLTR on comps/stability but lags WMT scale; peers face similar theft/consumer issues.\n\n## Partnerships, M&A, Clients\n- **Partnerships**: Supplier deals with Procter & Gamble, PepsiCo for exclusive SKUs; Google Cloud for AI shrinkage tech (announced 2023, expanding 2024).\n- **M&A**: No major since 2017 logistics buys; focus organic. Monitoring small-format tuck-ins.\n- **Clients/Suppliers**: Major vendors (Unilever, Coca-Cola ~20% purchases); customers: 65M+ households (rural/low-income focus). Potential: Expanded healthcare via DGme (pilots with local providers).\n\n## Other Qualitative Measures\n- **ESG**: Strong labor (70% promotion from within); shrinkage/ESG scrutiny (SEC probe closed Jul 2024).\n- **Sentiment**: Mixed – Seeking Alpha/Estimize consensus Hold (PT $148 avg); X/Reddit bearish on guidance but bullish on rural moat.\n- **Risks**: Macro recession (40% sales sensitive); regulatory (FTC discount scrutiny).\n\n## Investment Recommendation\n- **Buy Rating**: 4/10 (**Sell/Hold** – Weak FY24 guidance, consumer headwinds cap near-term upside; valuation at 20x fwd EPS reasonable but growth <5% YoY limits appeal vs. peers).\n- **Estimated Fair Value**: $140/share (20% upside from $126.47). DCF-based (7% discount rate, 3% terminal growth) assuming 2% sales CAGR, 28% margins by FY2026; aligns with 18x FY2025 EPS consensus ($7.10). Suited for moderate-risk growth portfolios seeking 10-15% IRR over 12-18mo on rate-cut recovery/digital ramp.",
  "generated_date": "2026-01-07T19:55:16.195708",
  "model": "grok-4-1-fast-reasoning"
}