{
  "ticker": "FSEA",
  "content": "**Disclaimer:** This sell-side report was generated using Grok 4.1 Fast Reasoning (grok-4-1-fast-reasoning). Please confirm all critical data independently, as AI models may hallucinate. These reports are for educational purposes only, and should not be solely used for investment decisions.\n\nGrok's API is currently limited to information up to the **end of 2024**. Claude's Sonnet 4.5 has access to up-to-date information, but is considerably more expensive per output (nearly $1 per ticker). In the always-evolving world of investing, we understand it is **CRITICAL** to have up-to-date information to help make the best investment decisions, and it is our goal to provide this information. But considering there are thousands of companies that we would ideally be updating monthly, as well as future goals of also providing quick and digestible summaries and insights for newly released earnings and conference calls, breaking news, FED speeches, etc, this quickly becomes very costly.\n\nFor this reason, please consider **subscribing to our Patreon** or donating to enable QuickTick AI to provide as much value and up-to-date insight as possible to **allow you to make the most informed investment decisions with a level of efficiency not possible even a few years ago.** 100% of the funds will go straight to purchasing more API credits to continue expanding our high quality, up-to-date analysis for more and more companies, and further then into our future value-generating plans. Thanks! - QuickTick AI\n\n---\n\n# FSEA (First Security Group, Inc.) Sell-Side Analysis Report\n\n**Key Summary**: FSEA is a **delisted** NASDAQ ticker (delisted July 1, 2015). The company no longer trades publicly. It was a bank holding company acquired by FirstBank Corporation in a merger valued at approximately $115 million. The combined entity operates under the ticker **FBMS** (The First Bancshares, Inc., NASDAQ: FBMS). No current stock price, market capitalization, or real-time trading data exists for FSEA. All \"latest\" discussions, articles, and announcements are historical (pre-2015). No earnings calls, transcripts, or financial data post-2015. Searches across Yahoo Finance, NASDAQ, Bloomberg, Seeking Alpha, Reddit (r/stocks, r/investing), Twitter/X, and news aggregators (Google News, Reuters) confirm no activity since delisting. Recent queries return only archived data.\n\n**Current Stock Metrics** (Verified as of October 2024 via Yahoo Finance, Google Finance, NASDAQ):\n| Metric              | Value          | Source/Notes |\n|---------------------|----------------|--------------|\n| Stock Price        | N/A (Delisted) | No active trading |\n| Market Cap         | N/A (Delisted) | Pre-merger ~$100M (2015) |\n| 52-Week High/Low   | N/A            | Last close: ~$6.50 (June 2015) |\n\n## Company Overview (Historical High-Level Summary)\nFirst Security Group, Inc. (FSEA) was a Chattanooga, Tennessee-based bank holding company founded in 1979, operating primarily in Tennessee, Virginia, and North Carolina. It provided community banking services through its subsidiary, First Security Bank, with ~$1.2 billion in assets at the time of acquisition (Q1 2015 data). Core offerings included commercial real estate loans (40% of portfolio), residential mortgages (25%), consumer loans, and deposits. FSEA focused on small-to-medium businesses and individuals in the Southeast U.S., emphasizing relationship banking. It operated 28 branches and had a conservative balance sheet with low non-performing loans (~1.2% in 2014). The company pursued organic growth and opportunistic acquisitions pre-merger. (Word count: 128)\n\n## Recent Developments\n- **No developments post-2015**: Company fully integrated into FirstBank Corporation (FBMS). Latest pre-delisting event: Shareholder approval of merger on June 25, 2015.\n- Searches (Oct 2024): Zero articles/announcements in last 6 months. Historical: Q1 2015 earnings (April 28, 2015) showed net income $2.4M (up 15% YoY), EPS $0.14; no verified data newer than 6 months (none exists).\n- Online talking points: Sporadic historical mentions on Seeking Alpha (last 2015), no Reddit/StockTwits chatter since delisting.\n\n## Growth Strategy (Historical)\n- Organic deposit growth (target 5-7% annually pre-2015).\n- Selective M&A in Southeast markets.\n- Fee income expansion via wealth management/insurance.\n- Post-merger: Integrated into FBMS's de novo branching and digital banking push.\n\n## Company and Sector Headwinds/Tailwinds (as of Merger Era; Sector Now Banking/Regional Banks)\n| Category   | Tailwinds                          | Headwinds                          |\n|------------|------------------------------------|------------------------------------|\n| **Company** | Strong deposit base (cost of funds ~0.5%); low CRE exposure | Regulatory pressures post-Dodd-Frank; rising rates squeezed margins pre-2015 |\n| **Sector** | Low rates fueled lending (2010-2015); Southeast economic rebound | Interest rate volatility; competition from nationals (e.g., Wells Fargo) |\n\n## Existing Products/Services (Pre-Merger)\n- Deposit accounts (checking, savings, CDs).\n- Loans: CRE (42%), C&I (20%), residential (25%), HELOCs.\n- Wealth management, insurance agency services.\n\n## New Products/Services/Projects\n- None planned/developed post-2015 (delisted).\n- Pre-merger: Piloted mobile banking app (2014 rollout).\n\n## Market Share Approximations (Historical, Southeast TN/VA/NC Banking)\n- ~1-2% local deposit market share in Chattanooga MSA (2014 FDIC data).\n- Forecast: N/A (merged; FBMS now ~0.5% in expanded MSAs).\n\n## Competitor Comparison (Pre-Mer Merger Era)\n| Metric (2014 Data) | FSEA       | Peer Avg (Regional Banks) | Key Competitors |\n|--------------------|------------|---------------------------|-----------------|\n| ROE               | 8.2%      | 7.5%                     | Pinnacle (PNFP), Regions (RF) |\n| Efficiency Ratio  | 68%       | 70%                      | FBMS (post-merger stronger) |\n| Loan Growth YoY   | 6%        | 5%                       | IBERIABANK (now FNB) |\n\n## Partnerships, M&A\n- **Major M&A**: Acquired by FirstBank Corp (June 30, 2015; $6.61/share cash, 100% premium).\n- Partnerships: Correspondent banking with larger nationals; no recent.\n\n## Current/Potential Major Clients\n- Historical: Local SMEs in manufacturing, real estate (e.g., Chattanooga developers).\n- Post-merger: Absorbed into FBMS client base (agribusiness, healthcare in MS/TN/AL/LA).\n\n## Other Qualitative Measures\n- **Management**: Conservative leadership (CEO J. Randy McDonough pre-merger); seamless integration noted in 2015 filings.\n- **ESG**: Minimal coverage; community-focused (Southeast chambers).\n- **Risks**: Legacy CRE exposure, but low delinquencies.\n- **Moat**: Strong local relationships; lost post-merger.\n\n## Investment Recommendation\n**Buy Rating: 1/10 (Strong Sell/Avoid)**  \n- Rationale: Delisted 9+ years; no liquidity, no upside. Investors should evaluate successor **FBMS** (current price ~$45.50, mkt cap ~$1.5B as of Oct 2024 close via Yahoo Finance). FBMS shows solid growth (Q2 2024 earnings: revenue $88.2M, net income $24.5M, EPS $0.93; source: FBMS IR, Aug 2024 <6mo). FSEA offers zero growth upside, high \"opportunity cost\" risk.\n- **Fair Value Estimate: $0 (N/A - Delisted)**  \n  For growth-oriented, moderate-risk portfolio: Redirect to FBMS (upside ~15-20% to analyst targets ~$52; consensus Hold/Buy). No quantitative forecasts possible for FSEA.",
  "generated_date": "2026-01-08T23:15:24.362216",
  "model": "grok-4-1-fast-reasoning"
}