{
  "ticker": "HCC",
  "content": "**Disclaimer:** This sell-side report was generated using Grok 4.1 Fast Reasoning (grok-4-1-fast-reasoning). Please confirm all critical data independently, as AI models may hallucinate. These reports are for educational purposes only, and should not be solely used for investment decisions.\n\nGrok's API is currently limited to information up to the **end of 2024**. Claude's Sonnet 4.5 has access to up-to-date information, but is considerably more expensive per output (nearly $1 per ticker). In the always-evolving world of investing, we understand it is **CRITICAL** to have up-to-date information to help make the best investment decisions, and it is our goal to provide this information. But considering there are thousands of companies that we would ideally be updating monthly, as well as future goals of also providing quick and digestible summaries and insights for newly released earnings and conference calls, breaking news, FED speeches, etc, this quickly becomes very costly.\n\nFor this reason, please consider **subscribing to our Patreon** or donating to enable QuickTick AI to provide as much value and up-to-date insight as possible to **allow you to make the most informed investment decisions with a level of efficiency not possible even a few years ago.** 100% of the funds will go straight to purchasing more API credits to continue expanding our high quality, up-to-date analysis for more and more companies, and further then into our future value-generating plans. Thanks! - QuickTick AI\n\n---\n\n# Warrior Met Coal, Inc. (HCC) Sell-Side Analysis Report\n\n## Company Overview\nWarrior Met Coal, Inc. (NYSE: HCC) is a U.S.-based producer and exporter of high-quality metallurgical (met) coal, primarily hard coking coal (HCC) essential for steelmaking. Headquartered in Brookwood, Alabama, the company operates underground longwall mining operations in the southern Appalachian coalfields, with two active mines: Mine No. 4 and Mine No. 7. These mines produce low-vol, low-ash HCC suitable for premium steel production, with the majority of output exported to key global markets including Europe, South America (notably Brazil), and Asia. Warrior Met focuses exclusively on met coal, avoiding thermal coal to capitalize on higher margins in the steel supply chain.\n\nFounded in 2015 following the spin-off from Walter Energy's Chapter 11 restructuring, the company has grown into one of the largest U.S. met coal producers, emphasizing operational efficiency, safety, and capital discipline. In 2023, it produced 7.8 million short tons of coal, selling 7.6 million tons at an average realized price of $163.49 per ton. The company benefits from low-cost production (cash cost of sales ~$100-110/ton in recent quarters) due to its high-yield longwall technology and strategic location near the Port of Mobile for efficient exports. Warrior Met's strategy hinges on expanding via the transformative $1.2B+ Blue Creek Project, targeting 4.8 million tons annual production by 2026, positioning it for mid-teens production growth amid global steel demand. However, it faces cyclical met coal price volatility tied to steel cycles and geopolitical factors. (Word count: 248)\n\n**Current Stock Metrics** (as of October 11, 2024, per Yahoo Finance and NYSE data):  \n- Stock Price: $63.74  \n- Market Capitalization: $3.36 billion  \n- 52-Week Range: $49.05 - $74.34  \n- Shares Outstanding: 52.7 million  \n\n## Recent Developments\n- **July 31, 2024**: Q2 2024 earnings released. Revenue: $171.0 million (down 54% YoY due to lower met coal prices). Net income: $17.0 million ($0.34 diluted EPS). Sold 1.7 million tons at $135.52/ton realized price. Cash cost of sales: $105.81/ton (ex-royalties). Declared $0.32/quarter dividend (yield ~2.0%). Reaffirmed FY2024 sales guidance of 6.6-7.4 million tons.\n- **September 4, 2024**: Announced Q3 2024 sales of 1.9 million tons at ~$140/ton average realized price (preliminary).\n- **August 2024**: Progress on Blue Creek Project; Phase 1 development mining advanced, with longwall installation targeted for H2 2025. Capital spend YTD: ~$200M.\n- **June 2024**: Completed Mine No. 7 longwall move ahead of schedule, minimizing downtime.\n- **April 29, 2024**: Q1 2024 earnings: Revenue $514.6M, net income $176.1M ($3.54 EPS), driven by 2.0M tons sold at $223.86/ton.\n\n## Growth Strategy\n- Core focus: Organic expansion via Blue Creek Project (total capex ~$1.2B through 2026), aiming to add 4.8M tons annual capacity by H2 2026, boosting total output to ~12M+ tons.\n- High dividend policy: Returned $1.0B+ to shareholders since 2021 via dividends/specials (recent $0.75 special in 2023).\n- Export optimization: Leverage Mobile port proximity; targeting Brazil (via Vale partnerships) and Europe amid Russia/Ukraine disruptions.\n- Cost discipline: Maintain AISC <$110/ton; invest in automation/safety for 10-15% annual production growth target post-Blue Creek.\n\n## Existing Products/Services\n- Primary: High-vol and low-vol hard coking coal (HCC) from Mine No. 4 (higher vol) and Mine No. 7 (low-vol premium).\n- Specs: 1% sulfur, low ash (8-9%), CSR >70%; ideal for PCI/injection blends.\n\n## New Products/Services/Projects\n- **Blue Creek Project**: Greenbush longwall development (Phase 1: 4.8M tons/year low-vol HCC). Continuous miner ops started Q4 2023; longwall arrive H2 2025. Phase 2 (pump storage) under evaluation for +2M tons.\n- No major service diversification; focus remains met coal purity enhancements for PCI markets.\n\n## Company and Sector Headwinds/Tailwinds\n\n| Category     | Tailwinds                                                                 | Headwinds                                                                 |\n|--------------|---------------------------------------------------------------------------|---------------------------------------------------------------------------|\n| **Company** | Blue Creek ramp-up for 50%+ production growth; strong balance sheet ($500M+ cash, no debt); low-cost position. | Labor constraints (UMWA union contract expires 2026); Blue Creek delays risk execution. |\n| **Sector**  | Global steel demand (China stimulus, EU green steel needs met coal); Russia sanctions boost seaborne HCC (~$200/ton spot Oct 2024). Australian weather disruptions. | ESG pressures/transition to EAF steel; met coal price volatility (down 50% YTD from $300 peaks); China oversupply. |\n\n## Market Share and Forecast\n- **Current U.S. Seaborne Met Coal Share**: ~12-15% (per company filings/S&P Global; U.S. exports ~30-35M tons/year, Warrior ~7-8M tons).\n- **Global Seaborne HCC**: <2% (global ~250M tons demand).\n- **Forecast**: Market share growth to 20%+ U.S. by 2027 via Blue Creek (production +60%). Stable/decline risk if steel decarbonization accelerates (EAF share >40% by 2030).\n\n## Comparison to Competitors\n\n| Metric (TTM as of Q2 2024) | HCC          | AMR (Alpha) | ARCH        | CRNO (Coronado) |\n|----------------------------|--------------|-------------|-------------|-----------------|\n| Prod. (M tons)            | 7.8         | 15.5       | 9.0 (met)  | 10.5           |\n| Cash Cost ($/ton)         | ~$105       | ~$110      | ~$95       | ~$120          |\n| EV/EBITDA                 | 4.2x        | 5.1x       | 4.8x       | 6.2x           |\n| Dividend Yield            | 2.0%        | 1.2%       | 2.5%       | 0%             |\n| Blue Sky Growth           | High (Blue Creek) | Moderate  | Low        | High (US ops)  |\n\nHCC trades at discount to peers on EV/ton (~$400 vs. $500+); superior low-vol quality.\n\n## Partnerships, M&A, Clients\n- **Partnerships**: Take-or-pay contracts with Thyssenkrupp (Germany), ArcelorMittal Brazil; offtake with Vale (Brazil) for Blue Creek output.\n- **M&A**: No major recent; 2021 acquired Idemitsu Americas' stake in Mine No. 4. Potential tuck-ins in Appalachia.\n- **Clients**: 80% exports – POSCO/Nippon Steel (Asia), Ternium/ArcelorMittal (Brazil/Argentina), European mills (e.g., Salzgitter). U.S. domestic ~20% (Nucor, Steel Dynamics).\n- **Potential**: Expanded Brazil/India deals amid China slowdown; EU steel majors post-Russia ban.\n\n## Other Qualitative Measures\n- **ESG/Safety**: MSHA award winner; low injury rates. Committed to methane capture; rebuts thermal coal stigma.\n- **Management**: CEO Walt Scheller (ex-US Steel) emphasizes returns (ROIC >20%).\n- **Risks**: Geopolitics (Red Sea disruptions +10% freight); union negotiations.\n- **Sentiment**: Positive analyst buzz on Blue Creek (9 Buys/1 Hold, avg PT $78 per Yahoo Oct 2024); online forums (Reddit/StockTwits) bullish on dividends/growth.\n\n## Investment Recommendation\n- **Buy Rating**: 8/10 (Strong Buy) – Hold for conservative; buy on dips for growth. Blue Creek de-risking + met coal rebound (~$200/ton) offers 20-30% upside. Cyclical but moderate risk via low leverage/cash hoard.\n- **Estimated Fair Value**: $85/share (30% upside from $63.74). Based on 2026E 12M tons at $150/ton ($1.8B revenue), 25% margins, 6x EV/EBITDA (peer avg), 10% discount rate DCF. Assumes Blue Creek on-time, steel demand +2-3% CAGR.",
  "generated_date": "2026-01-08T03:21:45.704509",
  "model": "grok-4-1-fast-reasoning"
}