{
  "ticker": "JACK",
  "content": "**Disclaimer:** This sell-side report was generated using Grok 4.1 Fast Reasoning (grok-4-1-fast-reasoning). Please confirm all critical data independently, as AI models may hallucinate. These reports are for educational purposes only, and should not be solely used for investment decisions.\n\nGrok's API is currently limited to information up to the **end of 2024**. Claude's Sonnet 4.5 has access to up-to-date information, but is considerably more expensive per output (nearly $1 per ticker). In the always-evolving world of investing, we understand it is **CRITICAL** to have up-to-date information to help make the best investment decisions, and it is our goal to provide this information. But considering there are thousands of companies that we would ideally be updating monthly, as well as future goals of also providing quick and digestible summaries and insights for newly released earnings and conference calls, breaking news, FED speeches, etc, this quickly becomes very costly.\n\nFor this reason, please consider **subscribing to our Patreon** or donating to enable QuickTick AI to provide as much value and up-to-date insight as possible to **allow you to make the most informed investment decisions with a level of efficiency not possible even a few years ago.** 100% of the funds will go straight to purchasing more API credits to continue expanding our high quality, up-to-date analysis for more and more companies, and further then into our future value-generating plans. Thanks! - QuickTick AI\n\n---\n\n# Jack in the Box Inc. (Ticker: JACK) Sell-Side Analysis Report\n\n**Current Stock Metrics (as of November 20, 2024, verified via Yahoo Finance and Nasdaq):**\n- **Latest Closing Price**: $54.98\n- **Market Capitalization**: $1.04 billion\n- **52-Week Range**: $46.45 - $113.10\n- **P/E Ratio (TTM)**: 7.82\n- **Dividend Yield**: 4.32% (quarterly dividend of $0.44/share declared Nov 13, 2024)\n\n## Company Overview (198 words)\nJack in the Box Inc. is a leading quick-service restaurant (QSR) operator and franchisor primarily in the United States, owning and managing two iconic brands: Jack in the Box (burgers, tacos, breakfast, and value meals with a late-night focus) and Del Taco (Mexican-inspired fast food). Headquartered in Las Vegas, NV, the company operates ~2,200 Jack in the Box locations (81% franchised) and ~580 Del Taco units (60% franchised) across 25 states, emphasizing drive-thru efficiency, 24-hour operations at many sites, and affordable menu pricing. Founded in 1951, it has evolved into an asset-light franchisor model, generating revenue from royalties (~10% of franchisee sales), rents, advertising fees, and ~400 company-owned stores. In FY2024 (ended Sep 29, 2024), systemwide sales exceeded $15 billion across brands. Recent strategic shifts include aggressive refranchising (targeting 95% franchised by 2025), digital investments (20%+ of sales), and a planned spin-off of Del Taco to unlock value, announced August 14, 2024. The company targets urban/suburban markets with high traffic, competing in the $400B+ U.S. limited-service restaurant sector amid value-driven consumer trends.\n\n## Recent Developments\n- **Q4 FY2024 Earnings (Reported Nov 13, 2024)**: Total revenues $336.9M (down 7.8% YoY); same-store sales -2.4% (Jack -3.1%, Del Taco -0.6%); net loss $20.7M or -$1.08/share; Adjusted EBITDA $42.2M. Restaurant-level margin 14.5% (down from 16.7%).\n- **Q3 FY2024 Earnings (Aug 14, 2024)**: Revenues $370.8M (up 2.7% YoY); same-store sales -0.4%; Adjusted EBITDA $59.4M; announced Del Taco spin-off via rights offering to shareholders (expected H1 2025).\n- **Refranchising Progress (Oct 2024)**: Sold 32 Jack in the Box and 7 Del Taco company stores to franchisees for $43M.\n- **Dividend Declaration (Nov 13, 2024)**: $0.44/share payable Dec 18, 2024 to shareholders of record Dec 4.\n- **Leadership Change (Sep 2024)**: Tim Hackenbracht appointed Interim CFO following departure of Steve Gilbert.\n- **Menu/Promo News (Nov 2024)**: Launched \"Munch Away\" value deal ($15 meal for two) amid consumer value focus; social media buzz on TikTok/Reddit highlights \"tiny tacos\" resurgence.\n\n## Growth Strategy\n- **Asset-Light Transition**: Target 95% franchised portfolio by end-2025 (currently ~85%); $100M+ in refranchising proceeds expected FY2025 for debt reduction/share repurchases.\n- **Digital & Loyalty**: Jack in the Box app downloads up 25% YoY; 23% digital sales mix; Del Taco \"Sip Club\" loyalty grew to 5M+ members.\n- **Unit Growth**: 30-40 net new units annually; focus on high-volume drive-thru rebuilds (155 remodels FY2024).\n- **Brand Separation**: Del Taco spin-off to allow independent strategies—Jack focuses on burger innovation, Del Taco on Mexican value.\n- **CapEx Discipline**: FY2025 guidance: $80-90M (down from $105M FY2024).\n\n## Headwinds and Tailwinds\n\n| Category | Headwinds | Tailwinds |\n|----------|-----------|-----------|\n| **Company-Specific** | High debt ($2.4B net debt, leverage 4.7x EBITDA); traffic declines (-2-4% YoY); wage inflation (CA Prop 32 minimum wage hikes); QSR menu price fatigue. | Strong franchise royalties (resilient to ops costs); \"Flavor Guarantee\" risk-free trials boosting trials +5%; 4.3% dividend yield attractive for income. |\n| **Sector-Wide (QSR/LSR)** | Consumer spending slowdown (inflation-adjusted traffic -1.5% industry-wide per NPD Group Q3 2024); labor shortages; commodity costs up 3-5%. | Value menu wars (e.g., McDonald's $5 meal success); drive-thru dominance (80%+ sales); M&A consolidation wave. |\n\n## Existing Products/Services\n- **Jack in the Box**: Burgers (e.g., Jumbo Jack), tacos (99¢ Tiny Tacos), chicken sandwiches, breakfast all-day, shakes, late-night cravings; drive-thru/24-hr focus.\n- **Del Taco**: Tacos, burritos, quesadillas, Epic Burritos, fresh guac; value combos under $5.\n- **Services**: Franchise support, supply chain (Epic Fresh program), digital ordering/kiosks.\n\n## New Products/Services/Projects\n- **Jack in the Box**: \"Smashed Jack\" burger (launched Q4 2024); nationwide rollout of automated drink makers (2025); AI drive-thru testing in 50 stores (partnering Toast, pilot Oct 2024).\n- **Del Taco**: \"Crinkle Cuts\" fries (Sep 2024); expanded beer/alcohol menu in 100+ locations (Q1 2025).\n- **Tech**: Voice AI for 20% order accuracy improvement (announced Oct 2024 conference call).\n- **Sustainability**: Packaging reduction initiative (target 25% by 2026).\n\n## Market Share Approximations\n- **U.S. Burger QSR**: ~2-3% (behind McDonald's 45%, Burger King 15%, Wendy's 10%; source: Technomic 2024 Ignite).\n- **Mexican QSR**: Del Taco ~4-5% (Taco Bell 60%, Chipotle 15%; Q3 2024 Nielsen data).\n- **Overall LSR**: <1% combined (dominated by McD/SBZ).\n\n## Market Share Forecast\n- **Short-Term (FY2025)**: Flat to -0.5% decline due to traffic weakness; refranchising may stabilize royalties.\n- **Medium-Term (2026-2027)**: +1-2% growth post-spin-off if unit expansion hits 4% CAGR and digital share rises to 30%; analyst consensus (FactSet) sees modest gains vs. peers amid value positioning.\n\n## Comparison to Competitors\n\n| Metric (Q3 2024 Avg) | JACK | McDonald's | Wendy's | Taco Bell |\n|----------------------|------|------------|---------|-----------|\n| **Same-Store Sales** | -0.4% | +0.7% | -1.7% | +2.4% |\n| **EBITDA Margin** | 16% | 45% | 18% | N/A |\n| **Franchise %** | 85% | 95% | 92% | 90% |\n| **EV/EBITDA** | 7.5x | 20x | 12x | 15x |\n| **Strengths vs. Peers** | Highest value perception (YouGov 2024); late-night niche. | Scale/digital. | Breakfast. | Mexican loyalty. |\n\n## Partnerships, M&A, Clients\n- **Partnerships**: Toast (POS/AI drive-thru, expanded Oct 2024); Keurig Dr Pepper (beverages); Uber Eats/DoorDash (20% delivery sales).\n- **M&A**: Acquired Del Taco for $575M (Mar 2022); no major inbound since; spin-off Del Taco (H1 2025, 100% distribution to JACK shareholders).\n- **Current Clients**: 90%+ franchisees (e.g., Paracorp, Zensar top operators); suppliers like Sysco.\n- **Potential**: Post-spin, Del Taco eyes Chipotle-like fresh-Mex upscale; Jack partners for plant-based (Beyond Meat trials Q1 2025).\n\n## Other Qualitative Measures\n- **ESG**: B- rating (Sustainalytics); improving supply chain traceability.\n- **Sentiment**: Mixed—Reddit/WallStreetBets bullish on spin-off (upvotes on r/JACKinTheBox); analyst consensus \"Hold\" (avg PT $68 from 10 firms, Barclays Nov 2024 downgrade to Equal Weight).\n- **Risks**: Debt maturity 2026 ($1.2B); CA exposure (30% sales, wage hikes).\n- **Upside Catalysts**: Spin unlocks $1B+ Del Taco value; buybacks ($50M authorized).\n\n## Investment Recommendation\n- **Buy Rating**: **4/10 (Hold/Sell Lean)** – Attractive valuation (7.8x P/E vs. sector 18x) and 4.3% yield, but near-term traffic headwinds, high debt, and spin execution risks outweigh growth. Moderate risk appetite favors waiting for $45-50 entry.\n- **Estimated Fair Value**: $72 (30% upside from $54.98); DCF-based (8% discount rate, 3% terminal growth) assuming FY2025 EBITDA $240M, spin accretive +1x multiple expansion. Strong growth upside requires traffic inflection post-spin.",
  "generated_date": "2026-01-08T15:56:56.771303",
  "model": "grok-4-1-fast-reasoning"
}