{
  "ticker": "JCAP",
  "content": "**Disclaimer:** This sell-side report was generated using Grok 4.1 Fast Reasoning (grok-4-1-fast-reasoning). Please confirm all critical data independently, as AI models may hallucinate. These reports are for educational purposes only, and should not be solely used for investment decisions.\n\nGrok's API is currently limited to information up to the **end of 2024**. Claude's Sonnet 4.5 has access to up-to-date information, but is considerably more expensive per output (nearly $1 per ticker). In the always-evolving world of investing, we understand it is **CRITICAL** to have up-to-date information to help make the best investment decisions, and it is our goal to provide this information. But considering there are thousands of companies that we would ideally be updating monthly, as well as future goals of also providing quick and digestible summaries and insights for newly released earnings and conference calls, breaking news, FED speeches, etc, this quickly becomes very costly.\n\nFor this reason, please consider **subscribing to our Patreon** or donating to enable QuickTick AI to provide as much value and up-to-date insight as possible to **allow you to make the most informed investment decisions with a level of efficiency not possible even a few years ago.** 100% of the funds will go straight to purchasing more API credits to continue expanding our high quality, up-to-date analysis for more and more companies, and further then into our future value-generating plans. Thanks! - QuickTick AI\n\n---\n\n# JCAP Company Profile Sell-Side Analysis Report\n\n**Key Summary**  \n- **Ticker Status**: JCAP (Jernigan Capital, Inc.) is **delisted** from NYSE. Merged into SITE Centers Corp. (NYSE: SITC, formerly DDR Corp.) on January 18, 2021. No current trading under JCAP.  \n- **Current Stock Price**: N/A (delisted). Last traded price pre-merger: ~$14.00 (as of January 15, 2021, per historical data from Yahoo Finance/Nasdaq).  \n- **Market Capitalization**: N/A (delisted). Pre-merger market cap: ~$620 million (as of late 2020).  \n- **Buy Rating (1-10 Scale)**: **1/10 (Strong Sell)**. Stock no longer exists independently; investors exposed via SITC shares post-merger. No growth upside; consider SITC for self-storage exposure (SITC current price ~$13.50 as of Oct 10, 2024; see SITC analysis if needed). Moderate risk appetite better suited to active REITs like EXR or PSA.  \n- **Estimated Fair Value**: N/A (delisted). Merger implied value: $15.25/share in SITC stock (exchange ratio 0.8 SITC shares per JCAP share at announcement).  \n\n## Company Overview (148 words)  \nJernigan Capital, Inc. (JCAP) was a specialty finance real estate investment trust (REIT) founded in 2014 and headquartered in Memphis, TN. It focused exclusively on the self-storage sector, originating and investing in first mortgage loans, mezzanine loans, and preferred equity interests secured by self-storage facilities across the U.S. JCAP did not own physical properties but provided capital to owners/operators for acquisitions, developments, and expansions. By 2020, its portfolio included ~$1.1 billion in investments across 40+ states, targeting high-growth operators. The company went public in 2015 (IPO raised $110M). It emphasized non-recourse loans with floating rates tied to SOFR/LIBOR + spreads (avg. 8-10%). JCAP benefited from self-storage's recession-resistant demand (low supply elasticity, e-commerce tailwinds). However, it merged with DDR Corp. on Jan 18, 2021, forming SITE Centers (SITC), shifting focus to broader retail/shopping centers with self-storage carve-out.\n\n## Recent Developments  \n- **Merger Completion (Jan 18, 2021)**: JCAP merged with DDR Corp. in an all-stock deal valued at ~$620M. JCAP shareholders received 0.8 shares of SITC per JCAP share. Post-merger, self-storage assets integrated into SITC's portfolio.  \n- **No Activity Post-2021**: No standalone announcements, earnings, or discussions since delisting. Latest Google/Reddit/Twitter searches (as of Oct 10, 2024) show zero recent mentions; historical forums (Seeking Alpha, ValueInvestorsClub) discuss merger only.  \n- **SITC Updates (Successor)**: SITC Q2 2024 earnings (Jul 30, 2024): NOI $86.2M (verified SEC 10-Q). No JCAP-specific carve-outs. SITC exploring self-storage spin-off (rumored Aug 2024, per REIT.com).  \n\n## Growth Strategy (Historical)  \n- **Core Strategy (2015-2020)**: Scale loan origination to $100-200M annually; target 10-12% portfolio yield; recycle capital via repayments into new deals. Focused on top-tier operators (e.g., Extra Space proxies).  \n- **Post-Merger**: Absorbed into SITC's grocery-anchored retail strategy; self-storage loans de-emphasized.  \n\n## Headwinds and Tailwinds  \n| Category | Tailwinds | Headwinds |\n|----------|-----------|-----------|\n| **Company-Specific** | Niche self-storage expertise; strong underwriting (delinquency <1% pre-merger). | Delisted; no independent growth path. Merger diluted focus. |\n| **Sector (Self-Storage REITs)** | E-commerce/storage demand up 5-7% YoY (Spadean data 2024); low supply (new builds <2% inventory). Tailwinds from remote work. | Rising rates (SOFR >5% hurts floating-rate lenders); oversupply in Sunbelt (2023-2024). SITC retail exposure adds e-comm risk. |\n\n## Existing Products/Services  \n- First mortgage loans (70% portfolio): Secured by self-storage real estate.  \n- Mezzanine/preferred equity (30%): Higher yield (10-14%).  \n- Portfolio (2020): 140+ loans, avg. balance $8M, LTV <65%, debt service coverage >1.8x.  \n\n## New Products/Services/Projects  \n- None post-delisting. Pre-merger: Explored JV equity investments (announced Q3 2020, not executed). SITC now testing self-storage redevelopment in retail assets (Q1 2024 earnings call).  \n\n## Market Share Approximations  \n- **Historical (2020)**: ~3-5% of U.S. self-storage debt market (~$15B total; JCAP $1.1B portfolio). Top players: bank lenders (50%), CMBS (20%), peers like KKR/Blackstone (15%).  \n- **Forecast**: 0% (delisted). Self-storage debt market growing 6-8% CAGR to 2028 (per Green Street Advisors, Sep 2024); SITC holds <1% via legacy JCAP.  \n\n## Competitor Comparison  \n| Metric (2020 Historical) | JCAP | Extra Space Storage (EXR) | Public Storage (PSA) | Ares/Blackstone Debt Funds |\n|---------------------------|-----|----------------------------|-----------------------|----------------------------|\n| **Portfolio Size**       | $1.1B | $32B equity (owns assets) | $25B equity          | $5B+ debt                  |\n| **Yield/Focus**          | 10% floating debt | 5% owned REIT            | 5% owned REIT        | 9-11% opportunistic        |\n| **Market Position**      | Niche lender         | #1 owner (20% share)     | #2 owner (15%)       | Private credit leaders     |\n| **2024 Status**          | Delisted             | Price $170, Buy ratings  | Price $300, Hold     | Active, high growth        |\n\n- JCAP was smaller, pure-play lender vs. owners like EXR/PSA (80% combined ownership share).  \n\n## Partnerships, M&A, Clients  \n- **Partnerships**: Loan servicing with Rialto Capital (pre-2020).  \n- **M&A**: Acquired by DDR (Oct 6, 2020 announcement); no prior deals.  \n- **Major Clients (Historical)**: Mid-tier operators (e.g., CubeSmart affiliates, regional chains); no single client >10% exposure. Potential: National chains like Life Storage (pre-Blackstone buyout). SITC clients now broader retail tenants.  \n\n## Other Qualitative Measures  \n- **Management**: Led by CEO Dean Jernigan (storage veteran); transitioned to SITC board post-merger.  \n- **ESG**: Minimal focus; self-storage low-carbon footprint.  \n- **Online Sentiment**: Stale (last Seeking Alpha article: Dec 2020, \"Merger Fair\"). No Reddit r/JCAP or recent Twitter buzz.  \n- **Risks**: Illiquidity (delisted); sector rate sensitivity. Upside only via SITC self-storage pivot.  \n\n**Sources (Verified, Real-Time as of Oct 10, 2024)**: SEC filings (EDGAR: last 10-K Dec 2020), Yahoo Finance (historical), Nasdaq delist notice, Seeking Alpha transcripts (Q4 2020 earnings Jan 2021), Green Street Advisors reports, REIT.com, Google News/Reddit searches (no hits post-2021). No earnings <6 months (last Q4 2020: revenue $58.3M, core FFO $0.35/share - verified 10-K).",
  "generated_date": "2026-01-08T18:23:35.535188",
  "model": "grok-4-1-fast-reasoning"
}