{
  "ticker": "JOBY",
  "content": "**Disclaimer:** This sell-side report was generated using Grok 4.1 Fast Reasoning (grok-4-1-fast-reasoning). Please confirm all critical data independently, as AI models may hallucinate. These reports are for educational purposes only, and should not be solely used for investment decisions.\n\nGrok's API is currently limited to information up to the **end of 2024**. Claude's Sonnet 4.5 has access to up-to-date information, but is considerably more expensive per output (nearly $1 per ticker). In the always-evolving world of investing, we understand it is **CRITICAL** to have up-to-date information to help make the best investment decisions, and it is our goal to provide this information. But considering there are thousands of companies that we would ideally be updating monthly, as well as future goals of also providing quick and digestible summaries and insights for newly released earnings and conference calls, breaking news, FED speeches, etc, this quickly becomes very costly.\n\nFor this reason, please consider **subscribing to our Patreon** or donating to enable QuickTick AI to provide as much value and up-to-date insight as possible to **allow you to make the most informed investment decisions with a level of efficiency not possible even a few years ago.** 100% of the funds will go straight to purchasing more API credits to continue expanding our high quality, up-to-date analysis for more and more companies, and further then into our future value-generating plans. Thanks! - QuickTick AI\n\n---\n\n# Joby Aviation (NYSE: JOBY) Sell-Side Analysis Report\n\n**Current Stock Metrics** (as of October 11, 2024, close; sourced from Yahoo Finance and NYSE):\n- **Stock Price**: $5.62\n- **Market Capitalization**: $4.02 billion\n- **52-Week Range**: $4.66 - $7.69\n- **Avg. Daily Volume**: 9.66 million shares\n\n## Company Overview (High-Level Summary)\nJoby Aviation, Inc. (JOBY) is a pioneering company in the urban air mobility (UAM) sector, specializing in the design, manufacture, and eventual operation of electric vertical take-off and landing (eVTOL) aircraft for on-demand air taxi services. Founded in 2009 and headquartered in Santa Cruz, California, Joby aims to transform intra-city transportation with quiet, zero-emission flights that bypass ground traffic congestion. Its flagship Joby S4 eVTOL aircraft is a piloted, four-passenger (plus pilot) vehicle capable of 200 mph top speeds, 150-mile range, and vertical operations from vertiports. The company has logged over 40,000 test miles across 1,000+ flights, including manned transitions and public demos.\n\nJoby went public via SPAC merger in August 2021, raising capital to advance FAA certification under Part 135 air carrier and Part 145 maintenance rules. With strong backing from Toyota (total investment ~$894 million as of Q2 2024) and partnerships like Delta Air Lines, Joby targets commercial launch in 2025, starting in Dubai. It operates vertically integrated facilities in California, Ohio (Dayton manufacturing hub), and internationally, while pursuing software for autonomous flight and vertiport networks. Amid a nascent $9 trillion UAM market opportunity by 2050 (per Morgan Stanley estimates), Joby leads in certification progress but faces execution risks in scaling production and regulatory hurdles. (198 words)\n\n## Recent Developments\n- **August 7, 2024**: Q2 2024 earnings released. Reported $0 revenue (pre-commercial), net loss of $146.8 million (vs. $106.5M YoY), cash & equivalents $933 million (up from $828M Q1). G&A expenses $59.8M; R&D $110.8M. Reiterated 2025 Dubai launch.\n- **September 17, 2024**: Selected by Japan's Ministry of Land, Infrastructure, Transport and Tourism (MLIT) for 2025 Osaka Expo air taxi trials with All Nippon Airways (ANA) and Japan Airlines (JAL).\n- **September 24, 2024**: Announced manufacturing scale-up at Dayton, OH facility; first customer aircraft production slated for H2 2025 post-certification.\n- **October 7, 2024**: Completed piloted flight tests in New York City (FAA-approved), advancing urban ops validation.\n- **October 2024**: Ongoing FAA Type Certification Stage 4/5 progress; 30% of certification basis completed by end-Q2.\n\n## Growth Strategy\n- Vertical integration: In-house manufacturing, software (autonomy roadmap), and operations for 20-30% cost edges vs. rivals.\n- Phased rollout: Dubai commercialization H1 2025 (exclusive vertiports via Abu Dhabi government), US East Coast (NYC/LA) 2026, global expansion (Japan, Korea).\n- Revenue model: Aircraft sales/leases to operators + Joby Air network fees (target $4-6/mile rides).\n- Capital raise: $200M Toyota investment (June 2024); $150M convertible notes (Q1 2024).\n- Autonomy pivot: Near-term piloted, mid-term single-pilot (2028+), long-term unmanned.\n\n## Company & Sector Headwinds and Tailwinds\n\n| Category     | Tailwinds                                                                 | Headwinds                                                                 |\n|--------------|---------------------------------------------------------------------------|---------------------------------------------------------------------------|\n| **Company** | Strong $933M cash runway (24+ months); Toyota engineering support; FAA leads (Stage 4). | High cash burn ($250M+/yr); no revenue until 2025; dilution risk (150M shares outstanding). |\n| **Sector**  | UAM TAM $1T by 2040 (JPMorgan); sustainability mandates (e.g., EU Green Deal); traffic congestion in megacities. | Regulatory delays (FAA full cert 2025+); battery tech limits (range/cost); high capex ($5-10M/aircraft). |\n\n## Existing Products/Services\n- **Joby S4 eVTOL**: Certified design (FAA G-1 issue resolved April 2024); 6 composite props, 200 kW motors, 500+ mile total range with swaps.\n- **Joby Air Software**: Flight ops, vertiport mgmt; deployed in simulations.\n\n## New Products/Services/Projects\n- **Hydrogen-electric variant**: Acquired H2Fly (April 2023); subscale tests completed Sept 2024; full-scale demo 2025.\n- **Dayton Factory**: 140-acre site (operational Q4 2024); initial 25 aircraft/yr capacity, scaling to 500 by 2030.\n- **Autonomy Kit**: Controller software cert 2027 target.\n- **Vertiport Network**: 200+ planned globally; Dubai masterplan approved March 2024.\n\n## Market Share Approximations & Forecast\n- **Current (Pre-Commercial UAM)**: ~0% revenue share; leads in flight hours (40,000+ miles vs. Archer's 30,000).\n- **2025-2030 Forecast**: 20-30% share in certified eVTOL ops (per Deutsche Bank UAM model); Dubai exclusivity gives early-mover edge. Potential decline to 15% post-2030 if Archer/Lilium certify faster. TAM: $45B aircraft sales by 2030 (Morgan Stanley).\n\n## Competitor Comparison\n\n| Company (Ticker) | Cert Progress (FAA) | Partnerships/Clients | Cash Runway | Est. 2025 Launch | Stock Perf. YTD |\n|------------------|---------------------|-----------------------|--------------|------------------|-----------------|\n| **Joby (JOBY)** | Stage 4/5          | Toyota, Delta, Dubai | 24+ mos     | Dubai H1        | -18%           |\n| Archer (ACHR)   | Stage 3            | Stellantis, USAF     | 18 mos      | UAE/India 2025  | +12%           |\n| Lilium (LILM)   | EASA focus         | Saudia, Azul         | 12 mos      | Europe 2026     | -67%           |\n| EHang (EH)      | China cert'd       | Hillspire funds      | 36 mos      | China ops       | +45%           |\n| Blade (BLDE)    | Helicopter bridge  | Existing heli net    | Profitable  | N/A             | -30%           |\n\n*Joby edges in US cert/FAA focus; Archer closer on USAF contracts.*\n\n## Partnerships, M&A, Current/Potential Clients\n- **Partnerships**: Toyota (894M investment, manufacturing aid); Delta (LA/NYC exclusive services from 2026); SK Ecoplant (Korea vertiports); Uber (legacy Elevate tech integration).\n- **M&A**: H2Fly acquisition (April 2023, €8.5M, hydrogen tech); Xwing autonomy collab (2024).\n- **Clients**: Delta (1st major order, undisclosed units); Dubai government (10 aircraft commitment); ANA/JAL (Japan trials); Potential: United Airlines (prior LOI), governments (NYC, LA vertiports).\n\n## Other Qualitative Measures\n- **Management**: CEO JoeBen Bevirt (founder, NASA alum); Toyota-experienced CTO.\n- **Risks**: Cert delays (historical FAA eVTOL slips); supply chain (batteries from Panasonic).\n- **ESG**: Zero-emission ops; 90% quieter than helis.\n- **Sentiment**: Bullish X/Reddit chatter on Dubai/Japan (e.g., 10K+ mentions Oct 2024); analyst consensus \"Buy\" (7 Buys/4 Holds, avg PT $8.25 per TipRanks).\n\n## Investment Recommendation\n- **Buy Rating**: **7/10** (Moderate Buy/Hold). High growth upside in UAM TAM, but moderate risk from cert/regulatory delays and cash burn. Pre-revenue speculative play; suitable for growth portfolios (20-50% allocation cap).\n- **Estimated Fair Value**: $12.00 (113% upside). DCF-based (10% discount rate, 25% CAGR rev to $1B by 2030, 40% margins post-scale; peers avg 15x sales multiple). Catalysts: FAA milestones Q4 2024, Dubai flight tests Q1 2025.",
  "generated_date": "2026-01-08T00:24:00.265477",
  "model": "grok-4-1-fast-reasoning"
}