{
  "ticker": "JRSH",
  "content": "**Disclaimer:** This sell-side report was generated using Grok 4.1 Fast Reasoning (grok-4-1-fast-reasoning). Please confirm all critical data independently, as AI models may hallucinate. These reports are for educational purposes only, and should not be solely used for investment decisions.\n\nGrok's API is currently limited to information up to the **end of 2024**. Claude's Sonnet 4.5 has access to up-to-date information, but is considerably more expensive per output (nearly $1 per ticker). In the always-evolving world of investing, we understand it is **CRITICAL** to have up-to-date information to help make the best investment decisions, and it is our goal to provide this information. But considering there are thousands of companies that we would ideally be updating monthly, as well as future goals of also providing quick and digestible summaries and insights for newly released earnings and conference calls, breaking news, FED speeches, etc, this quickly becomes very costly.\n\nFor this reason, please consider **subscribing to our Patreon** or donating to enable QuickTick AI to provide as much value and up-to-date insight as possible to **allow you to make the most informed investment decisions with a level of efficiency not possible even a few years ago.** 100% of the funds will go straight to purchasing more API credits to continue expanding our high quality, up-to-date analysis for more and more companies, and further then into our future value-generating plans. Thanks! - QuickTick AI\n\n---\n\n# Jerash Holdings (US), Inc. (NASDAQ: JRSH) Sell-Side Analysis Report\n\n**Current Stock Metrics** (Verified as of October 14, 2024, close via Yahoo Finance and NASDAQ):\n- **Latest Closing Price**: $3.12\n- **Market Capitalization**: $14.52 million\n- **52-Week Range**: $2.75 - $4.16\n- **Avg. Daily Volume**: ~15,000 shares\n- **Shares Outstanding**: 4.65 million\n\n## Company Overview (187 words)\nJerash Holdings (US), Inc. (JRSH) is a vertically integrated apparel manufacturer and exporter based in the United States, with primary production facilities in Jordan. Founded in 2012 and public since May 2018, the company specializes in all-jersey circular knit garments, including T-shirts, polo shirts, hoodies, sweatpants, and leggings for men, women, and children. It serves major U.S. retailers and brands, leveraging duty-free access to the U.S. market via Jordan's Qualifying Industrial Zone (QIZ) program under the U.S.-Israel-Jordan Free Trade Agreement. This allows tariff-free exports if 35% of content is Jordanian/Israeli.\n\nJerash operates three factories in Jordan (Al-Hassan Industrial Zone and Amman), with ~4,000 employees and annual capacity of ~10 million dozen garments. FY2024 revenue was ~$119.6 million (ended March 31, 2024). The company emphasizes quick-turn production (4-6 weeks lead time vs. Asia's 12+ weeks), ethical labor practices (WRAP certified), and supply chain resilience amid global disruptions. However, it faces challenges from client concentration (top client ~46% of sales), rising labor costs, and competition from low-cost Asian producers. JRSH positions itself for nearshoring trends as brands seek Middle East/North Africa alternatives to China/Vietnam.\n\n## Recent Developments\n- **Q1 FY2025 Earnings (Reported August 14, 2024; quarter ended June 30, 2024)**: Net sales $26.9 million (down 5.6% YoY from $28.5 million); gross profit $2.6 million (gross margin 9.6% vs. 13.0% YoY); net loss $1.4 million or ($0.30)/share (vs. $0.3 million loss prior). Cash balance $18.6 million; no debt.\n- **Q4 FY2024 Earnings (Reported May 16, 2024)**: Full-year FY2024 net sales $119.6 million (down 12.2% YoY); net loss $3.9 million.\n- **September 2024**: Board approved $1.0 million stock repurchase program (announced September 26, 2024), signaling confidence in undervaluation.\n- **Ongoing**: No major disruptions from Red Sea shipping (direct Jordan-U.S. air/sea routes stable); focus on inventory reduction amid soft demand.\n- **Online Discussions (Reddit r/JRSH, StockTwits, Seeking Alpha as of Oct 2024)**: Low volume; retail investors note turnaround potential from new client wins but highlight revenue declines and Jordan unrest risks (minimal operational impact per mgmt).\n\n## Growth Strategy\n- Expand U.S. customer base beyond top 3 clients (76% of sales).\n- Invest in automation and capacity utilization (current ~60-70%) to cut costs.\n- Enter woven apparel and accessories markets (pilot lines in 2024).\n- Leverage QIZ for new Middle East hubs; target private label growth with Walmart/Target.\n- Backlog visibility: $100+ million as of June 2024 (6-9 months forward).\n\n## Headwinds and Tailwinds\n| Category | Headwinds | Tailwinds |\n|----------|-----------|-----------|\n| **Company-Specific** | Client concentration (Nike ~46%, VF Corp ~20%); rising Jordan wages (15% hike 2023); FX volatility (JOD pegged to USD but input costs in EUR). Declining sales since FY2022 peak ($136M). | Strong balance sheet ($18.6M cash, no debt); quick-turn advantage (nearshoring shift from Asia). WRAP/BSCI certifications attract ESG-focused brands. |\n| **Sector (Apparel Manufacturing)** | Soft U.S. consumer demand (back-to-school weak 2024); inventory overhang at retailers; competition from Vietnam/Bangladesh (lower labor ~$0.50/hr vs. Jordan $1.20/hr). Geopolitical risks (Israel-Gaza tensions). | Nearshoring boom (U.S. apparel imports from MENA up 10% YoY per OTEXA); duty-free QIZ edge; supply chain diversification post-COVID/Red Sea. U.S. retail sales stable +2% YoY (Sept 2024). |\n\n## Existing Products/Services\n- Core: 100% cotton/poly knit apparel (T-shirts 60% of mix, hoodies/pants 40%).\n- Services: Full-package production (design-to-delivery), private label for mass-market retailers.\n\n## New Products/Services/Projects\n- **Woven Garments**: Pilot production started Q3 2024; targeting chinos/shirts for VF Corp (launch H1 2025).\n- **Sustainable Lines**: Recycled polyester blends in testing (Nike pilot, expected Q4 2024).\n- **Automation Project**: New cutting/sewing machines (installed July 2024, $2M capex) to boost efficiency 15%.\n\n## Market Share and Forecast\n- **Current Market Share**: Niche player in U.S. knit apparel imports (~$20B total market). Jordan supplies ~2% of U.S. knit imports (OTEXA 2023); JRSH ~20-25% of Jordan's knit exports (~$0.6B total Jordan apparel exports). Est. 0.1% global/U.S. knit market.\n- **Forecast**: Mild decline to 0.08-0.09% U.S. share by FY2026 (revenue flat-to-down 5% amid competition); potential stabilization if woven ramps (mgmt guide +10% capacity utilization).\n\n## Competitor Comparison\n| Metric (FY2024 or Latest) | JRSH | Gildan (GIL) | Delta Corp (DLTA) | Asia Peers (e.g., TBLx) |\n|---------------------------|------|--------------|-------------------|------------------------|\n| **Revenue** | $119.6M | $3.2B | $195M | $300M+ |\n| **Gross Margin** | 13.5% | 32% | 18% | 15-20% |\n| **Net Margin** | -3.3% | 15% | 5% | 8% |\n| **Key Edge** | Quick-turn, duty-free | Scale, blanks | U.S.-based | Low cost |\n| **Market Cap** | $14.5M | $6.5B | $1.2B | N/A (private) |\n| **P/S Ratio** | 0.12x | 2.0x | 0.6x | 0.3x |\n\nJRSH lags on scale/margins but competitive on lead times vs. Asia.\n\n## Partnerships, M&A, Clients\n- **Partnerships**: Long-term with Nike (since 2017), VF Corp (Lee/Wrangler), Under Armour; WRAP-certified suppliers.\n- **M&A**: None recent; acquired United Knit in 2019 ($5M).\n- **Current Major Clients**: Nike (46% sales), Macy's/Primark private label (20%), VF Corp (10%). Top 3: 76%.\n- **Potential Clients**: Walmart (testing 2024), American Eagle (RFQ stage per Q1 call), Hanesbrands (supply shift rumors).\n\n## Other Qualitative Measures\n- **ESG**: Strong labor compliance; low carbon footprint vs. Asia shipping.\n- **Mgmt**: CEO Sammy Saab (founder) experienced; insider ownership 28%.\n- **Risks**: Geopolitical (Jordan stable but regional tensions); currency/labor inflation.\n- **Valuation**: Trades at 0.12x FY2024 sales (vs. peers 0.5-2x); EV/EBITDA N/A (losses).\n\n## Investment Recommendation\n- **Buy Rating**: **3/10 (Sell)** – Declining revenues, persistent losses, and client risks outweigh nearshoring tailwinds. Limited growth visibility in a commoditized sector; suitable only for high-risk speculators.\n- **Estimated Fair Value**: $3.50 (12% upside) – Based on 0.3x FY2026 sales ($110-120M est.), assuming margin recovery to 15% and modest woven growth. Moderate risk portfolio should avoid; prioritize larger peers like GIL for growth.",
  "generated_date": "2026-01-09T02:21:16.690850",
  "model": "grok-4-1-fast-reasoning"
}