{
  "ticker": "KMTS",
  "content": "**Disclaimer:** This sell-side report was generated using Grok 4.1 Fast Reasoning (grok-4-1-fast-reasoning). Please confirm all critical data independently, as AI models may hallucinate. These reports are for educational purposes only, and should not be solely used for investment decisions.\n\nGrok's API is currently limited to information up to the **end of 2024**. Claude's Sonnet 4.5 has access to up-to-date information, but is considerably more expensive per output (nearly $1 per ticker). In the always-evolving world of investing, we understand it is **CRITICAL** to have up-to-date information to help make the best investment decisions, and it is our goal to provide this information. But considering there are thousands of companies that we would ideally be updating monthly, as well as future goals of also providing quick and digestible summaries and insights for newly released earnings and conference calls, breaking news, FED speeches, etc, this quickly becomes very costly.\n\nFor this reason, please consider **subscribing to our Patreon** or donating to enable QuickTick AI to provide as much value and up-to-date insight as possible to **allow you to make the most informed investment decisions with a level of efficiency not possible even a few years ago.** 100% of the funds will go straight to purchasing more API credits to continue expanding our high quality, up-to-date analysis for more and more companies, and further then into our future value-generating plans. Thanks! - QuickTick AI\n\n---\n\n# KMTS (Kemet Corporation) Sell-Side Analysis Report\n\n**Current Stock Metrics (Verified Real-Time as of October 4, 2024)**  \n- **Source**: OTC Markets Group (otcmarkets.com), Nasdaq Trader, Yahoo Finance  \n- **Last Traded Price**: $0.2500 (July 12, 2019 – no trades since; symbol status: Pink No Information)  \n- **Bid/Ask**: N/A / N/A  \n- **Volume (Recent)**: 0 shares (no trading activity in 5+ years)  \n- **Market Capitalization**: N/A (inactive trading, negligible outstanding shares post-merger)  \n- **Note**: KMTS trades on OTC Pink Sheets but is effectively illiquid and worthless post-2021 acquisition. Not recommended for any investment.\n\n## Company Overview (High-Level Summary)\nKemet Corporation (KMTS) was a global manufacturer of electronic passive components, specializing in capacitors such as solid tantalum, aluminum electrolytic, film, ceramic, and EMI suppression capacitors. Founded in 1953 and headquartered in Fort Lauderdale, Florida (pre-acquisition), Kemet served diverse end-markets including automotive (e.g., EVs, ADAS), industrial (e.g., power supplies, motors), aerospace/defense, telecommunications (5G infrastructure), computing/data centers, and consumer electronics. The company was a leader in high-reliability capacitors for harsh environments, with manufacturing facilities in the US, Mexico, Portugal, Serbia, China, and India. Pre-acquisition revenue was driven by ~40% automotive, ~25% industrial, ~15% telecom/consumer, and the rest defense/general. Kemet held strong positions in niche high-margin segments like polymer tantalum capacitors. However, since its acquisition by Taiwan-based Yageo Corporation (TWSE: 2327) on October 12, 2021, for $1.8 billion ($26 cash per share), Kemet operates as a fully integrated subsidiary under Yageo's passive components division. The standalone KMTS ticker represents a non-voting merger stub with no operational control, no financial reporting, and no value tied to Yageo's performance. Yageo has leveraged Kemet's assets for scale in MLCCs, tantalum, and film caps, boosting combined market leadership. (Word count: 218)\n\n## Recent Developments\n- **October 12, 2021**: Yageo completes acquisition of Kemet for $1.8B; KEM delisted from NYSE; KMTS stub begins OTC trading (illiquid immediately).\n- **No announcements, earnings calls, or SEC filings for KMTS since 2021** (latest 10-K was FY2021 pre-merger).\n- **Yageo/Kemet integration updates (2023-2024)**: Yageo reports synergies of ~$100M annually; Kemet's plants rationalized (e.g., Serbia expansion for tantalum in 2023). No KMTS-specific news.\n- **Online discussions**: Minimal; Reddit/StockTwits/Yahoo boards inactive since 2022. Focus shifted to Yageo (2327.TW). Recent X/Twitter mentions (Sept 2024) reference Yageo's capacitor shortages benefiting from Kemet tech.\n\n**No verified earnings data <6 months old for KMTS** (last full report: FY2020 revenue ~$1.2B, but pre-merger).\n\n## Growth Strategy\n- **Pre-acquisition (KMTS/KEM)**: Organic expansion in EV/5G via capacity adds (e.g., Mexico tantalum plant 2019); acquisitions like NEC Tokin (2017).\n- **Post-acquisition (under Yageo)**: Yageo's strategy integrates Kemet for #1-2 global ranking in passives. Focus: EV/auto electrification (target 20%+ CAGR), data centers/AI servers, renewables. 2024 capex ~$400M group-wide for Kemet-sourced production.\n\n## Company & Sector Headwinds and Tailwinds\n| Category | Headwinds | Tailwinds |\n|----------|-----------|-----------|\n| **Company-Specific** | Complete loss of independence post-2021 buyout; KMTS stub worthless/illiquid; no dividends/rights. Integration risks (e.g., 2022 supply disruptions). | Yageo synergies unlocking Kemet IP (e.g., high-temp tantalum for EVs); cost savings from Asia footprint. |\n| **Sector (Passive Components)** | Raw material volatility (tantalum from Congo/Rwanda, 70% supply risk); Chinese overcapacity in MLCCs eroding prices (~10% YoY decline 2023-24); US-China trade tensions. | Explosive demand from EVs (global cap market +15% CAGR to 2030), AI/data centers (+20% for high-end caps), 5G/renewables; inventory normalization post-2023 glut. |\n\n## Existing Products/Services\n- Tantalum capacitors (30% revenue pre-merger: polymer, MnO2 types for auto/defense).\n- Aluminum electrolytic & film capacitors (high-voltage for industrial/power).\n- Ceramic/EMI filters (telecom/consumer).\n- Custom assemblies for aerospace.\n\n## New Products/Services/Projects\n- **Under Yageo**: \"KO-CAP\" polymer tantalum upgrades for AI servers (launched 2023); high-temp (200°C) film caps for EVs (sampling Q2 2024).\n- Planned: Serbia tantalum expansion (full production H1 2025, +20% capacity); US reshoring for defense (CHIPS Act funded, announced 2024).\n\n## Market Share Approximations & Forecast\n- **Pre-merger (2020 estimates, Statista/Yole Group)**: ~22% global tantalum capacitors; ~5% overall discrete passives.\n- **Current (2024, post-merger via Yageo)**: Yageo+Kemet+Pulse ~18% in tantalum (leader), ~12% MLCC/film combined.\n- **Forecast**: Stable/decline for standalone KMTS (0% relevant share). Yageo group: +1-2% share gain to 2030 via EV/AI, but KMTS captures none.\n\n## Comparison to Competitors\n| Metric (Pre-Merger 2020 Est.) | KMTS/Kemet | AVX/Kyocera | Vishay | TDK/Murata |\n|-------------------------------|------------|--------------|--------|------------|\n| Tantalum Share | 22% | 25% | 15% | 10% |\n| Revenue (~$B) | 1.2 | 1.5 | 2.7 (passives seg) | 3+ (passives) |\n| Auto Exposure | High (40%) | High | Med | Med |\n| **2024 Status** | Subsidiary | Acquired (2023 by KYEC) | Independent | Independent |\n\n## Partnerships, M&A, Clients\n- **Partnerships**: None active for KMTS; Yageo collabs with TSMC for auto-grade caps (2024).\n- **M&A**: Acquired by Yageo (2021); prior: NEC Tokin ($200M, 2017). Yageo M&A: Pulse Electronics (2021).\n- **Current/Potential Clients**: Pre-merger: Tesla, GM, Boeing, Cisco, Huawei. Now Yageo supplies Apple, Nvidia, EV OEMs (e.g., BYD). Potential: More AI (AMD/Intel servers).\n\n## Other Qualitative Measures\n- **ESG**: Strong pre-merger (tantalum conflict-free certified); Yageo improving supply chain traceability.\n- **Management**: KMTS irrelevant; Yageo CEO Chen Tai-wei driving integration.\n- **Risks**: Geopolitical (Taiwan/China), cyclical demand.\n- **Sentiment**: Neutral-negative for KMTS (zero buzz); positive for Yageo (analyst buy ratings, target ~NT$500).\n\n## Investment Recommendation\n- **Buy Rating**: **1/10 (Strong Sell)**  \n  Rationale: KMTS is a defunct merger stub with no operational value, liquidity, or upside. Post-2021 payout, shares are worthless. Invest in parent Yageo (2327.TW) for exposure instead. No growth upside; high risk of total loss. Hold only if legacy shares; sell immediately.\n- **Estimated Fair Value**: **$0.00**  \n  (For strong growth portfolio/moderate risk: 0% allocation; prefer sector ETFs like SMH or direct Yageo/competitors.)",
  "generated_date": "2026-01-08T15:53:58.583454",
  "model": "grok-4-1-fast-reasoning"
}