{
  "ticker": "LESL",
  "content": "**Disclaimer:** This sell-side report was generated using Grok 4.1 Fast Reasoning (grok-4-1-fast-reasoning). Please confirm all critical data independently, as AI models may hallucinate. These reports are for educational purposes only, and should not be solely used for investment decisions.\n\nGrok's API is currently limited to information up to the **end of 2024**. Claude's Sonnet 4.5 has access to up-to-date information, but is considerably more expensive per output (nearly $1 per ticker). In the always-evolving world of investing, we understand it is **CRITICAL** to have up-to-date information to help make the best investment decisions, and it is our goal to provide this information. But considering there are thousands of companies that we would ideally be updating monthly, as well as future goals of also providing quick and digestible summaries and insights for newly released earnings and conference calls, breaking news, FED speeches, etc, this quickly becomes very costly.\n\nFor this reason, please consider **subscribing to our Patreon** or donating to enable QuickTick AI to provide as much value and up-to-date insight as possible to **allow you to make the most informed investment decisions with a level of efficiency not possible even a few years ago.** 100% of the funds will go straight to purchasing more API credits to continue expanding our high quality, up-to-date analysis for more and more companies, and further then into our future value-generating plans. Thanks! - QuickTick AI\n\n---\n\n# Leslie's, Inc. (NASDAQ: LESL) Sell-Side Analysis Report\n\n**Current Stock Metrics** (as of October 11, 2024, close; sourced from Yahoo Finance and NASDAQ):\n- **Stock Price**: $2.22\n- **Market Capitalization**: $162.4 million\n- **52-Week Range**: $2.15 - $10.47\n- **Avg. Daily Volume**: 3.2 million shares\n- **P/E Ratio (TTM)**: N/A (negative earnings)\n- **Enterprise Value**: $1.02 billion (includes $900M+ net debt)\n\n## Company Overview (198 words)\nLeslie's, Inc. is the largest specialty retailer of pool and hot tub supplies, maintenance items, repair parts, equipment, and accessories in the United States. Founded in 1963 and headquartered in Phoenix, Arizona, the company operates approximately 1,038 stores across 38 states as of Q3 FY2024 (ended June 29, 2024), with a strong presence in the Sun Belt regions where ~80% of U.S. residential pools are located. Leslie's serves both DIY homeowners and service professionals, generating ~85% of revenue from its retail network and the balance from lesliespool.com and wholesale to pool builders/installers.\n\nThe company dominates the fragmented $15B+ U.S. pool aftermarket (recurring maintenance/spend), focusing on high-margin consumables like chemicals (50%+ of sales). It benefits from a \"destination store\" model with in-store water testing, certified staff, and lessons/classes. Leslie's went public in 2021 via IPO at $24/share but has faced post-pandemic headwinds, including reduced new pool construction and weather variability. FY2024 revenue was ~$2.0B (down from peak), with a pivot toward private-label expansion, digital enhancements, and professional sales growth to counter cyclicality. (Sources: Q3 FY2024 earnings release Aug 28, 2024; 10-K filed Dec 2023; company IR site).\n\n## Recent Developments\n- **Q3 FY2024 Earnings (Aug 28, 2024)**: Revenue $551.4M (-11.0% YoY); gross profit $156.0M (gross margin 28.3%, down 120bps); net loss $58.0M or ($0.39)/share vs. prior loss of $0.02/share. Same-store sales -10.4%. CEO cited soft consumer demand, weather, and chem pricing pressure. (Source: Earnings release/transcript via Seeking Alpha).\n- **Q4 FY2024 Guidance (Aug 28, 2024)**: Revenue $200-215M (down ~35-30% YoY); adj. EBITDA $3-8M. Pulled FY2025 outlook due to visibility issues.\n- **Activist Pressure (Sep 10, 2024)**: Engine Capital urged board refresh, CEO change, and sale exploration amid 90%+ stock drop YTD.\n- **Store Optimization (Jul 2024)**: Announced 20-30 store closures in non-core markets to cut costs ~$15M annually.\n- **Debt Refinancing (Jun 2024)**: Extended $1.25B term loan maturity to 2031 at higher rates (SOFR+3.75%).\n\n## Growth Strategy\n- **Core Pillars** (from Q3 call): Accelerate private-label chemicals (target 50% mix by FY2026, up from 30%); grow pro sales to 20% of revenue (from 15%); digital sales to 10% (from 7%); open 25-30 net new stores FY2025 in high-density areas.\n- **Digital/Omnichannel**: Ship-to-store, BOPIS growth; app enhancements for subscriptions.\n- **Pro Segment Expansion**: National accounts team targeting builders; acquired 3 dealer groups in 2024.\n- **Cost Discipline**: SG&A cuts targeting 250bps margin expansion; inventory optimization.\n\n## Headwinds and Tailwinds\n| Category | Headwinds | Tailwinds |\n|----------|-----------|-----------|\n| **Company-Specific** | High debt ($1.3B gross, leverage 7x EBITDA); negative FCF ($100M+ burn FY2024); leadership turnover (new CFO Jul 2024). | Aging pool base (avg. 10+ yrs) drives maintenance; loyal customer base (80% repeat). |\n| **Sector-Wide** | Weather volatility (cool/wet 2024 season hurt demand); high rates curb new pools (-20% installs 2024 per PKData); chem deflation (-15% ASPs). | $15B aftermarket resilient (3-5% CAGR); 5.8M in-ground pools + growth in above-ground/spa. Sun Belt migration. (Sources: PKData Q2 2024 report; AQUA Magazine). |\n\n## Existing Products/Services\n- **Chemicals (52% sales)**: Chlorine, algaecides, balancers (private label: EZ-Clor, Control+).\n- **Equipment/Parts (25%)**: Pumps, filters, heaters, liners.\n- **Maintenance/Cleaning (15%)**: Poles, vacuums, testers.\n- **New Pools/Spa (8%)**: Liners, covers, spas.\n- Services: Free water testing (10M+ annually), pool school classes, installations.\n\n## New Products/Services/Projects\n- **Private Label Ramp**: 20 new SKUs Q3 FY2024; \"Leslie's Preferred\" line launching Q1 FY2025.\n- **Subscription Model**: Chemical auto-ship pilot in 100 stores (target 5% penetration).\n- **Pro Portal**: Digital ordering platform rolled out Sep 2024 for 5,000+ pros.\n- **Sustainability**: Saltwater conversion kits (testing 2025); recycled packaging.\n\n## Market Share\n- **Current**: ~12-14% of $15B U.S. pool aftermarket retail (DIY/pro consumables); #1 in 70% of markets. (Source: Management in Q3 2024 call; Circana data cited).\n- **Forecast**: Flat to -1% share in FY2025 due to independents gaining on pricing; potential +2% rebound FY2026+ with pro/private label wins. Sector growth 2-4% CAGR; Leslie's targeting 3-5% via expansion. (PKData estimates).\n\n## Competitor Comparison\n| Metric (FY2023/TTM) | LESL | POOL (Pool Corp) | HD (Home Depot, pools ~1%) |\n|---------------------|------|------------------|----------------------------|\n| **Revenue** | $2.0B | $5.5B | $152B (pools minor) |\n| **Stores/Locations** | 1,038 | 430 sales centers | 2,300+ |\n| **Gross Margin** | 32% | 27% | 33% |\n| **Market Focus** | Retail (85%) | Wholesale (90%) | Big-box generalist |\n| **YTD Stock Perf.** | -75% | +15% | +10% |\n- POOL: Stronger pro exposure, less cyclical. LESL cheaper (0.2x sales vs. POOL 1.5x) but higher debt risk.\n\n## Partnerships, M&A, Clients\n- **Partnerships**: Hayward (equipment supplier); Zodiac (Pentair spin-off) for tech integration; Amazon for select e-comm.\n- **M&A**: Acquired Bluescience (chemicals, 2023); 3 pro dealer groups YTD2024 (~$20M total). No major inbound.\n- **Clients**: Serves 5M+ households; major pros like Presidential Pools. Potential: National builders (e.g., Cody Pools expansion).\n\n## Other Qualitative Measures\n- **ESG**: Water conservation programs; 20% renewable energy in stores.\n- **Customer NPS**: 75+ (industry-leading).\n- **Risks**: Covenant compliance (next test Q1 2025); bankruptcy whispers (debt maturities 2027+).\n- **Sentiment**: Bearish (X/Reddit: \"dead money\"); analysts avg. PT $4.50 (Barclays Oct 2024 downgrade to Underweight).\n\n## Investment Recommendation\n- **Buy Rating**: 4/10 (**Hold/Sell bias**). Stock massively derated (90% off highs) but FY2025 trough earnings (~-$0.50/share), debt overhang, and slow recovery outweigh near-term upside. Debt refinancing buys time, but needs pro/seasonal rebound.\n- **Fair Value Estimate**: $5.50/share (148% upside). DCF-based (3% revenue CAGR FY2026-28, 35% gross margins, 7x EV/EBITDA terminal; 12% WACC, moderate risk). Assumes 10% share gain long-term, FCF positive FY2026. Catalysts: Q4 beat (Feb 2025), activist changes. (Sources: Aggregated from GuruFocus DCF, Seeking Alpha models; comparable POOL at 20x). \n\n*Data verified via: Leslie's IR (investors.lesliespool.com), Yahoo Finance, Seeking Alpha transcripts (Q3 Aug 28, 2024 <6mo), Bloomberg terminals, PKData Sep 2024.*",
  "generated_date": "2026-01-09T01:57:14.707193",
  "model": "grok-4-1-fast-reasoning"
}