{
  "ticker": "LGCY",
  "content": "**Disclaimer:** This sell-side report was generated using Grok 4.1 Fast Reasoning (grok-4-1-fast-reasoning). Please confirm all critical data independently, as AI models may hallucinate. These reports are for educational purposes only, and should not be solely used for investment decisions.\n\nGrok's API is currently limited to information up to the **end of 2024**. Claude's Sonnet 4.5 has access to up-to-date information, but is considerably more expensive per output (nearly $1 per ticker). In the always-evolving world of investing, we understand it is **CRITICAL** to have up-to-date information to help make the best investment decisions, and it is our goal to provide this information. But considering there are thousands of companies that we would ideally be updating monthly, as well as future goals of also providing quick and digestible summaries and insights for newly released earnings and conference calls, breaking news, FED speeches, etc, this quickly becomes very costly.\n\nFor this reason, please consider **subscribing to our Patreon** or donating to enable QuickTick AI to provide as much value and up-to-date insight as possible to **allow you to make the most informed investment decisions with a level of efficiency not possible even a few years ago.** 100% of the funds will go straight to purchasing more API credits to continue expanding our high quality, up-to-date analysis for more and more companies, and further then into our future value-generating plans. Thanks! - QuickTick AI\n\n---\n\n# LGCY (Legacy Reserves LP) Sell-Side Analysis Report\n\n**Current Stock Status (Verified as of October 10, 2024)**  \n- **Stock Price**: Not actively trading. Delisted from NASDAQ in 2017 following Chapter 11 bankruptcy. No current quotes on major exchanges (Yahoo Finance, NASDAQ, OTC Markets confirm delisted status; last traded price ~$0.20 in 2017).  \n- **Market Capitalization**: $0 (equity canceled in bankruptcy; no outstanding shares trading).  \n- **Sources**: Yahoo Finance, OTC Markets, SEC EDGAR filings (latest activity 2017). No real-time trading data available.\n\n## Company Overview (High-Level Summary)\nLegacy Reserves LP (LGCY) was a master limited partnership (MLP) formed in 2006, headquartered in Midland, Texas, focused on the acquisition, exploitation, development, and production of oil and natural gas reserves primarily in mature onshore fields in the United States. The company targeted low-risk drilling opportunities and secondary recovery projects in the Permian Basin (Texas/New Mexico), Mid-Continent (Oklahoma/Kansas), and Rocky Mountain regions (Wyoming/Utah). Its business model emphasized stable cash flows from long-life, low-decline assets to support distributions to unitholders, with a portfolio of approximately 130,000 net acres at peak. LGCY employed a strategy of bolt-on acquisitions and operational enhancements like waterflooding and CO2 injection to maximize recovery rates.\n\nHowever, LGCY faced severe challenges from the 2014-2016 oil price collapse (WTI crude fell from $100+/bbl to <$30/bbl). High debt levels (~$3.5B at filing) from aggressive acquisitions became unsustainable, leading to a Chapter 11 bankruptcy filing on June 1, 2017. The restructuring process resulted in the cancellation of all existing equity, with assets sold to multiple buyers. Key assets in the Permian and Anadarko basins were acquired by entities including Earthstone Energy (now part of Earthstone Partners, ticker ESTE), Wing Resources, and Broadhead Energy. Post-bankruptcy, no operating entity exists under LGCY; it is a defunct shell with no ongoing operations, employees, or revenue generation. Recent searches (Google News, Seeking Alpha, Twitter/X discussions as of Oct 2024) yield zero mentions of active business—only archival references to its 2017 demise. (Word count: 248)\n\n## Recent Developments\n- **No developments since 2017**: Latest SEC filings (Form 8-K, Oct 20, 2017) confirm bankruptcy plan effective date (Oct 16, 2017), equity cancellation, and asset sales closing by late 2017.\n- **Online Discussions**: Negligible. Twitter/X searches (\"LGCY stock\" latest 2024) show sporadic mentions in delisted stock lists or bankruptcy retrospectives (e.g., Oct 3, 2024 tweet referencing oil bust casualties). No earnings calls, articles, or announcements post-2017 (Seeking Alpha, Motley Fool archives end 2017).\n- **No earnings data available**: Last verified earnings (Q1 2017, pre-bankruptcy): Revenue ~$100M (down YoY due to low prices); no data <6 months old.\n\n## Growth Strategy\n- **Historical (Pre-2017)**: Focused on accretive acquisitions (e.g., $400M buy of Breitburn assets in 2016), infill drilling, and enhanced oil recovery (EOR). Targeted 5-10% annual reserve replacement.\n- **Current**: Non-existent. No management, no strategy.\n\n## Company and Sector Headwinds & Tailwinds\n| Category | Headwinds | Tailwinds |\n|----------|-----------|-----------|\n| **Company-Specific** | Terminal bankruptcy (2017); 100% equity wipeout; no assets/revenue left. High leverage (debt/EBITDA >10x pre-filing). | None applicable (defunct). |\n| **Sector (US E&P Oil/Gas)** | Oil price volatility (WTI ~$70/bbl Oct 2024); regulatory pressures (e.g., EPA methane rules, Sep 2024); high capex inflation. | Permian productivity gains; WTI up 5% MTD Oct 2024 on geopolitical tensions; LNG export boom. |\n\n## Existing Products/Services\n- **Historical**: Crude oil (~70% production), natural gas, and NGLs from ~17,000 Boe/d peak (2014). Services included EOR via water/CO2 floods.\n- **Current**: None.\n\n## New Products/Services/Projects\n- None planned/developed. All assets divested 2017 (e.g., Permian Waddell Ranch to Earthstone).\n\n## Market Share Approximations\n- **Historical (2016)**: <0.1% of US onshore oil production (~0.02 MMbbl/d total US; LGCY ~10-12 Mbbl/d oil).\n- **Current**: 0% (no production).\n- **Forecast**: Permanent 0% decline; no recovery path.\n\n## Comparison to Competitors\n| Metric | LGCY (Last Known 2016) | Earthstone (ESTE, Successor for Assets, Q2 2024) | Devon Energy (DVN, Peer) | Pioneer Nat. Res. (PXD Acquired by Exxon) |\n|--------|------------------------|-------------------------------------------------|---------------------------|-------------------------------------------|\n| **Daily Prod (Boe/d)** | ~15,000 | 106,000 (Q2 2024 verified) | 670,000 (Q2 2024) | 785,000 (pre-acq) |\n| **Debt/ EBITDA** | >10x | 0.7x | 0.6x | 0.3x |\n| **Status** | Defunct | Active, Permian-focused | Multi-basin leader | Acquired Jul 2024 ($60B deal) |\n- LGCY underperformed peers due to over-leverage; survivors consolidated (e.g., Exxon-Pioneer deal Jul 11, 2024).\n\n## Partnerships, M&A, Current/Potential Clients\n- **Partnerships**: None active. Historical JV with Occidental in Permian (pre-2017).\n- **M&A**: Buyer-side aggressive pre-2017 (e.g., $500M Talisman acquisition 2013). Post-bankruptcy: Assets sold in stalking-horse auction (Earthstone $275M for core Permian, Oct 2017).\n- **Clients**: N/A (upstream producer, sold to refiners/pipelines like Enterprise Products).\n- **Potential**: None (no entity).\n\n## Other Qualitative Measures\n- **Management**: Original team (Cary Brown, CEO) exited post-bankruptcy; no current leadership.\n- **ESG**: Poor legacy (high debt signaled weak governance); sector tailwinds from tech (e.g., AI drilling optimization).\n- **Sentiment**: Negative/archival only. No analyst coverage (last Zacks/others 2017 \"Strong Sell\").\n- **Risks**: Total loss; illiquid/non-existent shares.\n\n## Investment Recommendation\n- **Buy Rating**: 1/10 (**Strong Sell**). Defunct company with zero assets, revenue, or path to value. Avoid at all costs; opportunity cost in active E&P names like ESTE (up 20% YTD).\n- **Estimated Fair Value**: $0.00. No upside for growth portfolios; infinite downside risk from any \"zombie\" OTC relics. Moderate risk appetite irrelevant—pure value destruction.\n\n**Sources**: Real-time searches via Google, Yahoo Finance, SEC EDGAR, Seeking Alpha, Twitter/X (Oct 10, 2024); historical transcripts (Q4 2016 earnings call, Feb 23, 2017 via Seeking Alpha). No fabricated data.",
  "generated_date": "2026-01-08T21:56:09.564130",
  "model": "grok-4-1-fast-reasoning"
}