{
  "ticker": "LVLU",
  "content": "**Disclaimer:** This sell-side report was generated using Grok 4.1 Fast Reasoning (grok-4-1-fast-reasoning). Please confirm all critical data independently, as AI models may hallucinate. These reports are for educational purposes only, and should not be solely used for investment decisions.\n\nGrok's API is currently limited to information up to the **end of 2024**. Claude's Sonnet 4.5 has access to up-to-date information, but is considerably more expensive per output (nearly $1 per ticker). In the always-evolving world of investing, we understand it is **CRITICAL** to have up-to-date information to help make the best investment decisions, and it is our goal to provide this information. But considering there are thousands of companies that we would ideally be updating monthly, as well as future goals of also providing quick and digestible summaries and insights for newly released earnings and conference calls, breaking news, FED speeches, etc, this quickly becomes very costly.\n\nFor this reason, please consider **subscribing to our Patreon** or donating to enable QuickTick AI to provide as much value and up-to-date insight as possible to **allow you to make the most informed investment decisions with a level of efficiency not possible even a few years ago.** 100% of the funds will go straight to purchasing more API credits to continue expanding our high quality, up-to-date analysis for more and more companies, and further then into our future value-generating plans. Thanks! - QuickTick AI\n\n---\n\n# LVLU (Level One Bancorp, Inc.) Sell-Side Analysis Report\n\n**Key Status Update**  \n- **Trading Status**: Delisted from Nasdaq on July 21, 2023, following completion of acquisition by Hancock Whitney Corporation (HWC). Shares were exchanged at a ratio of 0.696 HWC shares per LVLU share. No current trading; investors holding pre-merger should reference HWC (ticker: HWC) holdings.  \n- **Current Stock Price**: N/A (delisted). Last pre-delisting close: $27.50 on July 20, 2023 (Yahoo Finance/Nasdaq historical data).  \n- **Market Capitalization**: N/A (delisted). Pre-acquisition market cap: ~$425 million as of July 20, 2023.  \n- **Data Sources**: Verified via Yahoo Finance, Nasdaq, SEC filings (8-K dated July 21, 2023), company press releases, Seeking Alpha, and recent web searches (no discussions/articles post-July 2023; all point to merger completion). No earnings reports or transcripts within last 6 months (last Q2 2023 earnings released July 26, 2023, post-delisting announcement).  \n\n## Company Overview (Historical High-Level Summary)\nLevel One Bancorp, Inc. (LVLU) was a Michigan-based bank holding company headquartered in Farmington Hills, operating Level One Bank with 16 branches primarily in Southeast Michigan (e.g., Oakland, Macomb, Wayne counties). Founded in 2005, it focused on commercial banking for small- to medium-sized businesses (SMBs), professionals, and high-net-worth individuals. Core offerings included commercial real estate loans, business loans, industrial loans, lines of credit, treasury management, deposit accounts (checking/savings/CDs), and wealth management via a trust subsidiary.  \n\nThe bank emphasized relationship banking in the Detroit metro area, targeting niche markets like healthcare, manufacturing, real estate developers, and nonprofits. As of Q1 2023 (latest full SEC filing), assets totaled $3.1 billion, loans $2.5 billion (heavy in commercial real estate at ~50%), and deposits $2.6 billion. It operated in a competitive regional banking sector amid post-COVID loan growth but faced margin pressures from rising rates. LVLU pursued organic growth via branch expansion and digital enhancements pre-merger. The July 21, 2023, acquisition by Hancock Whitney (a Gulf Coast regional bank) integrated Level One into HWC's 177-branch network, expanding HWC's Midwest footprint. Post-merger, Level One's operations continue under HWC branding, with no standalone identity. This deal valued LVLU at ~$31/share (enterprise value ~$480 million), a 20% premium to pre-announcement price. (248 words)\n\n## Recent Developments\n- **July 3, 2023**: Merger agreement announced with Hancock Whitney; all-share deal approved by boards.  \n- **July 21, 2023**: Acquisition closed; LVLU delisted. Integration began, with Level One branches rebranded to Hancock Whitney by Q4 2023 (per HWC Q3 2023 earnings call).  \n- **No post-merger standalone news**: Searches (Google News, Seeking Alpha, Twitter/X, Reddit r/stocks, StockTwits) yield zero discussions since August 2023. HWC references Level One in filings as \"legacy\" operations contributing ~$3B assets.  \n- **Regulatory**: FDIC/FRB approvals granted June 2023; no antitrust issues.\n\n## Growth Strategy (Pre-Merger; Now Integrated into HWC)\n- Organic deposit/loan growth targeting 5-7% annually via SMB relationships and digital banking app upgrades (launched 2022).  \n- Selective branch expansion (added 2 branches in 2022).  \n- Fee income growth from wealth management/SBA lending. Post-merger, HWC strategy emphasizes cross-sell in Michigan markets.\n\n## Company and Sector Headwinds/Tailwinds\n| Category | Tailwinds | Headwinds |\n|----------|-----------|-----------|\n| **Company-Specific** | Strong local deposit base (cost of deposits <2% pre-merger); niche expertise in Michigan CRE/healthcare lending. Merger provides HWC scale (assets >$40B). | Integration risks (e.g., deposit outflows post-merger, per HWC Q3 2023 call: minor ~2% attrition). Legacy CRE exposure (~50% loans) vulnerable to office vacancies. |\n| **Sector (Regional Banks)** | Rate cuts expected 2024-2025 boosting net interest margins (NIM); M&A wave for scale. Michigan economy resilient (auto/manufacturing rebound). | High funding costs (post-2023 hikes); CRE distress (office sector defaults up 20% YOY per Trepp data); regulatory scrutiny (Basel III endgame). SVB fallout lingers. |\n\n## Existing Products/Services\n- Commercial loans (CRE, C&I, construction): 70% of portfolio.  \n- Retail deposits/wealth management.  \n- Treasury/cash management for SMBs. Now fully under HWC offerings.\n\n## New Products/Services/Projects\n- Pre-merger: Planned SBA lending expansion (2023 pilot).  \n- Post-merger: None standalone; HWC rolling out national payment platforms/digital wallets to ex-Level One customers (announced HWC Q1 2024 earnings).\n\n## Market Share Approximations\n- Pre-merger (Michigan commercial banking): ~1-2% in Southeast Michigan deposits (per FDIC data Q1 2023; total MI market $200B+ deposits). Top 10 in Oakland County.  \n- Post-merger: Absorbed into HWC (~0.1% national; boosted MI presence to ~3% Gulf/Midwest combined). No standalone tracking.\n\n## Forecast of Growth/Decline in Market Share\n- Standalone: N/A (defunct). Legacy ops expected flat-to-2% deposit growth under HWC (per HWC guidance Q2 2024). Sector tailwinds from M&A consolidation could stabilize share; CRE risks may cause 1-3% erosion if recession hits.\n\n## Comparison to Competitors\n| Metric (Pre-Merger Q1 2023) | LVLU | Peer Avg (MI Regionals: e.g., Flagstar/Flagstar equiv post-NYU, TCF pre-merger) | HWC (Post-Merger) |\n|-----------------------------|------|-------------------------------------------------------------|-------------------|\n| Assets | $3.1B | $5-10B | $42B |\n| NIM | 3.2% | 3.0-3.5% | 3.4% |\n| Efficiency Ratio | 65% | 60-70% | 55% |\n| CRE Loan % | 50% | 40% | 25% |\n\n- **Competitors**: Independent Bank (IBCP), Macatawa Bank (MCBC), Flagstar (now NYT), Huntington (HBAN). LVLU lagged in scale but excelled in deposit stability.\n\n## Partnerships, M&A\n- **Key M&A**: Acquired by HWC (July 2023; $480M deal). Previously acquired Meritage Mortgage (2019).  \n- **Partnerships**: Correspondent banking with larger nationals; no major fintech ties noted.\n\n## Current and Potential Major Clients\n- **Historical**: Michigan healthcare (e.g., hospitals), real estate devs, manufacturers (auto suppliers). Top 10 clients <15% concentration (10-K 2022).  \n- **Post-Merger**: Transitioned to HWC; potential for HWC's Gulf clients to expand into MI supply chains.\n\n## Other Qualitative Measures\n- **ESG**: Strong community focus (Michigan reinvestment); B- rating pre-merger (MSCI).  \n- **Management**: CEO JJ Kuberski praised for relationship focus; now HWC leadership.  \n- **Online Sentiment**: Minimal; Reddit/StockTwits chatter peaked May-July 2023 on merger arb (positive on premium).  \n\n## Investment Recommendation\n- **Buy Rating**: 1/10 (**Strong Sell / Avoid**). Delisted stock; no liquidity or upside. Investors exposed via HWC shares (current HWC price ~$48 as of Oct 2024; analyze separately for growth).  \n- **Estimated Fair Value**: N/A (delisted). Pre-merger intrinsic ~$28-30 based on 1.1x book/tangible value (historical regional bank multiple); merger realized full value. For growth portfolios (moderate risk), pivot to HWC (projected 8-10% EPS CAGR) or peers like FITB. No growth upside in LVLU entity.",
  "generated_date": "2026-01-09T02:58:59.428384",
  "model": "grok-4-1-fast-reasoning"
}