{
  "ticker": "NWS",
  "content": "**Report Generated:** January 24, 2026  \n**Next Refresh:** April 25, 2026\n\n**Disclaimer:** This sell-side report was generated using Claude Sonnet 4 (claude-sonnet-4-20250514). Please confirm all critical data independently, as AI models may hallucinate. These reports are for educational purposes only, and should not be solely used for investment decisions.\n\n---\n\n# News Corporation (NWS) - Comprehensive Analysis Report\n\n## 1. Company Overview\n\nNews Corporation is a media and information services company that creates and distributes authoritative and engaging content, and other products and services for consumers and businesses. It operates through five segments: Digital Real Estate Services, Dow Jones, Book Publishing, News Media, and Other. News Corporation was incorporated in 2012 and is headquartered in New York, New York.\n\nThe company has undergone significant strategic transformation under CEO Robert Thomson's leadership since 2013. Under Robert Thomson's leadership since 2013, the company has systematically shed legacy assets and rebuilt itself around three core pillars: Dow Jones's premium business information, Digital Real Estate Services anchored by REA Group and Realtor.com, and global Book Publishing through HarperCollins. Investors still view NWS through a newspaper lens, missing that 89% of profits now come from recurring, high-margin digital services with fundamentally different economics than print advertising.\n\nThe company has operations in the United States, Canada, Europe, Australasia, and internationally. News Corp's portfolio spans from world-renowned news sources to digital real estate ventures and major book publishing operations, positioning it as a diversified media conglomerate focused on premium content and digital services.\n\n## 2. Current Market Data\n\n**Stock Price:** Previous Close: 29.80, Open: 29.73, Day's Range: 29.73 - 30.12, 52 Week Range: 26.25 - 35.58, Market Cap (intraday): 16.684B, Beta (5Y Monthly): 0.97, PE Ratio (TTM): 36.05, EPS (TTM): 0.83\n\n**Current Trading:** The current price of NWS is 30.29 USD — it has decreased by −1.24% in the past 24 hours.\n\n**Dividend Information:** Forward Dividend & Yield 0.20 (0.67%) Ex-Dividend Date Sep 10, 2025\n\n**Market Capitalization:** Today News Corporation has the market capitalization of ‪17.24 B‬, it has increased by 1.07% over the last week.\n\n**Employee Count:** As of Jan 17, 2026, the company has ‪22.3 K‬ employees.\n\n## 3. Existing Products/Services\n\n### Digital Real Estate Services\nThis segment, encompassing entities like REA Group and Move (Realtor.com), primarily monetizes through listing fees, advertising, and lead generation services for real estate professionals. Ownership of Move is shared 80/20 between News Corp and REA Group, respectively.\n\n### Dow Jones\nThe company distributes content and data products through various media channels, such as newspapers, newswires, websites, mobile apps, newsletters, magazines, proprietary databases, live journalism, video, and podcasts under the MarketWatch, The Wall Street Journal, Barron's, Investor's Business Daily, Factiva, Dow Jones Risk & Compliance, Dow Jones Newswires, and Dow Jones Energy brands.\n\n### News Media\nIt also owns and operates Monday to Friday, Saturday and Sunday, weekly, and bi-weekly newspapers comprising The Australian, The Weekend Australian, The Daily Telegraph, The Sunday Telegraph, Herald Sun, Sunday Herald Sun, The Courier Mail, The Sunday Mail, The Advertiser, Sunday Mail, The Sun, The Sun on Sunday editions.\n\n### Book Publishing\nIn addition, the company publishes general fiction, nonfiction, children's, and religious books; and operates Storyful, a social media content agency, as well as sports radio network and news channels. The Book Publishing segment focuses on HarperCollins which publishes and distributes consumer books globally through print, digital, and audio formats.\n\n### Additional Services\nFurther, it offers property and property-related advertising and services on its websites and mobile applications; digital real estate services; and financial services.\n\n## 4. Planned Products/Services/Projects\n\n### AI Integration and Content Licensing\nNews Corp and OpenAI today announced a historic, multi-year agreement to bring News Corp news content to OpenAI. OpenAI and News Corp. on Wednesday announced a \"multi-year global partnership\" that will allow OpenAI to access current and archived articles from News Corp.'s outlets, including The Wall Street Journal, MarketWatch, Barron's, The New York Post and more.\n\nThe media group, which struck its first licensing deal (reportedly to the tune of $250 million spread over five years) with OpenAI in May 2024, is pursuing branching out — a logical move, since AI licensing deals tend to be non-exclusive by design. \"You have to do your deals where it's appropriate, whether it's in our case with OpenAI or with Google and possibly others,\" Carter said, having previously spoken about how it uses Google's LLM-powered research and notetaking tool NotebookLM.\n\n### Digital Real Estate Expansion\nThe company's DRES segment generated $406 million in Q4 2025 revenue, a 5% year-over-year increase, reflecting strong user engagement and pricing power. This momentum is further supported by the integration of AI and machine learning, which enhance data analytics and customer targeting.\n\n### Recent Acquisitions in Digital Real Estate\nThe division acquired EcoMovement in September 2025, a platform providing data on nearly 2 million EV charging connectors across more than 80 countries.\n\n## 5. Growth Strategy\n\n### Digital Transformation Focus\nA pivotal achievement was the successful digital transformation of its core news assets, most notably The Wall Street Journal, which has experienced substantial growth in its digital subscription base. This digital pivot has been complemented by the strategic expansion of its Digital Real Estate Services segment, with entities like REA Group and Realtor.com emerging as key growth drivers for the company.\n\n### Portfolio Streamlining\nPortfolio Streamlining: Recent strategic decisions, such as the sale of Foxtel Group to DAZN in April 2025, indicate a focus on refining its asset base and concentrating on core growth pillars.\n\nThe sale of Foxtel to DAZN marked a strategic move, eliminating $724 million of debt and securing a 6% equity stake in DAZN.\n\n### Three Core Pillars Strategy\nNews Corp's DRES segment achieved 9% revenue growth and 18% EBITDA surge in 2025, driven by subscription models and digital tools. With a 9% year-over-year revenue increase in fiscal 2025 and a 18% surge in EBITDA, the segment underscores the company's strategic pivot toward high-margin, subscription-driven models.\n\n### Share Buyback Acceleration\nNews Corporation accelerated its share buyback program in the quarter, now repurchasing shares at more than four times the pace of fiscal 2025, reflecting a focus on improving shareholder returns.\n\n## 6. Current and Potential Major Clients\n\n### Digital Real Estate Services\nThis segment, encompassing entities like REA Group and Move (Realtor.com), primarily monetizes through listing fees, advertising, and lead generation services for real estate professionals.\n\n### Dow Jones Professional Information Business\nDow Jones segment revenues increased 6% to $586 million for the quarter ended September 30, 2025, powered by professional information business growth that now represents a substantial portion of segment performance. Risk & Compliance revenues surged 16% to $94 million, driven by new customers, enhanced products, and improved yield from risk feeds and API solutions.\n\n### AI Content Partnerships\nThe startup will also be able to use News Corp.'s content \"to enhance its products,\" or, likely, to train its artificial intelligence models. News Corp. will also \"share journalistic expertise to help ensure the highest journalism standards are present across OpenAI's offering\" as part of the deal, according to a release.\n\nAt The Times Tech Summit in London on 21 October, Thomson confirmed that News Corp currently holds \"significant\" partnerships with OpenAI and Apple, alongside a broader collaboration with Google.\n\n## 7. Financial Data & Performance\n\n### Q1 FY2026 Results (Most Recent)\nRevenue rose 3 percent year-over-year to $2.58 billion, while our net income jumped 148 percent to $144 million. Total Segment EBITDA surged 14 percent to $415 million, and our EPS were 21 cents compared to 5 cents in same quarter last year.\n\nOverall revenue for the period rose 2 percent versus the prior year to $2.1 billion, net income from continuing operations was $150 million, up from $149 million last year, and Total Segment EBITDA increased by 5 percent to $340 million.\n\n### Fiscal Year 2024 Performance\nFor the fiscal year ending June 30, 2024, the company reported revenues of approximately $9.88 billion. How does a global media powerhouse like News Corporation sustain its influence and financial strength in today's rapidly evolving market?Reporting full fiscal year 2024 revenues of $9.88 billion, News Corporation showcases its significant market presence, bolstered by key segments like Dow Jones, which achieved record profitability and revenues of $2.3 billion, a 14% increase year-over-year, largely thanks to professional information business growth and strong digital advertising.\n\n### Key Financial Metrics\nNews Corp's valuation metrics have shown a mixed trend, with the P/E ratio improving slightly to 14.79x in Q1 2026, while EV/EBITDA rose to 11.97x, indicating increasing investor confidence. Profitability metrics are stable, with operating margins at 9.85%, reflecting consistent operational efficiency. However, the operating cash flow ratio has declined sharply to 0.76%, raising concerns about liquidity from core operations.\n\n### EBITDA Performance\nNews Corporation EBITDA is ‪1.43 B‬ USD, and current EBITDA margin is 16.85%.\n\n## 8. Headwinds & Tailwinds\n\n### Tailwinds\n\n**AI Content Licensing Opportunities**\n\"Information and sophisticated data are the essence of AI, and without these essential ingredients, AI is but empty, vacuous, ignorant infrastructure,\" Thomson stated during the earnings call. News Corp expects to announce additional AI content partnerships following agreements with OpenAI, which Thomson praised as \"principled pioneers in understanding the inherent intrinsic value of actual intelligence.\"\n\n**Digital Real Estate Market Growth**\nThe global real estate software market is projected to grow at a compound annual growth rate (CAGR) of 11.2% through 2029, expanding from $12.8 billion in 2025 to $19.58 billion by 2029. This growth is fueled by the adoption of AI-driven tools, cloud-based platforms, and automation, which streamline property management and enhance customer experiences.\n\n**Digital Subscription Growth**\nWhile print advertising has seen a decline, digital-only subscriptions for publications such as The Wall Street Journal have experienced consistent growth, surpassing 3.9 million subscribers by Q3 fiscal 2025.\n\nDow Jones digital revenues now represent 84% of that segment's total, while digital-only subscriptions for The Wall Street Journal climbed 11% year-on-year.\n\n### Headwinds\n\n**Declining Print Advertising**\nThe company has proactively addressed operational challenges, including the persistent decline in print advertising revenue and evolving consumer preferences that favor digital platforms. In response, News Corp has made aggressive investments in its digital infrastructure, cultivated digital subscription growth, and diversified its revenue streams to reduce reliance on volatile advertising markets.\n\n**Platform Dependency Changes**\nIndustry dynamics continue shifting as platforms like Google alter traditional referral relationships, making direct-to-consumer relationships and content licensing increasingly important for publishers. Google's advertising revenue distribution recently reached 90% concentration on owned properties versus publisher partnerships, with Network advertising declining 1% year-over-year to $7.4 billion during Q2 2025. This shift affects millions of websites dependent on Google's advertising ecosystem, making direct content licensing arrangements with AI companies increasingly important for publishers seeking sustainable revenue streams.\n\n**Legal Challenges**\nTrue to form, News Corp sued Perplexity in October 2024 for alleged \"massive illegal copying\" of content without permission or compensation to generate responses for its users, diverting traffic and revenue from News Corp's publications in the process. In August, a judge rejected Perplexity's bid to have the lawsuit dismissed. The case is ongoing.\n\n## 9. Market Shares\n\n### Digital Real Estate Services\nDRES outperformed industry benchmarks with a 13.21% net profit margin vs. -3.14% average, leveraging global platforms like realtor.com and REA Group.\n\nThe data shows Realtor.com achieved the highest visits per user in September, \"clearly outstripping Zillow (ZG) and other lesser sites,\" with almost 5 visits per unique user. The data shows Realtor.com achieved the highest visits per user in September, \"clearly outstripping Zillow (ZG) and other lesser sites,\" with almost 5 visits per unique user.\n\nFrom these beginnings, the company became Australia's top property platform, realestate.com.au, drawing 12.3 million unique visitors monthly as of March 2025. This platform alone sees 133.4 million average monthly visits, far ahead of rivals.\n\n### Market Position Transformation\nThe company's two strongest divisions—Dow Jones and Digital Real Estate Services—contributed 49% of revenue and 84% of EBITDA in fiscal 2025, up from 29% of revenue and 55% of EBITDA in fiscal 2018.\n\n### Revenue Mix Shift\nFiscal 2025 - News Corp achieves record profitability on continuing operations basis with digital revenues reaching 62% of total business\n\n## 10. Comparison to Competitors\n\n### Media Industry Context\nThere's been a lot of consolidation in the media industry in recent years, leaving just a few giant media companies that dominate the industry. There's been a lot of consolidation in the media industry in recent years, leaving just a few giant media companies that dominate the industry. The media landscape remains just as concentrated today, if not more.\n\nAs of 2025, the largest media conglomerates in terms of revenue are Comcast NBCUniversal, The Walt Disney Company, Warner Bros.\n\n### Competitive Positioning\nWhile peers like Gannett (GCI) struggle with 8.4% revenue declines and The New York Times (NYT) relies heavily on consumer subscriptions, NWS has built a diversified fortress. Dow Jones sells mission-critical compliance data to enterprises, REA Group commands dominant market share in Australian property, and HarperCollins controls valuable IP that AI companies must license or risk legal action. This positioning creates multiple ways to win while competitors face single-point failure risks.\n\n### Market Share in Global Context\nThe Media And Entertainment Market is expected to reach USD 3.04 trillion in 2025 and grow at a CAGR of 3.79% to reach USD 3.66 trillion by 2030. News Corporation, Comcast Corporation, Walt Disney Company, Warner Bros. are among the key players in this market.\n\n## 11. Partnerships, Mergers and Acquisitions\n\n### Major AI Partnerships\n**OpenAI Partnership (May 2024)**\nNews Corp and OpenAI today announced a historic, multi-year agreement to bring News Corp news content to OpenAI. OpenAI and News Corp. on Wednesday announced a \"multi-year global partnership\" that will allow OpenAI to access current and archived articles from News Corp.'s outlets, including The Wall Street Journal, MarketWatch, Barron's, The New York Post and more.\n\nThe media group, which struck its first licensing deal (reportedly to the tune of $250 million spread over five years) with OpenAI in May 2024, is pursuing branching out — a logical move, since AI licensing deals tend to be non-exclusive by design.\n\n### Strategic Divestitures\n**Foxtel Sale to DAZN (April 2025)**\nThe sale of Foxtel to DAZN marked a strategic move, eliminating $724 million of debt and securing a 6% equity stake in DAZN.\n\n### Recent Acquisitions\n**EcoMovement (September 2025)**\nThe division acquired EcoMovement in September 2025, a platform providing data on nearly 2 million EV charging connectors across more than 80 countries.\n\n**Historical Major Acquisitions**\nIn September 2014, News Corp agreed to purchase Move for $950 million, marking the former company's largest acquisition to date. In September 2014, News Corp agreed to purchase Move for $950 million, marking the former company's largest acquisition to date.\n\n## 12. Recent Developments\n\n### CEO Contract Extension (June 2025)\nNEW YORK--(BUSINESS WIRE)--News Corp (NASDAQ: NWS, NWSA; ASX: NWS; NWSLV) announced today the extension of Robert Thomson's contract, which will see him continue as Chief Executive through June 2030. In June 2025, the company announced it had extended the contract of its chief executive Robert Thomson to June 2030.\n\n### Family Trust Legal Battle (December 2024)\nOn December 9, 2024, The New York Times reported that the court had ruled against Rupert and Lachlan Murdoch, who, the probate commissioner wrote, had acted in bad faith when trying to change the trust.\n\n### Annual Shareholder Meeting (November 2024)\nNEW YORK--(BUSINESS WIRE)--News Corp (NASDAQ: NWS, NWSA; ASX: NWS; NWSLV) today announced that, at its Annual Meeting of Stockholders, stockholders overwhelmingly elected the company's full slate of Directors and voted with the Board's recommendations on all proposals, including convincingly defeating the non-binding proposal to adopt a recapitalization plan that would eliminate News Corp's dual-class capital structure. We are pleased stockholders once again convincingly supported the company and the Board of Directors on all matters.\n\n### Next Earnings Date\nNews Corporation is going to release the next earnings report on Feb 11, 2026. News Corp will release its next earnings report on Feb 11, 2026.\n\n## 13. AI Investment Rating & Fair Value Assessment\n\n### Investment Strengths\n1. **Successful Digital Transformation**: 89% of profits now come from recurring, high-margin digital services with fundamentally different economics than print advertising.\n\n2. **AI Monetization Leader**: The media group, which struck its first licensing deal (reportedly to the tune of $250 million spread over five years) with OpenAI in May 2024, positioning News Corp as a pioneer in AI content licensing.\n\n3. **Strong Market Positions**: Dominant positions in Australian digital real estate through REA Group and competitive positioning in US digital real estate through Realtor.com.\n\n4. **Financial Health Improvement**: By transferring $724 million of debt off the balance sheet, securing direct repayment of AUD 592 million in shareholder loans, and retaining a 6% equity stake in DAZN, NWS achieved three critical outcomes simultaneously.\n\n### Investment Risks\n1. **Operational Cash Flow Concerns**: However, the operating cash flow ratio has declined sharply to 0.76%, raising concerns about liquidity from core operations.\n\n2. **Platform Dependency**: Google's advertising revenue distribution recently reached 90% concentration on owned properties versus publisher partnerships, with Network advertising declining 1% year-over-year to $7.4 billion during Q2 2025. This shift affects millions of websites dependent on Google's advertising ecosystem.\n\n3. **Cyclical Real Estate Exposure**: The digital real estate segment is susceptible to housing market cycles and interest rate fluctuations.\n\n### Valuation Analysis\n**Current Trading Metrics:**\n- Current Price: ~$30.29\n- 52-week Range: $26.25 - $35.58\n- Market Cap: ~$17.24B\n- P/E Ratio (TTM): 36.05x\n- Forward P/E: ~14.79x (improving)\n\n**Analyst Consensus:** 1y Target Est: 29.00, though As of writing, NWS is trading below the average analyst price target of $39.\n\n### AI Investment Rating: 7.3/10\n\n**Rationale:**\n- Strong transformation to digital-first business model with 62% digital revenue mix\n- Leading position in AI content licensing with $250M OpenAI deal and expansion opportunities  \n- Dominant market positions in key segments (Australian real estate, premium business information)\n- Improved balance sheet following strategic divestitures\n- However, cash flow concerns and traditional media headwinds limit upside\n\n### Fair Value Estimate: $34.00\n\n**Methodology:**\n- Trading at discount to historical averages despite digital transformation success\n- AI content licensing represents new high-margin revenue stream with significant growth potential\n- Digital real estate segment positioned to benefit from PropTech trends and 11.2% CAGR market growth\n- Conservative estimate accounts for cyclical risks and operational cash flow challenges\n- Represents ~12% upside from current levels, appropriate for moderate risk appetite growth portfolio\n\nThe company represents a compelling transformation story with multiple growth drivers, though investors should monitor cash flow metrics and execution of digital strategy initiatives.",
  "generated_date": "2026-01-24T08:17:19.994526",
  "next_refresh_date": "2026-04-25T08:17:19.994526",
  "model": "claude-sonnet-4-20250514",
  "cost": 0.42609195,
  "tokens": {
    "input": 190,
    "output": 6528,
    "cache_creation": 70413,
    "cache_read": 211844
  },
  "tldr_summary": "News Corporation is a diversified media and information services company operating across digital real estate, business information, book publishing, and news media segments, with a strategic focus on digital transformation.\n\nKey highlights include a successful pivot to digital services, generating 89% of profits from high-margin digital platforms. The company has secured a landmark $250 million AI content licensing deal with OpenAI, demonstrating leadership in emerging tech monetization. Its Digital Real Estate Services segment, led by REA Group and Realtor.com, shows strong growth potential in the PropTech market, with a projected 11.2% CAGR through 2029. Strategic moves like selling Foxtel and focusing on three core pillars (Dow Jones, Digital Real Estate, Book Publishing) have streamlined operations and improved financial positioning.\n\nThe AI investment rating is 7.3/10, with a fair value estimate of $34.00, representing approximately 12% upside potential driven by digital transformation and emerging revenue streams."
}