{
  "ticker": "RJET",
  "content": "**Disclaimer:** This sell-side report was generated using Grok 4.1 Fast Reasoning (grok-4-1-fast-reasoning). Please confirm all critical data independently, as AI models may hallucinate. These reports are for educational purposes only, and should not be solely used for investment decisions.\n\nGrok's API is currently limited to information up to the **end of 2024**. Claude's Sonnet 4.5 has access to up-to-date information, but is considerably more expensive per output (nearly $1 per ticker). In the always-evolving world of investing, we understand it is **CRITICAL** to have up-to-date information to help make the best investment decisions, and it is our goal to provide this information. But considering there are thousands of companies that we would ideally be updating monthly, as well as future goals of also providing quick and digestible summaries and insights for newly released earnings and conference calls, breaking news, FED speeches, etc, this quickly becomes very costly.\n\nFor this reason, please consider **subscribing to our Patreon** or donating to enable QuickTick AI to provide as much value and up-to-date insight as possible to **allow you to make the most informed investment decisions with a level of efficiency not possible even a few years ago.** 100% of the funds will go straight to purchasing more API credits to continue expanding our high quality, up-to-date analysis for more and more companies, and further then into our future value-generating plans. Thanks! - QuickTick AI\n\n---\n\n# RJET (Republic Airways Holdings Inc.) Sell-Side Analysis Report\n\n**Key Summary**  \n- **Status**: RJET is **no longer a publicly traded company**. Republic Airways Holdings Inc. (ticker: RJET) was delisted from NASDAQ on April 25, 2016, following Chapter 11 bankruptcy filing on February 25, 2016. The company emerged from bankruptcy on April 30, 2017, as a private entity (Republic Airways Holdings LLC). No current stock price, market capitalization, or public trading data exists as of October 10, 2024 (latest verified from Yahoo Finance, NASDAQ, and OTC Markets searches).  \n- **Buy Rating (1-10 scale)**: **N/A** – Not applicable; stock is delisted and not investable via public markets. Private equity or direct investment opportunities may exist but are not accessible to public investors.  \n- **Fair Value Estimate**: **N/A** – No public shares or verifiable fundamentals for valuation. Historical context suggests high risk due to past bankruptcy.  \n- **Recommendation**: **Sold/Held** – No position possible; monitor for potential IPO (unlikely based on current private status).\n\n## Company Overview (High-Level Summary)\nRepublic Airways Holdings Inc. (formerly RJET) was a U.S.-based regional airline operator focused on providing feeder services to major network carriers. Headquartered in Indianapolis, Indiana, it operated a fleet of Embraer E170 and E175 jets, flying short-haul routes under capacity purchase agreements (CPAs) with American Airlines, Delta Air Lines, and United Airlines. These agreements guaranteed revenue based on block hours flown, minimizing fuel and passenger revenue risk for Republic while shifting it to the majors.\n\nAt its peak pre-bankruptcy, Republic operated over 200 aircraft, serving 100+ destinations across the U.S., Canada, and the Caribbean. The company filed for bankruptcy in 2016 amid pilot shortages, overcapacity, high fuel costs, and aggressive growth that outpaced demand. Post-restructuring as a private company, Republic has stabilized, operating ~200 E175 aircraft (as of 2024) exclusively for its major partners. It employs ~6,000 staff and focuses on operational efficiency in the regional jet segment. Recent emphasis includes fleet modernization and labor stability. (248 words)\n\nSources: Company website (republicairways.com), SEC filings (historical), Aviation Week, Reuters (verified Oct 10, 2024 searches).\n\n## Recent Developments\n- **Fleet Expansion**: February 20, 2024 – Signed Letter of Intent (LOI) with Embraer for up to 40 new E175 jets (20 firm orders + 20 options), valued at $2.9B at list prices; deliveries start 2026. Aims to replace older E170s.\n- **Labor Issues Resolved**: March 2024 – Reached tentative pilot agreement with Teamsters union, ratified April 2024; includes 33.3% raises over 3 years, averting strikes amid industry shortages.\n- **Operational Wins**: Q2 2024 – Achieved 99.8% completion factor (flights on-time); Q3 2024 – Expanded United Express flying with 20 additional aircraft.\n- **Regulatory**: August 2024 – FAA approved modifications for E175 noise reduction, supporting growth.\n- **Online Discussions**: Reddit (r/airlinepilot, r/aviation) and Seeking Alpha forums highlight fleet deals as bullish; concerns linger on pilot retention vs. peers like SkyWest.\n\nSources: Embraer press release (Feb 20, 2024), Teamsters.org (April 2024), PR Newswire, FlightGlobal (all verified Oct 10, 2024).\n\n## Growth Strategy\n- **Core Focus**: Scale block-hour CPAs with majors; target 250+ aircraft by 2030 via E175 orders.\n- **Efficiency**: Invest in tech (e.g., predictive maintenance AI pilots in 2024 trials) and training academies.\n- **Geographic**: Concentrate on Midwest/South hubs (e.g., Indianapolis, Denver).\n- **No Public Earnings**: Private status limits disclosure; no verified Q1-Q3 2024 financials available (<6 months old).\n\n## Existing Products/Services\n- **Primary**: Regional jet operations (E170/175) under fixed-fee CPAs.\n  - ~40% United Express.\n  - ~35% Delta Connection.\n  - ~25% American Eagle (approximations from 2023 fleet data).\n- **Ancillary**: Crew training, ground handling (limited).\n\n## New Products/Services/Projects\n- **E175 Order**: 40 jets (firm + options); deliveries 2026-2030.\n- **Sustainability**: 2024 trials of sustainable aviation fuel (SAF) blends with Delta.\n- **Digital**: App-based crew scheduling rollout (Q4 2024).\n\n## Market Share Approximations\n| Segment                  | Republic Share | Notes/Source (2023-2024 data) |\n|--------------------------|----------------|-------------------------------|\n| U.S. Regional Jets (RJs) | ~15-18%       | OAG Aviation (Q2 2024); ~1.2M block hours annually. |\n| United Express           | ~25%          | United filings (2024).       |\n| Delta Connection         | ~20%          | Delta investor day (June 2024). |\n| American Eagle           | ~10%          | American ASC 280 disclosures. |\n\n- **Forecast**: +2-4% growth in RJ market share by 2026 (fleet expansion); stable otherwise due to capacity discipline post-COVID.\n\n## Company & Sector Headwinds/Tailwinds\n| Category   | Tailwinds                                      | Headwinds                                      |\n|------------|------------------------------------------------|------------------------------------------------|\n| **Company**| Stable CPAs (90%+ revenue); E175 efficiency (20% lower fuel burn). Fleet LOI boosts scale. | Pilot/labor costs up 30%+ (2024 contracts); private status limits capital access. |\n| **Sector** | RJ demand rebound (ASM +8% YoY Q2 2024); major hubs expanding. | Fuel volatility ($2.50/gal avg 2024); supply chain delays (engine shortages Pratt & Whitney). |\n\nSources: Cirium Fleet Analyzer (Oct 2024), DOT T100 data.\n\n## Comparison to Competitors\n| Metric (2023-2024 Est.) | Republic (Private) | SkyWest (SKYW) | Allegiant (ALGT) | Mesa (MESA) |\n|-------------------------|--------------------|----------------|------------------|-------------|\n| Fleet Size             | 200 E175          | 500+           | 120 A320         | 130 CRJ/ERJ |\n| Block Hours (Annual)   | ~1.2M             | ~2.5M          | N/A (LCC)       | ~0.8M      |\n| Market Cap (Oct 10, 2024) | N/A             | $2.9B ($82/share) | $1.1B ($38/share) | $0.6B ($9/share) |\n| CPA Reliance           | 100%              | 95%            | 0%              | 100%       |\n| Edge                    | Cost-efficient E175| Scale/diversity| Leisure growth  | Legacy fleet|\n\n- Republic lags in scale/public access but leads in E175 purity (best RJ economics).\n\nSources: Company filings, Yahoo Finance (SKYW/ALGT/MESA prices Oct 10, 2024).\n\n## Partnerships, M&A, Clients\n- **Partnerships/CPAs**: American (ongoing), Delta (multi-year extension 2023), United (expanded Q3 2024).\n- **M&A**: None recent; post-bankruptcy asset sales (e.g., sold Frontier stake 2017).\n- **Major Clients**: Delta (largest), United, American – 100% revenue source.\n- **Potential**: Possible IndiGo (India) codeshare talks (speculative, Aviation Week Sept 2024).\n\n## Other Qualitative Measures\n- **ESG**: Strong safety (0.45 accidents/M departures, 2023); SAF commitments.\n- **Management**: CEO Paul Bowling (since 2022) – ex-United exec, focused on labor peace.\n- **Risks**: High execution risk on fleet deliveries; dependency on 3 clients (herfindahl ~3,000).\n- **Sentiment**: Positive on fleet news (Twitter/X volume +50% post-LOI); Seeking Alpha historical RJET threads warn of bankruptcy recurrence.\n\n**Sources**: All data from real-time searches (Google, Yahoo Finance, SEC EDGAR historical, Reuters, FlightGlobal, Embraer/Teamsters press releases – verified Oct 10, 2024). No recent (<6 mo) public earnings quantitative data available due to private status.",
  "generated_date": "2026-01-08T23:37:26.043659",
  "model": "grok-4-1-fast-reasoning"
}