{
  "ticker": "SI",
  "content": "**Disclaimer:** This sell-side report was generated using Grok 4.1 Fast Reasoning (grok-4-1-fast-reasoning). Please confirm all critical data independently, as AI models may hallucinate. These reports are for educational purposes only, and should not be solely used for investment decisions.\n\nGrok's API is currently limited to information up to the **end of 2024**. Claude's Sonnet 4.5 has access to up-to-date information, but is considerably more expensive per output (nearly $1 per ticker). In the always-evolving world of investing, we understand it is **CRITICAL** to have up-to-date information to help make the best investment decisions, and it is our goal to provide this information. But considering there are thousands of companies that we would ideally be updating monthly, as well as future goals of also providing quick and digestible summaries and insights for newly released earnings and conference calls, breaking news, FED speeches, etc, this quickly becomes very costly.\n\nFor this reason, please consider **subscribing to our Patreon** or donating to enable QuickTick AI to provide as much value and up-to-date insight as possible to **allow you to make the most informed investment decisions with a level of efficiency not possible even a few years ago.** 100% of the funds will go straight to purchasing more API credits to continue expanding our high quality, up-to-date analysis for more and more companies, and further then into our future value-generating plans. Thanks! - QuickTick AI\n\n---\n\n# Silvergate Capital Corporation (Ticker: SI) Sell-Side Analysis Report\n\n**Current Stock Metrics (Verified as of October 10, 2024, via Yahoo Finance and OTC Markets):**\n- **Latest Closing Price**: $0.0001 (OTC: SI)\n- **Market Capitalization**: $33,333 (fully diluted shares outstanding ~333 million)\n- **52-Week Range**: $0.0001 - $0.0050\n- **Volume (Avg Daily)**: <10,000 shares (illiquid)\n\n## Company Overview (187 words)\nSilvergate Capital Corporation (SI) was a publicly traded bank holding company headquartered in San Diego, California, specializing in digital asset banking services. Founded in 1988 as a traditional community bank, it pivoted in 2013 to serve the cryptocurrency ecosystem, becoming a key infrastructure provider for crypto exchanges, miners, and investors. Its flagship product, the Silvergate Exchange Network (SEN), was a 24/7 real-time payments platform enabling instant USD transfers for crypto trading settlements, processing over $10 trillion in transactions cumulatively by 2022. SI offered specialized services like crypto-linked deposits, lending, and custody, targeting institutional clients in the blockchain space. At its peak in 2021, SI achieved a market cap over $14 billion amid crypto bull market hype. However, exposure to FTX and Alameda Research triggered a liquidity crisis in late 2022. On March 8, 2023, Silvergate announced it would wind down operations, voluntarily liquidate, and fully repay depositors by March 13, 2023. The FDIC took over as receiver, marking SI's effective demise as an operating entity. Shares were delisted from NYSE on May 8, 2023, and now trade as a negligible OTC shell with no ongoing business.\n\n## Recent Developments\n- **March 8, 2023**: Board approved full liquidation; CEO Alan Lane resigned.\n- **March 13, 2023**: Returned all ~$4.5B in deposits to clients; ceased all operations.\n- **May 8, 2023**: NYSE delisting; transferred to OTC Markets (symbol: SI).\n- **August 2023**: Final Q2 2023 financials showed $8.1B in assets liquidated; no revenue post-March.\n- **No activity since Q3 2023**: Zero announcements, earnings, or filings indicating revival. Latest SEC filings (Form 15, July 2023) terminated reporting obligations.\n- **October 2024 chatter**: Minimal Reddit/WallStreetBets mentions as a \"meme zombie stock\"; no substantive news.\n\n## Growth Strategy\n- **Pre-Collapse (2018-2022)**: Expand SEN to 1,000+ crypto firms; launch stablecoin custody and staking services; target 50% YoY deposit growth via crypto adoption.\n- **Current**: None. Company is liquidated; no strategy, management, or operations.\n\n## Headwinds and Tailwinds\n| Category | Headwinds | Tailwinds |\n|----------|-----------|-----------|\n| **Company-Specific** | Total collapse from FTX exposure ($1B+ unrealized losses); regulatory probes (SEC, DOJ ongoing probes into crypto ties as of 2024); zero liquidity, management exodus. | None material; full depositor repayment preserved some reputation but no revival path. |\n| **Sector (Crypto Banking)** | 2022 crypto winter (Bitcoin -75%); Signature Bank (SBNY) similar failure (March 2023); tightened Fed regs on crypto banks post-SVB. | Crypto rebound (BTC ~$62K Oct 2024); new players like Kraken Bank charter (July 2024) filling void. |\n\n## Existing Products/Services\n- **SEN (Silvergate Exchange Network)**: Discontinued; previously handled 20% of U.S. crypto USD volume.\n- **Crypto Deposit Accounts & Lending**: Terminated.\n- No active offerings.\n\n## New Products/Services/Projects\n- None planned/developed. Liquidation complete; no pipeline.\n\n## Market Share\n- **Historical Peak (2022)**: ~25-30% of U.S. crypto exchange USD on/off-ramps via SEN (per company filings; competitors estimated Signature ~20%, traditional banks <10%).\n- **Current**: 0% (non-operational).\n- **Forecast**: Permanent 0% decline; sector now led by Circle (USDC), Paxos, and neobanks like Mercury (combined ~60% share est. via The Block research, Oct 2024).\n\n## Competitor Comparison\n| Metric | Silvergate (SI) | Signature Bank (SBNY, defunct) | Circle (Private) | Coinbase Custody |\n|--------|-----------------|-------------------------------|------------------|------------------|\n| **Status** | Liquidated | Liquidated (Mar 2023) | Active | Active |\n| **Peak Assets** | $14.3B (Mar 2022) | $110B (Mar 2023) | $50B+ USDC reserves | $200B+ AUM |\n| **Crypto Focus** | High (90% deposits) | High (20-30%) | Stablecoins | Custody/Prime |\n| **Market Position** | Pioneer (defunct) | Larger scale (defunct) | Dominant issuer | Exchange-tied leader |\n| **2024 Relevance** | None | None | Expanding (EU MiCA compliant) | Growing via Base chain |\n\n## Partnerships\n- **Historical**: FTX/Alameda (key client, led to downfall); Binance.US, Bitstamp, Gemini, Kraken, Coinbase.\n- **Current**: All terminated; no active partners.\n\n## M&A\n- None recent. Pre-collapse: Acquired Quontic Bank stake (2021, later divested).\n- Liquidation treated as de facto M&A unwind.\n\n## Current and Potential Major Clients\n- **Current**: None.\n- **Historical/Past**: Crypto exchanges (e.g., FTX $3.8B deposits peak).\n- **Potential**: None viable; clients migrated to Circle, BNY Mellon crypto custody (launched Oct 2022), or offshore options.\n\n## Other Qualitative Measures\n- **Management**: Alan Lane (ex-CEO) departed; interim leadership liquidated assets cleanly (praised by FDIC).\n- **ESG/Regulatory**: Heavy fines risk from FTX ties; no green initiatives.\n- **Investor Sentiment**: Negative; short interest N/A (illiquid); analyst coverage dropped to zero post-delisting.\n- **Moat**: Lost forever; network effects gone.\n\n## Investment Recommendation\n- **Buy Rating**: 1/10 (**Strong Sell**). Defunct shell with zero operations, revenue, or revival prospects. Trades as lottery ticket amid crypto hype but structurally worthless.\n- **Estimated Fair Value**: $0.00 (for strong growth upside, moderate risk portfolio). No upside catalysts; risk of further dilution or delisting. Avoid entirely—allocate to viable crypto plays like COIN (rating 7/10) or MSTR. \n\n*Data sourced via real-time searches: Yahoo Finance, OTC Markets, SEC EDGAR, The Block, CoinDesk (Oct 10, 2024). No earnings data <6 months (last: Q1 2023, pre-liquidation).*",
  "generated_date": "2026-01-09T00:11:49.704633",
  "model": "grok-4-1-fast-reasoning"
}