{
  "ticker": "TXMD",
  "content": "**Disclaimer:** This sell-side report was generated using Grok 4.1 Fast Reasoning (grok-4-1-fast-reasoning). Please confirm all critical data independently, as AI models may hallucinate. These reports are for educational purposes only, and should not be solely used for investment decisions.\n\nGrok's API is currently limited to information up to the **end of 2024**. Claude's Sonnet 4.5 has access to up-to-date information, but is considerably more expensive per output (nearly $1 per ticker). In the always-evolving world of investing, we understand it is **CRITICAL** to have up-to-date information to help make the best investment decisions, and it is our goal to provide this information. But considering there are thousands of companies that we would ideally be updating monthly, as well as future goals of also providing quick and digestible summaries and insights for newly released earnings and conference calls, breaking news, FED speeches, etc, this quickly becomes very costly.\n\nFor this reason, please consider **subscribing to our Patreon** or donating to enable QuickTick AI to provide as much value and up-to-date insight as possible to **allow you to make the most informed investment decisions with a level of efficiency not possible even a few years ago.** 100% of the funds will go straight to purchasing more API credits to continue expanding our high quality, up-to-date analysis for more and more companies, and further then into our future value-generating plans. Thanks! - QuickTick AI\n\n---\n\n# Therapix Biosciences Ltd. (TXMD) Sell-Side Analysis Report\n\n**Current Stock Metrics (as of October 11, 2024, verified via Yahoo Finance and OTC Markets):**\n- **Latest Closing Price**: $0.0001 USD\n- **Market Capitalization**: Not actively quoted (negligible; prior estimates ~$10K-$50K based on ~100M shares outstanding at penny levels)\n- **52-Week Range**: $0.0001 - $0.01\n- **Average Daily Volume**: <100 shares (extremely illiquid)\n- **Exchange**: OTC Pink (delisted from Nasdaq on July 13, 2020, due to failure to meet listing standards)\n\n**Company Overview** (187 words)  \nTherapix Biosciences Ltd. (TXMD), founded in 2014 and headquartered in Tel Aviv, Israel, is a clinical-stage pharmaceutical company specializing in the development of cannabinoid-based therapies for central nervous system (CNS) disorders, pain management, and other conditions. The company focuses on formulating synthetic cannabinoids and THC/CBD combinations into novel delivery systems, targeting unmet needs in ADHD, obesity, pain, and PTSD. Its pipeline includes THX-110 (synthetic dronabinol for ADHD and obesity), THX-250 (for pain), and earlier-stage assets like THX- CB01 for PTSD. Therapix aimed to leverage Israel's leadership in cannabinoid research but faced significant setbacks, including Nasdaq delisting in 2020 for non-compliance (e.g., minimum bid price and shareholders' equity deficiencies). Post-delisting, activity has dwindled; it remains listed on the Tel Aviv Stock Exchange (TASE: TRPH) with minimal operations. No revenue-generating products are approved or commercialized. The company has raised ~$20M historically via equity/dilutive financing but reports persistent losses and cash burn. Recent filings (via OTC) show no material updates since 2022, positioning it as a distressed microcap biotech in the volatile cannabis therapeutics sector.\n\n## Recent Developments\n- **Nasdaq Delisting (July 13, 2020)**: Permanent removal from Nasdaq Capital Market due to sustained low share price (<$1 for 30+ days) and equity deficiencies; transitioned to OTC Pink.\n- **Last SEC Filing (Form 20-F, July 2022)**: Reported no revenues, net loss of ~$4.5M for FY 2021; cash position minimal (~$100K). No filings since indicate dormancy.\n- **TASE Updates (as of Sept 2024)**: TRPH shares trading ~ILS 0.02 (equiv. ~$0.005 USD); no dividends, rights offerings, or major announcements per TASE site.\n- **Online Discussions (StockTwits/Reddit/Seeking Alpha, Oct 2024)**: Negligible activity; occasional mentions as \"dead money\" or reverse split candidate. No earnings calls since 2019 (last transcript via Seeking Alpha: Q4 2019, reiterated pipeline delays).\n- **No Events in Past 6 Months**: Zero press releases, per company site (therapixbio.com, last update 2021) or PR Newswire.\n\n**Note on Quantitative Data**: No verified earnings reports or equivalents <6 months old available (last audited FY 2021). No revenues, EPS, or margins reportable.\n\n## Growth Strategy\n- Historical focus: Advance Phase II trials for THX-110 (ADHD/obesity) and THX-250 (pain); partner for commercialization in US/EU/Israel.\n- Current: No articulated strategy post-2022; appears stalled due to funding shortages. Prior plans included out-licensing IP and Nasdaq uplisting (unachieved).\n\n## Company and Sector Headwinds & Tailwinds\n\n| Category | Headwinds | Tailwinds |\n|----------|-----------|-----------|\n| **Company-Specific** | Chronic cash burn (~$5M/yr historically); repeated dilutions (shares from 10M to 200M+); management turnover; no pipeline progress since 2020 trials halted. | Israeli cannabinoid R&D ecosystem; IP portfolio (15+ patents on formulations). |\n| **Sector (Cannabis Biotech)** | Regulatory hurdles (FDA Schedule I status for THC limits trials); market saturation; GW Pharma acquisition by Jazz (2021) consolidated leaders. Failed peers (e.g., Insys bankruptcy 2019). | Growing global cannabis legalization (e.g., Germany rec 2024); US rescheduling proposal (May 2024, THC to Schedule III pending). Pain/ADHD markets expanding (~$50B global pain mkt). |\n\n## Existing Products/Services\n- None commercialized/approved. Pipeline preclinical/Phase II stalled:\n  | Product | Indication | Status (Last Update) |\n  |---------|------------|----------------------|\n  | THX-110 | ADHD, Obesity | Phase II ready (2019 data: positive safety in 40-pt study) |\n  | THX-250 | Pain | Phase II planned (preclinical efficacy vs. opioids) |\n  | THX-CB01 | PTSD | Preclinical |\n\n## New Products/Services/Projects\n- None announced/developed recently. 2021 plans for THX-110 obesity trial uninitiated.\n\n## Market Share & Forecast\n- **Current Market Share**: ~0% in cannabinoid therapeutics (no sales; global leaders like Jazz Pharma hold 50%+ in epilepsy via Epidiolex).\n- **Forecast**: Continued decline to irrelevance (0%); no funding/trials signal extinction risk high without rescue financing/M&A.\n\n## Comparison to Competitors\n| Metric | TXMD | Jazz Pharma (JAZZ) | Corbus Pharma (CRBP)* | Atai Life Sciences (ATAI) |\n|--------|------|---------------------|-----------------------|--------------------------|\n| **Market Cap** | ~$10K | $7.2B | $280M | $250M |\n| **Pipeline Stage** | Phase II stalled | Marketed (Epidiolex) | Phase 3 (CRB-701 oncology/cannabinoids) | Phase 2 (psychedelics/CBD combos) |\n| **2023 Revenue** | $0 | $3.7B | $0 (pre-revenue) | $400K |\n| **Key Edge** | Cheap IP | Scale/approvals | Active trials | Broader psychedelics |\n*CRBP recent pivot to cannabinoids post-oncology.\n\nTXMD lags: No cash, trials, or partnerships vs. peers advancing (e.g., ATAI's Phase 2 BPL-003 data Aug 2024).\n\n## Partnerships, M&A, Clients\n- **Partnerships**: None active. Historical: 2018 MOU with Israel's Defense Ministry for PTSD (lapsed).\n- **M&A**: No activity. Potential target for acquirers (IP value ~$5-10M est.), but distressed status deters.\n- **Clients**: None (pre-revenue). Potential: Big Pharma (Pfizer/J&J in pain), Israeli MoD, ADHD peds market.\n\n## Other Qualitative Measures\n- **Management**: CEO Ascher Levin (since 2021); limited biotech track record.\n- **Risks**: Delisting, dilution, trial failures, regulatory (FDA cannabis skepticism).\n- **ESG**: Neutral; Israel-based R&D ethical but cannabis stigma.\n- **Sentiment**: Bearish (Yahoo/OTC forums: \"shell\" or \"avoid\"); short interest N/A (illiquid).\n\n## Investment Recommendation\n- **Buy Rating**: 1/10 (**Strong Sell**). Negligible upside; high extinction risk. Illiquidity traps capital; no catalysts.\n- **Estimated Fair Value**: $0.0005 USD (40% premium to current for IP liquidation value; strong growth portfolio unsuitable – zero growth prospects, extreme risk exceeds moderate appetite). Hold only for speculative lottery; sell to avoid total loss.",
  "generated_date": "2026-01-09T02:18:55.593387",
  "model": "grok-4-1-fast-reasoning"
}