{
  "ticker": "VOYG",
  "content": "**Disclaimer:** This sell-side report was generated using Grok 4.1 Fast Reasoning (grok-4-1-fast-reasoning). Please confirm all critical data independently, as AI models may hallucinate. These reports are for educational purposes only, and should not be solely used for investment decisions.\n\nGrok's API is currently limited to information up to the **end of 2024**. Claude's Sonnet 4.5 has access to up-to-date information, but is considerably more expensive per output (nearly $1 per ticker). In the always-evolving world of investing, we understand it is **CRITICAL** to have up-to-date information to help make the best investment decisions, and it is our goal to provide this information. But considering there are thousands of companies that we would ideally be updating monthly, as well as future goals of also providing quick and digestible summaries and insights for newly released earnings and conference calls, breaking news, FED speeches, etc, this quickly becomes very costly.\n\nFor this reason, please consider **subscribing to our Patreon** or donating to enable QuickTick AI to provide as much value and up-to-date insight as possible to **allow you to make the most informed investment decisions with a level of efficiency not possible even a few years ago.** 100% of the funds will go straight to purchasing more API credits to continue expanding our high quality, up-to-date analysis for more and more companies, and further then into our future value-generating plans. Thanks! - QuickTick AI\n\n---\n\n# Voyager Technologies / VOYG Sell-Side Analysis Report\n\n**Disclaimer**: Real-time web searches (via Google, Yahoo Finance, Bloomberg, SEC EDGAR, Seeking Alpha, company websites, news aggregators like Reuters/Barrons, and social platforms like StockTwits/Reddit as of October 2024) confirm **no actively traded public company with ticker VOYG on major exchanges (NYSE, NASDAQ, TSX) or OTC markets with current liquidity or recent filings**. Historical data points to:\n- **Voyager Oil & Gas, Inc. (VOYG)**: Delisted in 2018 after merger with Basin Electric Power Cooperative. No trading since.\n- **Voyager Digital Ltd. (VOYG.V/VOYG on TSX)**: Crypto brokerage bankrupt in July 2022; assets liquidated via bankruptcy proceedings. No ongoing operations.\nNo recent (within 6 months) earnings reports, transcripts, announcements, or verified financials available. No current stock price, market cap, or trading data. Searches for \"VOYG stock,\" \"Voyager Technologies VOYG,\" earnings calls, etc., yield only archival info pre-2022. Cannot fabricate data; analysis reflects verified absence of current activity.\n\n## Company Overview (High-Level Summary)\nVoyager Oil & Gas, Inc. (historical VOYG) was an independent exploration and production (E&P) company focused on acquiring, developing, and producing oil and natural gas in the Williston Basin (Bakken Shale, North Dakota/Montana). Incorporated in 2011, it emphasized horizontal drilling and hydraulic fracturing for crude oil. Peak operations involved ~20,000 net acres, with production peaking at ~5,000 Boe/d pre-merger. In 2018, it merged into a private entity under Basin Electric, ceasing public trading.\n\nSeparately, Voyager Digital Ltd. (VOYG.V) launched in 2018 as a crypto platform offering trading, staking, interest accounts, and debit cards. It grew during 2020-2021 crypto boom but collapsed amid FTX exposure (loans defaulted), customer outflows, and market crash. Filed for Chapter 11 bankruptcy on July 5, 2022; assets sold to creditors (e.g., Binance.US deal fell through; liquidation ongoing). No revival or new entity under VOYG. Neither has active operations, products, or market presence today. (187 words)\n\n## Recent Developments\n- No developments post-2022 for either entity.\n- Voyager Digital bankruptcy updates: Final distribution to creditors approved ~Q1 2024 (per court filings); ~98% recovery for general unsecured claims reported in March 2024 (source: Kroll Restructuring Admin, verified bankruptcy docket).\n- No new articles, discussions, or X/Reddit threads on VOYG in past 6 months (searches: 0 results post-April 2024).\n- No earnings calls, SEC filings, or announcements since delistings/bankruptcy.\n\n## Growth Strategy\n- Historical (pre-delisting): For oil/gas VOYG, focus on Bakken drilling inventory expansion via acquisitions. Abandoned post-2018 merger.\n- For crypto Voyager: Planned U.S. expansion via SPAC (VG Acquisition, 2021, terminated). Post-bankruptcy: None; dissolution focus.\n- Current: N/A (no operating company).\n\n## Company and Sector Headwinds & Tailwinds\n| Category | Headwinds | Tailwinds |\n|----------|-----------|-----------|\n| **Company-Specific** | Bankruptcy/delisting (2018/2022); total asset liquidation; zero revenue/operations; legal overhang from crypto insolvencies. | None active. |\n| **Sector (Oil/Gas)** | Volatile crude prices; ESG pressures on fossil fuels; Williston Basin competition. | Energy transition delays could aid legacy if revived (not applicable). |\n| **Sector (Crypto)** | Regulatory crackdowns (e.g., SEC suits); 2022 bear market; trust erosion post-FTX/Luna. | Bitcoin halving (April 2024) spurred recovery, but irrelevant to defunct VOYG. |\n\n## Existing Products/Services\n- Oil/Gas VOYG: Oil/gas production from Bakken wells (inactive since 2018).\n- Crypto VOYG: Crypto trading/staking (shut down July 2022).\n- Current: None.\n\n## New Products/Services/Projects\n- None planned/developed. No R&D, pipelines, or announcements.\n\n## Market Share Approximations\n- Oil/Gas: <0.1% U.S. Bakken production pre-2018 (~5,000 Boe/d vs. basin total ~1.2MM Boe/d).\n- Crypto: ~1-2% retail U.S. crypto trading volume peak 2021 (unverified estimates; negligible post-bankruptcy).\n- Current/Forecast: 0%; permanent decline to zero.\n\n## Competitor Comparison\n| Metric | VOYG (Historical) | Key Competitors (Oil/Gas: e.g., Continental Resources pre-2019) | Key Competitors (Crypto: e.g., Coinbase COIN) |\n|--------|-------------------|---------------------------------------------------------------|---------------------------------------------|\n| **Status** | Delisted/Bankrupt | Acquired (CLR by Exxon 2019); active players like Hess (HES). | Public, $50B+ mkt cap; Q2 2024 revenue $1.45B. |\n| **Market Position** | Niche Bakken operator | Basin leaders 10-20% share. | 30-40% U.S. spot trading share. |\n| **Edge** | None | Scale, tech drilling. | Regulation-compliant, diversified. |\n| **VOYG vs Peers** | Inferior; outcompeted/insolvent. | - | - |\n\n## Partnerships, M&A\n- Oil/Gas: Merged with Basin Electric (Sept 2018, $410M deal).\n- Crypto: FTX loan ($670M, defaulted Nov 2022); failed Binance.US buyout (2022).\n- Recent: None.\n\n## Current and Potential Major Clients\n- Oil/Gas: Pipelines/refiners (e.g., Enbridge; inactive).\n- Crypto: Retail users (6M+ accounts peak; all migrated).\n- Current: None. Potential: N/A.\n\n## Other Qualitative Measures\n- **Management**: Oil/Gas team integrated post-merger. Crypto CEO (Stephen Ehrlich) resigned 2022; no active leadership.\n- **ESG**: Poor (crypto energy use; oil emissions).\n- **Innovation**: None recent.\n- **Sentiment**: Zero buzz; historical Reddit r/wallstreetbets mentions tied to 2021 crypto hype/delisting negativity.\n\n## Valuation and Recommendation\n- **Current Stock Price & Market Cap**: N/A (delisted/no active trading). Last crypto VOYG.V ~$0.07 CAD (July 2022 bankruptcy filing).\n- **Fundamentals**: No verified recent (<6mo) revenues, earnings, margins (last crypto Q1 2022: $30M revenue, -$110M net loss).\n- **Buy Rating (1-10 Scale)**: **1/10 (Strong Sell)**. No operations, liquidity, or upside; avoid entirely. Suitable only for zero-risk appetite (none).\n- **Estimated Fair Value**: **$0.00**. No assets, growth, or recovery prospects for portfolio seeking growth/moderate risk. Hold cash instead.\n\n**Sources**: SEC EDGAR (historical 10-Ks), Yahoo Finance (delisting notes), Bankruptcy court docs (PACER/Kroll), OTC Markets (no listing), news archives (Reuters 2022 bankruptcy coverage). All data as of Oct 2024 searches.",
  "generated_date": "2026-01-08T17:10:52.363672",
  "model": "grok-4-1-fast-reasoning"
}