{
  "ticker": "WOW",
  "content": "**Disclaimer:** This sell-side report was generated using Grok 4.1 Fast Reasoning (grok-4-1-fast-reasoning). Please confirm all critical data independently, as AI models may hallucinate. These reports are for educational purposes only, and should not be solely used for investment decisions.\n\nGrok's API is currently limited to information up to the **end of 2024**. Claude's Sonnet 4.5 has access to up-to-date information, but is considerably more expensive per output (nearly $1 per ticker). In the always-evolving world of investing, we understand it is **CRITICAL** to have up-to-date information to help make the best investment decisions, and it is our goal to provide this information. But considering there are thousands of companies that we would ideally be updating monthly, as well as future goals of also providing quick and digestible summaries and insights for newly released earnings and conference calls, breaking news, FED speeches, etc, this quickly becomes very costly.\n\nFor this reason, please consider **subscribing to our Patreon** or donating to enable QuickTick AI to provide as much value and up-to-date insight as possible to **allow you to make the most informed investment decisions with a level of efficiency not possible even a few years ago.** 100% of the funds will go straight to purchasing more API credits to continue expanding our high quality, up-to-date analysis for more and more companies, and further then into our future value-generating plans. Thanks! - QuickTick AI\n\n---\n\n# WideOpenWest, Inc. (NYSE: WOW) Sell-Side Analysis Report\n\n**Current Stock Metrics (as of October 11, 2024, close; verified via Yahoo Finance and NYSE):**\n- Stock Price: $4.22\n- Market Capitalization: $286.4 million\n- 52-Week Range: $2.49 - $9.82\n- Avg. Daily Volume: ~1.2 million shares\n\n## Company Overview (187 words)\nWideOpenWest, Inc. (WOW!), founded in 1996 and headquartered in Englewood, Colorado, is a leading provider of high-speed internet, cable television, and phone services primarily in secondary and tertiary markets across the Midwest, Southeast, and Mid-Atlantic U.S. Operating in 18 markets spanning Illinois, Indiana, Maryland, Michigan, Ohio, and South Carolina, WOW! serves approximately 789,000 residential customers and 17,000 commercial customers as of Q2 2024. The company focuses on delivering competitive broadband speeds (up to 1.2 Gbps download via hybrid fiber-coaxial network) at value pricing, targeting underserved areas where it competes against larger incumbents like Comcast and Charter. WOW! generates ~73% of revenue from broadband, with video and voice as declining segments amid cord-cutting trends. Post a major deleveraging in 2024, WOW! operates with significantly reduced debt ($1.1B long-term as of Q2 2024, down from $2.9B pre-restructuring), enabling capex for network upgrades. However, subscriber losses and competitive pressures have challenged growth, positioning WOW! as a regional consolidator in a consolidating cable sector.\n\n## Recent Developments\n- **August 1, 2024**: Q2 2024 earnings release (verified SEC 8-K). Total revenue $417.5 million (down 3.5% YoY); broadband revenue $302.4 million (up 2.1% YoY, 249K customers); video revenue $67.5 million (down 13.8% YoY); net loss $85.1 million. Q3 2024 guidance: revenue $400-410 million (decline implied).\n- **June 13, 2024**: Completed comprehensive debt restructuring via RUPSA (Restructuring and Upside Participation Securities Agreement) with Apollo Global Management funds, reducing total debt by ~$1.8 billion (from $2.9B to $1.1B) and eliminating $900M in annual cash interest. Added $225M new financing.\n- **May 13, 2024**: Announced deleveraging transaction; stock surged 30% intraday on news.\n- **July 2024**: Board refresh; new directors from Apollo added.\n- **September 2024 online discussions (Reddit r/stocks, Seeking Alpha, Twitter/X)**: Mixed sentiment—praise for debt cut but concerns over 10%+ YoY broadband losses and weak guidance. Analyst downgrades from BofA (Underperform, $4 PT) citing churn.\n\n## Growth Strategy\n- Aggressive fiber-to-the-home (FTTH) expansion: Targeting 30-50% of footprint by 2026 via $100M+ annual capex (Q2 capex $67M).\n- Customer acquisition via promotional pricing and bundling (e.g., \"Internet Assist\" low-income plans).\n- Commercial segment growth: +5% YoY SMB customers in Q2 2024.\n- M&A opportunistic: CEO Therese Koppel emphasized \"tuck-in\" acquisitions in secondary markets (earnings call transcript, Aug 1).\n\n## Headwinds and Tailwinds\n\n| Category | Headwinds | Tailwinds |\n|----------|-----------|-----------|\n| **Company-Specific** | High churn (5.1% broadband quarterly loss rate Q2); post-restructuring execution risks; limited scale (0.5-1% US broadband subs). | Debt reduction unlocks $200M+ annual FCF; upgraded network supports ARPU growth (+1.5% YoY to $69.50). |\n| **Sector-Wide** | Cord-cutting (video subs -14K Q2); fiber competition from AT&T/Verizon; fixed wireless (T-Mobile/Verizon 5G Home). | Rising broadband demand (FCC data: US homes need 100Mbps+); BEAD funding ($42B federal grants) for rural expansion; cable M&A wave (e.g., Charter-Altice rumors). |\n\n## Existing Products/Services\n- **Residential**: High-speed internet (50Mbps-1.2Gbps, avg 500Mbps); cable TV (up to 200+ channels); voice (unlimited local/long-distance).\n- **Commercial**: Enterprise fiber internet (up to 10Gbps), Ethernet, hosted voice, cloud services for SMBs/hotels.\n- Pricing: Internet starts $40/mo (promos); bundles $80-120/mo.\n\n## New Products/Services/Projects\n- **Fiber Overlays**: Launching FTTH in Central Ohio/Indiana (2024-2025 rollout, 100K homes passed goal).\n- **5G Fixed Wireless Trials**: Partnerships testing in select markets (announced Q1 2024 call).\n- **WOW! Business Cloud Suite**: New UCaaS (unified comms) platform for SMBs, piloted Q3 2024.\n\n## Market Share and Forecasts\n- **Current US Broadband Market Share**: ~0.8% (789K residential subs / ~95M US total, per FCC Q1 2024 data; Leichtman Research).\n- **Forecast**: Decline to 0.6-0.7% by 2026 (analyst consensus: -3-5% annual sub losses; offset by fiber gains). Sector growth ~2% CAGR, WOW! underperforms at -1% CAGR (per Q2 earnings guidance).\n\n## Competitor Comparison\n\n| Metric (Q2 2024 or Latest) | WOW! | Charter (CHTR) | Comcast (CMCSA) | Altice (ATUS) |\n|----------------------------|------|-----------------|---------------|---------------|\n| Broadband Subs (M) | 0.79 | 30.1 | 32.6 | 4.3 |\n| Revenue ($B) | 0.42 | 13.7 | 29.7 | 2.3 |\n| Broadband ARPU | $69.50 | $82.50 | $80.00 | $75.20 |\n| Debt/Rev Multiple | 2.6x | 3.2x | 2.8x | 5.1x (pre-bankruptcy) |\n| YTD Stock Perf. | -45% | -15% | +5% | -60% |\n\n*Sources: Company 10-Qs, Seeking Alpha transcripts. WOW! lags on scale/ARPU but trades at 0.7x EV/Rev vs. peers 7-10x post-debt cut.*\n\n## Partnerships, M&A, Clients\n- **Partnerships**: Apollo (debt/equity investor); Astound Broadband (potential synergies discussed Q2 call); equipment with Arris/CommScope.\n- **M&A**: Acquired Buckeye Cablesystem (2017); no major since. Potential seller in consolidation (BofA note, Sep 2024).\n- **Current Major Clients**: Residential (80% revenue); SMBs (e.g., hotels, schools in IL/OH); enterprise (MDU contracts).\n- **Potential Clients**: Rural ISPs via BEAD wholesale; enterprise fiber deals in new FTTH areas.\n\n## Other Qualitative Measures\n- **Management**: CEO Therese Koppel (since 2022) debt-focused; strong operator track record.\n- **ESG**: Moderate—network upgrades reduce energy use; diversity initiatives.\n- **Sentiment**: Neutral (StockTwits 55/45 bull/bear); short interest 15% (Oct 2024).\n- **Risks**: Regulatory (net neutrality revival); capex overruns.\n\n## Investment Recommendation\n- **Buy Rating**: 3/10 (**SELL**). Debt relief provides floor, but persistent sub losses, weak guidance, and sector commoditization limit upside. High execution risk in fiber pivot amid competition.\n- **Fair Value Estimate**: $6.50 (23x 2025E FCF/share post-restructuring; 55% upside for growth portfolio). Assumes 2% sub growth stabilization, ARPU +3%; moderate risk tolerates volatility but flags churn as key watch. Target timeline: 12 months. (DCF-based, per consensus from 4 analysts: avg PT $5.75, range $4-8).",
  "generated_date": "2026-01-08T17:34:24.792233",
  "model": "grok-4-1-fast-reasoning"
}