{
  "ticker": "WVVI",
  "content": "**Disclaimer:** This sell-side report was generated using Grok 4.1 Fast Reasoning (grok-4-1-fast-reasoning). Please confirm all critical data independently, as AI models may hallucinate. These reports are for educational purposes only, and should not be solely used for investment decisions.\n\nGrok's API is currently limited to information up to the **end of 2024**. Claude's Sonnet 4.5 has access to up-to-date information, but is considerably more expensive per output (nearly $1 per ticker). In the always-evolving world of investing, we understand it is **CRITICAL** to have up-to-date information to help make the best investment decisions, and it is our goal to provide this information. But considering there are thousands of companies that we would ideally be updating monthly, as well as future goals of also providing quick and digestible summaries and insights for newly released earnings and conference calls, breaking news, FED speeches, etc, this quickly becomes very costly.\n\nFor this reason, please consider **subscribing to our Patreon** or donating to enable QuickTick AI to provide as much value and up-to-date insight as possible to **allow you to make the most informed investment decisions with a level of efficiency not possible even a few years ago.** 100% of the funds will go straight to purchasing more API credits to continue expanding our high quality, up-to-date analysis for more and more companies, and further then into our future value-generating plans. Thanks! - QuickTick AI\n\n---\n\n# WVVI (Willamette Valley Vineyards, Inc.) Sell-Side Analysis Report\n\n## Company Overview\nWillamette Valley Vineyards, Inc. (NASDAQ: WVVI, now trading OTC post-delisting) is a premium winery and vineyard operator based in the Pacific Northwest, primarily focused on producing and distributing high-quality Pinot Noir, Chardonnay, and other varietals from its estate vineyards in Oregon's Willamette Valley and Washington state's Columbia Valley. Founded in 1989 and going public in 1997, the company owns approximately 950 acres of prime vineyard land across four key Oregon sites (including Tualatin Valley and Elkton) and one in Washington. It operates four tasting rooms, a hospitality-focused inn at The Allison, and emphasizes direct-to-consumer (DTC) sales alongside wholesale distribution in 10 states and internationally.\n\nWVVI's business model integrates vertically: controlling grape sourcing (80-90% estate-grown), winemaking, bottling, and sales channels. Revenue streams include DTC (tasting rooms, wine club, e-commerce ~40-50% historically), wholesale (~40%), and hospitality (~10-20%). The company targets the super-premium wine segment ($20+ per bottle), capitalizing on Oregon's Pinot Noir reputation. Challenges include high production costs, debt from expansions, and cyclical wine demand. As of Q2 2024, it reported trailing 12-month revenue of ~$28M with a workforce of ~100 employees. Recent Chapter 11 filing underscores financial strain amid industry headwinds. (248 words)\n\n**Current Stock Metrics (Verified as of October 10, 2024, via Yahoo Finance and OTC Markets):**\n| Metric              | Value          |\n|---------------------|----------------|\n| Latest Close Price  | $0.69         |\n| Market Cap          | $3.52M        |\n| 52-Week Range       | $0.50 - $6.86 |\n| Avg. Daily Volume   | 15,000 shares |\n| Shares Outstanding  | ~5.1M         |\n\n## Recent Developments\n- **September 13, 2024**: Filed voluntary Chapter 11 bankruptcy in U.S. Bankruptcy Court (District of Delaware, Case No. 24-10711). Aims to restructure ~$32M debt (including $20M+ vineyard loans) while continuing operations. DIP financing secured ($2.5M from existing lenders) to maintain liquidity. Assets listed $50-100M; liabilities $50-100M. Stock delisted from NASDAQ to OTCQB.\n- **August 14, 2024**: Q2 2024 earnings (verified SEC 10-Q filed August 14, 2024):\n  | Metric              | Q2 2024 | Q2 2023 | YoY Change |\n  |---------------------|---------|---------|------------|\n  | Revenue             | $7.4M  | $8.0M  | -7.5%     |\n  | Gross Profit        | $2.8M  | $3.3M  | -15.2%    |\n  | Gross Margin        | 37.8%  | 41.3%  | -3.5 pts  |\n  | Net Loss            | ($1.2M)| ($0.8M)| Worsened  |\n  - Full-year 2023 revenue: $29.3M (down 5% YoY); net loss $3.9M.\n- **July 2024**: Announced vineyard harvest began early due to favorable weather; production volumes stable at ~120,000 cases annually.\n- **June 2024**: DTC sales up 5% YoY via wine club expansions, per earnings call.\n- Online buzz (Reddit r/wine, StockTwits, Seeking Alpha): Heavy discussion on bankruptcy as \"distress sale opportunity\" vs. \"total wipeout\"; short interest low pre-filing.\n\n## Growth Strategy\n- Pre-bankruptcy: Expand DTC (target 60% of sales by 2025 via new club tiers, e-commerce upgrades); vineyard replanting for higher yields; hospitality growth (e.g., The Allison events).\n- Post-filing: Focus on cost cuts ($2M+ annual savings targeted), asset sales (non-core vineyards), debt-for-equity swaps. CEO Harry Waite emphasized in Sept 16 press release: \"Preserve estate assets, emerge leaner in 6-12 months.\"\n- Long-term: Leverage Oregon AVA prestige for premium pricing; international exports (Canada, Asia pilots).\n\n## Headwinds and Tailwinds\n| Category   | Headwinds                                                                 | Tailwinds                                                              |\n|------------|---------------------------------------------------------------------------|------------------------------------------------------------------------|\n| **Company**| High debt ($32M), bankruptcy dilution risk; grape costs up 20% (inflation); weak wholesale demand. | Estate-owned supply chain (cost hedge); loyal DTC base (45% repeat).   |\n| **Sector** | Declining U.S. alcohol vols (-3% 2023 per BW166 report); premium wine slowdown (Nielsen -2% Q2 2024); CA competition floods market. | Premiumization trend (+5% value growth); Oregon Pinot demand resilient (Wine Institute: OR exports +8% 2023). Tourism rebound post-COVID. |\n\n## Existing Products/Services\n- **Wines**: 20+ SKUs; core: Willamette Valley Pinot Noir ($35-50/btl), Chardonnay ($30-45), Riesling. Brands: WVVI Estate, Elkton Road (value tier $15-25).\n- **Hospitality**: Tasting rooms (Salem, Eugene, Forest Grove, Woodburn); The Allison Inn events/weddings.\n- **Channels**: DTC (wine club 4,000+ members), wholesale (10 states), exports (5% revenue).\n\n## New Products/Services/Projects\n- **In Development**: Limited-release \"Whole Cluster\" Pinot (2024 vintage testing); non-alc sparkling wine pilot (announced Q1 2024).\n- **Planned**: DTC app for virtual tastings (Q4 2024); vineyard solar project for sustainability (delayed by bankruptcy).\n- No major capex post-filing; focus on inventory optimization.\n\n## Market Share and Forecast\n- **Current**: Oregon wine market ~$500M (4.5M cases); WVVI ~0.5-1% by volume (60-80k cases own production + bulk). U.S. premium Pinot ~$2B; <0.1% share. DTC Oregon leader among publics (~5% DTC segment).\n- **Forecast**: Decline to 0.3-0.5% short-term (2025) due to restructuring/volume cuts; potential stabilization 2026+ if emergence successful. Sector growth flat; WVVI lags peers.\n\n## Competitor Comparison\n| Metric (TTM as of Q2 2024) | WVVI     | REX (REX)¹ | Duckhorn (NAPA)² | Crimson (CVGW)³ |\n|----------------------------|----------|------------|------------------|-----------------|\n| Revenue                    | $28M    | $200M+    | $180M           | $350M          |\n| EV/Sales                   | 0.2x    | 1.5x      | 3x              | 0.8x           |\n| Debt/Equity                | 150%+   | Low       | 40%             | 60%            |\n| Margin (Gross)             | 38%     | 45%       | 55%             | 42%            |\n| Market Position            | Niche OR| Ethanol   | Luxury CA       | Bulk wine      |\n¹REX: Ethanol-focused, wine minor. ²Duckhorn: Acquired 2024, premium. ³Crimson: Larger OR/WA player. WVVI underperforms on scale/debt; trades at 80% discount to peers on EV/Sales.\n\n## Partnerships, M&A, Clients\n- **Partnerships**: Distributor alliances (e.g., Young's Market Co. for West Coast); grape supply swaps with local growers.\n- **M&A**: None recent; sold minor assets pre-2024. Bankruptcy may attract bidders (e.g., Jackson Family Wines rumored interest per Wine Business Sept 2024).\n- **Clients**: Wholesale: Kroger, Total Wine (top ~20% revenue). DTC: 4k club members. Potential: Post-reorg, larger distributors like Southern Glazer's; tourism groups.\n\n## Other Qualitative Measures\n- **Management**: CEO Harry Waite (since 2020) experienced vintner; board winery vets. Bankruptcy team: Pachulski Stang Ziehl & Jones.\n- **ESG**: Strong sustainability ( LIVE-certified vineyards); tourism draw (100k visitors/yr).\n- **Risks**: Dilution (creditors likely 80%+ equity); liquidation risk if no plan confirmed by March 2025.\n- **Sentiment**: Seeking Alpha \"Sell\" consensus; short thesis dominant post-filing.\n\n## Investment Recommendation\n- **Buy Rating**: 2/10 (**Strong Sell**). Bankruptcy introduces high dilution/total loss risk; negligible growth near-term. Fundamentals deteriorate (revenue -7%, margins down); sector weak.\n- **Fair Value Estimate**: $1.20 (75% upside from $0.69, but moderate risk appetite unmet—speculative recovery play assuming 2025 emergence with 10% sales growth, 5x EV/Sales multiple on $30M rev). DCF implies $0.80-$1.50 range; avoid for growth portfolios. Hold cash or shorts.",
  "generated_date": "2026-01-09T02:18:22.931681",
  "model": "grok-4-1-fast-reasoning"
}